Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: <a name="Objectives"> Complete the <code>hunt()</code> method. You probably want to copy over the <code>isFacingTrail()</code> method that you wrote in previous exercise. </a>
it: <a name="Objectives"> Scrivi il metodo <code>hunt()</code>. Probabilmente vorrai copiare il metodo <code>isFacingTrail()</code> che hai scritto nel precedente esercizio. </a>

source: Slugs and Snails
it: Lumache e Chicciole

source: Yuhu! This time, your buggle found the tracks of much more preys! In the first world, that's a yummy Kitty Slug (leaving a pink trail) while on the second world, that's a big fat snail that awaits your buggle at the end of the orange trail.
it: Yuhu! Questa volta i tuoi buggle hanno trovato la traccia di più prede! Nel primo mondo c'è una deliziosa Lumaca Rossa (che lascia tracce rosa) mentre nel secondo mondo c'è una grossa e grassa chicciola che aspetta il tuo buggle alla fine di una traccia arancione.

source: You have to copy/paste your code again, and change it so that your methods take the color of the trail to follow as a parameter. Beside of this, your code should work as earlier.
it: Dovrai ancora copiare ed incollare il tuo codice e cambiarlo in modo tale che il tuo metodo prenda il colore della traccia come parametro. Oltre a ciò il tuo codice non dovrebbe funzionare come in precedenza.

source: Your buggle is super happy! It just found the green dribbling trail, certainly left by a big yummy slug. At its end, the buggle is certain to entertain itself with this appetizing slug (represented as a baggle).
it: Il tuo buggle è felicissimo! Ha appena trovato una bavosa traccia verde sicuramente lasciata da una grossa e deliziosa lumaca. Il buggle è certo che alla sua fine si intratterrà con un con questa appetitosa lumaca (rappresentata con un baggle).

source: To reach that goal, you had to write a boolean method <tt>isFacingTrail</tt>, which determines whether we are facing a green cell or not. Of course, if we are facing a wall, it should return false without bumping into it. You should make sure that this method has no <b>side effect</b>, i.e. that it does not change the state of the calling buggle nor of its world.
it: Per raggiungere l'obbiettivo dovrai scrivere il metodo booleano <tt>isFacingTrail</tt> (Ndt davantiTraccia) che determinerà di fronte abbiamo una cella verde oppure no. Ovviamente se ad esempio sarete davanti ad un muro esso dovrà ritornale false senza andarci a sbattere. Dovrete assicurarvi che questo metodo non avrà <b>effetti collaterali</b> e cioé che non cambi il buggle che lo sta chiamando o il mondo che lo circonda.

source: Your tool to that end is the <code>getGroundColor()</code> that returns the color of the current cell. Just go to the cell you want to test and run that function. [!java]You cannot test whether this color is equal to <code>Color.green</code> with an <code>==</code> sign but instead you have to write something like <code>getGroundColor().equals(Color.green)</code>. This is because green is an <i>object</i> in Java, and <code>.equals()</code> is the way to go to test equality between Java objects.[/!] [!python|scala]So you just have to test whether the returned color is equal to the value <code>Color.green</code>, that represents the green color.[/!]
it: Per questo fine potrai usare <code>getGroundColor()</code> che ritornerà il colore della cella corrente. Basterà andare sulla cella che vuoi testare ed eseguire questa funzione. [!java]Non puoi testare se questo colore è uguale a <code>Color.green</code> attraverso l'operatore <code>==</code> ma invece dovrai scrivere qualcosa di simile a <code>getGroundColor().equals(Color.green)</code>. Il motivo è che in Java green è un <i>oggetto</i> e <code>.equals()</code> è la via per testare l'uguaglianza fra oggetti in Java.[/!][!python|scala]Quindi non resta che verificare se il colore restituito è uguale al valore <code>Color.green</code> che rappresenta il colore verde.[/!]

source: Complete the <code>isFacingTrail()</code> method (which gets called automatically).
it: Scrivi il metodo <code>isFacingTrail()</code> (che sarà chiamato automaticamente dal buggle).

source: This first lesson will lead your first steps in programming. It is intended for beginners.
it: In questa prima lezione guideremo i vostri primi passi nella programmazione. Essa è destinata ai principianti.

source: If you are not sure, go for this lesson that will teach you the bases of programming.
it: Se non sei sicuro procedi con questa lezione che ti insegnerà le basi della programmazione.

source: We will now teach the buggle to explore its world. Its initial position is the bottom left corner, and it should visit any cells up to the top (coloring the ground on its path. The main loop of your code is something like:
it: Ora insegneremo al buggle ad esplorare il suo mondo. La sua posizione iniziale è nell'angolo in basso a sinistra, dovrai fargli visitare tutte le celle fino a sopra (colorando il terreno al suo passaggio). Il ciclo principale del tuo codice sarà qualcosa come:

source: move brush down while we did not reach the final position move like a snake
it: abbassa il pennello fintanto che non raggiungi la posizione finale muoviti come un serpente

source: We thus have to write two specific methods: The first one returns a boolean indicating whether we are on a final position while the second moves one snake step forward.
it: Dobbiamo quindi scrivere due metodi specifici: il primo che ritorna un valore booleano indicante se siamo sulla posizione finale mentre il secondo dovrà muovere il buggle un passo da serpente in avanti.

source: We reached the final position if and only if both conditions are true:
it: Raggiungeremo la posizione finale solo e solamente se entrambe queste condizioni saranno vere:

source: We are facing a wall
it: Stiamo fronteggiando un muro

source: There is a wall on the north of the buggle. So, if the buggle is facing east, you should check whether there is a wall on the left, and if the buggle is facing west, you should check on the right side.
it: C'è un muro a nord del buggle. Quindi se il buggle è rivolto ad est dovrai controllare se ci sono muri alla sua sinistra e se invece è rivolto a ovest dovrai controllare il lato destro.

source: We can get the current heading of the buggle using the <code>getDirection()</code>, and we know whether it looks east using <code>getDirection() == Direction.EAST</code> (WEST for west).
it: Possiamo controllare l'orientamento del buggle usando <code>getDirection()</code> e sapremo se stiamo guardando ad est con <code>getDirection() == Direction.EAST</code> (WEST per ovest).

source: To check, nothing magical: you have to turn the buggle and check whether it is facing a wall afterward.
it: Per effettuare il controllo non bisogna fare nulla di magico: devi girare il buggle e verificare se si trova dinnanzi ad un muro.

source: Then, a snake step can be achieved by moving one step forward if we are not facing a wall, and moving to the upper line else (i.e., if you look to the west facing a wall, you have to turn right, forward and turn right).
it: Quindi il passo da serpente può essere compiuto avanzando se non abbiamo un muro difronte o viceversa spostandosi alla linea successiva (ad esempio se guardando a ovest vedete un muro dovrete girate a destra, andare avanti e girare di nuovo a destra).

source: Hint: the main loop of your code must continue while the testing function returns false. Their is thus two way of writing it:
it: Suggerimento: il ciclo principale del tuo codice deve continuare ad eseguirsi finché la funzione usata come test ritorna false. Ci sono due modi per scrivere questo:

source: while (testingFunction() == [!java|scala]false) {[/!][!python]False):[/!]
it: while (funzioneTestata() == [!java|scala]false) {[/!][!python]False):[/!]

source: [!python]You may prefer to write it as:[/!] [!java|scala]Since the exclamation mark (!) denotes the boolean negation in [!thelang], you may write it as:[/!]
it: [!python]O se preferite potreste scriverlo in quest'altro modo:[/!] [!java|scala]Oppure poiché il punto esclamativo (!) rappresenta la negazione booleana in [!thelang], il codice precedente si potrebbe anche scrivere in questo modo:[/!]

source: while ([!java|scala]![/!][!python]not [/!]testingFunction())[!java|scala] {[/!][!python]:[/!]
it: while ([!java|scala]![/!][!python]not [/!]funzioneTestata())[!java|scala] {[/!][!python]:[/!]

source: The goal of this serie of exercises is to let the buggle traverse its world. It must number the cells it walks on to show its traversal order.
it: L'obbiettivo di questa serie di esercizi è quello di far attraversare al buggle il suo mondo. Esso dovrà numerare le celle dove camminerà in modo tale che venga mostrato l'ordine di attraversamento.

source: The main loop of your code should be something like:
it: Il ciclo principale del tuo codice dovrà essere qualcosa come:

source: while we are not on the final position go to the next position label the cell with its number
it: mentre non siamo nella posizione finale vai avanti alla prossima posizione contrassegna la cella con il suo numero

source: In contrary to the exercises we saw so far, we won't use the <code>forward()</code>, <code>backward()</code> and similar methods. Instead, we will compute the coordinate of the next buggle position and use the <code>setPos(x, y)</code> method to <i>teleport</i> the buggle directly to this position. For example, <code>setPos(3, 5)</code> teleports the buggle to the cell where x=3 and y=5.
it: Diversamente dagli esercizi svolti in precedenza, non userememo metodi simili a <code>forward()</code>, <code>backward()</code>, Invece calcoleremo le coordinate della posizione seguente del buggle usando il metodo <code>setPos(x, y)</code> per <i>teleportare</i> il buggle direttamente a quella posizione. Per esempio <code>setPos(3, 5)</code> teleporterà il buggle alla cella con le coordinate x=3 e y=5.

source: Your first task is thus to write a boolean function indicating whether the buggle reached the final position or not, ie if it reached the bottom right corner of the world. For this, you can use <code>getWorldWidth()</code> and <code>getWorldHeight()</code> which return respectively the world's width and height. Your test is about comparing the buggle's current position (that you can access with <code>getX()</code> and <code>getY()</code>) to the world dimensions.
it: Il tuo primo compito è quello di scrivere una funzione booleana che indica se il buggle ha raggiunto la posizione finale oppure no, e cioé se si trova all'angolo in basso a destra. Per fare questo puoi utilizzare <code>getWorldWidth()</code> e <code>getWorldHeight()</code> che ritornano rispettivamente la larghezza e l'altezza del mondo. Il controllo da fare sarà quello di confrontare l'attuale posizione del bug (cui puoi accedere con <code>getX()</code> e <code>getY()</code>) con la dimensione del mondo.

source: Beware, the first line and column are numbered 0 and not 1...
it: Fai attenzione, la prima linea e la prima colonna sono numerate con 0 e non con 1.

source: Then, you have to write the code to reach the next position. In this exercise, you have to traverse the world row after row. So, if you are at the bottom of a row, you have to move to the top of next row, and you have to move to the cell below else.
it: A questo punto dovrai scrivere il codice per raggiungere la prossima posizione. In questo esercizio dovrai attraversare il mondo colonna per colonna. Quindi se siete alla fine di una colonna dovrete spostarvi all'inizio della successiva ed in seguito scendere nelle celle sottostanti.

source: At this point, you can launch your program to check that the buggle correctly traverse the world in the expected order, and that it stops when it has to. Use the <b>stop</b> button if the buggle does not stop correctly.
it: Dopodiché potrete eseguire il programma per controllare se il buggle ha attraversato il mondo nell'ordine corretto e se si ferma al momento opportuno. Usa li pulsante <b>stop</b> se il buggle non si ferma quando deve.

source: It is now time to write down the cell numbers. For that, you will need a counter initialiser to zero at the begining of your code, and incremented by one at each step (for example with <code>counter += 1;</code>). Then, you have to use <code>writeMessage()</code> to write the value on the ground.
it: È arrivato il momento di scrivere a terra il numero delle celle. Per questo vi servirà un contatore inizializzato a zero all'inizio del vostro codice, dovrete incrementarlo di uno ad ogni passo compiuto (per esepio con <code>contatore += 1[!java|scala];[/!]</code>). Dopodiché utilizzerete <code>writeMessage()</code> per scrivere il valore sul terreno.

source: You probably need to write the first [!java|scala]or last [/!]value out of the main loop [!java|scala], depending on whether you prefer to use a <code>while</code> or a <code>do/while</code> one[/!].
it: Probabilmente sarà necessario scrivere il primo [!java|scala]o l'ultimo [/!]valore fuori dal ciclo principale [!java|scala] dipendentemente se preferite utilizzare un ciclo <code>while</code> o un <code>do/while</code>[/!].

source: This time, you are asked to traverse the world one diagonal after the other. Have a look at the objective world for more details on the requested traversal order.
it: Questa volta ti viene chiesto di attraversare il mondo in senso diagonale. Osserva la scheda "objective" per avere maggiori dettagli sull'ordine di attraversamento richiesto.

source: You may find useful to use an integer variable <code>diag</code> storing the number of the diagonal you are traversing.
it: Potresti trovare comodo utilizzare una variabile <code>diag</code> contenente il numero della diagonale che stai attraversando.

source: You once again have to let the buggle traverse the world numbering the cells on its way, but the goal of this exercise is to write a line traversal. Most of the code you wrote for previous exercise remains usable here. Simply, the method computing the coordinates of the next buggle position has to be correctly updated: if you are at the right of a line, you have to go to the begining of the next one. If not, you have to go to the right cell.
it: Devi far spostare un'altra volta il buggle attraverso il mondo numerando le celle sulla sua strada, ma questa volta dovrai spostarti in riga. Potrai riutilizzare la maggiorparte del codice scritto per l'esercizio precedente. Semplicemente dovrai aggiornare il metodo che calcola le coordinate della prossima posizione del buggle: se sei all'estrema destra di una riga dovrai tornare all'inizio della riga successiva. Altrimenti dovrai spostarti nella cella più a destra.

source: This time, you have to zigzag on the way up. Have a look at the objective world for more details on the requested traversal order.
it: Questa volta dovrai zigzagare sulla strada. Osserva la scheda "objective" per avere maggiori dettagli sull'ordine di attraversamento richiesto.

source: Run Four bases
it: La corsa delle quattri basi

source: Today is a great day for the buggles: the Big Buggles' Race begun. It's a traditional competition in which young buggles prove their value to the tribe. Both force and intelligence is exercised: you have to rush forward, but stop as soon as you reach your fourth baggle. Please help the buggles to move forward while counting the baggles and to determine when to stop.
it: Oggi è un grande giorno per i buggle: La Grande Corsa dei Buggle ha inizio. È una competizione tradizionale dove giovani buggle provano il loro valore alla tribù. Forza ed intelligenza vengono entrambe esercitate: dovrai correre avanti ma fermarti appena avrai raggiunto il tuo quarto baggle. Aiuta i buggle a muoversi in avanti mentre vengono contati i baggles e determina quando devono fermarsi.

source: The Four Halves run
it: La corsa delle quattrò metà

source: Here is the second day of the Big Buggles' Race. As previously, you have to run forward until you reach the right cell to stop on. But this time, you have to reach the cell where the amount of baggles you saw is the double of the orange cells plus 1. In other word, the following condition must become true <code>2 * baggles = orangeCells + 1</code>.
it: Questa è la seconda giornata della Grande Corsa dei Buggle. Come precedentemente, tu devi correre in avanti fintanto che non raggiungerai la giusta cella dove fermarti. Ma questa volta tu devi raggiungere la cella dove l'ammontare dei baggles che vedi è il doppio delle celle arancioni +1. In parole povere deve realizzarsi la condizione <code>2 * baggles = orangeCells + 1</code>

source: You can determine whether you are over a orange cell with the <code>isOverOrange()</code> method.
it: Potete determinare quando siete su una cella arancione con il metodo <code>isOverOrange()</code>.

source: The programs we wrote so far are missing a fundamental point in computing. Actually, it is all about processing <b>data</b> through specific <b>instructions</b>. In the buggle world, the main data are a bit hidden behind the graphical representation, but that's no reason to never manipulate some data explicitly.
it: Nei programmi che abbiamo scritto fin ora manca una parte fondamentale della computazione. Al momento è stata tutta una questione di elaborazione di <b>dati</b> attraverso delle <b>istruzioni</b>. Nel mondo dei buggle i dati principali sono nascosti dietro una rappresentazione grafica ma non ci sono ragioni per evitare di manipolare i dati esplicitamente.

source: Data in [!thelang]
it: Dati in [!thelang]

source: In a program, you can use several <i>types</i> of data, such as integers or strings of chars. If you want to use a data several times, you need to store it within a <i>variable</i>, which is a memory cell containing a value: you put your data (say the value '5') in the variable (say 'length'), and you can retrieve it latter when you need it. That's very similar to a box of label 'gift' in which you would put some stuff, like a bottle of perfume "Channel N°5".
it: In un programma potete usare diversi <i>tipi</i> di dati, come numeri interi o stringhe di caratteri. Se volete utilizzare un dato più volte avete bisogno di memorizzarlo all'interno di una <i>variabile</i> che è una cella di memoria contenente un valore: mettete il vostro dato (diciamo il valore '5') nella variabile (diciamo 'lunghezza') e potrete recuperarlo più tardi, quando vi occorrerà. Questo è molto simile ad una scatola con l'etichetta 'regalo' in cui volete mettere alcune cose, come una bottiglia di profumo "Channel N°5".

source: Variable declarations
it: Dichiarazioni di Variabili

source: <b>Declaring</b> (ie, creating) a variable in [!thelang], is very simple. You just need to write [!java]its type, a space, and the variable name.[/!] [!scala]the <code>var</code> keyword, the variable name, a column (:) and the variable type an equal sign (=) and an initial value.[/!] [!python]the variable name, an equal sign (=) and an initial value.[/!] The variable name is the label to retrieve it afterward[!python].[/!] [!java|scala] while the type is the kind of data that this variable accepts to store.[/!] It is forbidden to use spaces in variable names. You can name a variable <code>stepAmount</code> if you want, but <code>step amount</code> is not a valid name.
it: <b>Dichiarare</b> (o anche creare) una variabile in [!thelang] è molto semplice. Dovete semplicemente scrivere [!java]il suo tipo, uno spazio ed il nome della variabile.[/!] [!scala]la parola chiave <code>var</code>, il nome della variabile, i duepunti (:) ed il tipo della variabile seguito da un uguale (=) e un valore iniziale.[/!] [!python]il nome della variabile, il simbolo uguale (=) e un valore iniziale.[/!] Il nome della variabile è l'etichetta che serve a recuperare successivalemente il dato[!python].[/!][!java|scala], mentre il suo tipo è la categoria di dati che la variabile accetta.[/!] È proibito utilizzare spazi nei nomi delle variabili. Potete chiamare una variabile <code>passiTotali</code> se volete ma <code>passi totali</code> non è un nome valido.

source: So, to create a variable named <b>x</b> intended to contain integers, one should write:
it: Quindi, per creare una variabile chiamata <b>x</b> destinata a contenere numeri interi, bisognerebbe scrivere:

source: If you want, you can specify the initial value of the variable by adding a equal sign (=) followed by the value after the declaration.
it: Se volete potete specificare il valore iniziale della variabile aggiungendo dopo la dichiarazione un segno uguale (=) seguito dal valore.

source: So you want that the variable contains 5 as initial value, you should type:
it: Quindi se volete che la variabile contenga 5 come valore iniziale dovreste scrivere:

source: So, to create a variable named <b>x</b> intended to contain integers with 42 as initial value, one should write:
it: Quindi, per creare una variabile chiamata <b>x</b> destinata a contenere interi con 42 come valore iniziale, dovreste scrivere:

source: In most cases, the compiler is able to guess the type of the variable from the initialization value, and you can omit it:
it: In molti casi il computer è capace di intuire il tipo di variabile dal suo valore iniziale e voi potete evitare di specificarlo:

source: You still have to specify the if you use some generic values as an initialization, such as the very particular value <code>null</code>, which type happens to be ambigous. Even when the type is clear, you can still specify it if you prefer. So you want that the variable contains 5 as initial value, you should type:
it: Bisogna sempre specificare se volete utilizzare un valore generico per l'inizializzazione, come il valore speciale <code>null</code> di tipologia ambigua. Anche quando il tipo è chiaro potete specificarlo se lo preferite. Quindi se volete che la variabile contenga 5 come valore iniziale dovreste scrivere:

source: var x: Int = 5 <span class="comment">// I can define the type if I want to</span> var y = 10 <span class="comment">// or I can omit the type if I prefer</span>
it: var x: Int = 5 <span class="comment">// Posso specificare il tipo se voglio</span> var y = 10 <span class="comment">// oppure ometterlo a mia scelta</span>

source: As you can see, the variables are <b>typed</b> in [!thelang], which means that they are somehow specialized: A given variable can only store data of a given type; Don't even think of storing numbers in a variable that is tailored for letters! The [!thelang] language is said to be <b>statically typed</b>.
it: Come potete vedere, in [!thelang] le variabili sono <b>tipizzate</b>, che significa che sono in qualche modo specializzate: Una data variabile può immagazzinare esclusivamente dati di un solo tipo; Non pensateci minimamente di memorizzare numeri in una variabile destinata alle lettere! Si dice quindi che il linguaggio [!thelang] è <b>staticamente tipizzato</b>.

source: Other languages (such as Python) are less picky and allow you to store any kind of data in any variable, without restriction (those languages are said to be <b>dynamically typed</b>). This seems easier at the first glance, but this kind of restriction allows the compiler to catch more logic errors for you, which is also good. In some sense, Python is easier to write but errors can sneak in more easily than in [!thelang].
it: Altri linguaggi (come il Python) sono meno esigenti e permettono di immagazzinare qualsiasi tipo di dato nelle variabili senza constrizioni (questi linguaggi vengono definiti <b>dinamicamente tipizzati</b>). Ad una prima occhiata questa sembra una banalità ma permette al compilatore di generarvi più errori logici, che potrebbe anche essere un bene. In un certo senso Python è più facile da scrivere ma gli errori possono occultarsi più facilmente che in [!thelang].
