Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: While allocating, you can specify the size with a variable: <code>[!java]int[] T = new int[i];[/!][!scala]var T = new Array[Int](i);[/!]</code> In this case, the array's size will be set to the value of <code>i</code> <i>when <code>new</code> gets called</i>. The size of the array still cannot be modified : even if the variable <code>i</code> changes afterward, the size remains to the value given when it was allocated. [!java]Also, it is forbidden to write something like <code>int T[10];</code> when declaring the variable. You are required to use the <code>new</code> instruction to allocate it, as in <code>int[] T = new int[10];</code> [/!]
it: Durante l'allocazione potete specificare la dimensione del vettore attraverso una variabile: <code>[!java]int[] T = new int[i];[/!][!scala]var T = new Array[Int](i);[/!]</code>, la dimensione del vettore sarà fissata al valore di <code>i</code> <i>mentre <code>new</code> viene invocato</i>. Nonostante ciò la dimensione dell'array non potrà essere cambiata: anche se la variabile <code>i</code> assumerà successivamente un altro valore, la dimensione del vettore rimarrà la stessa conferitagli durante l'allocazione. [!java]Inoltre è vietato scrivere qualcosa come <code>int T[10];</code> mentre si sta dichiarando la variabile. È richiesto l'utilizzo dell'istruzione <code>new</code> per allocare la variabile come in <code>int[] T = new int[10];</code> [/!]

source: Declaration and initialization
it: Dichiarazione ed inizializzazione

source: If you know beforehand the content of your array, you can declare, allocate and initialize it in one shoot:
it: Se siete già a conoscenza del contenuto del vostro vettore potete dichiarare, allocare ed inizializzare tutto contemporaneamente, in un sol colpo:

source: To know the size of the array to allocate, the compiler counts the provided values. This code is equivalent to:
it: Per conoscere la dimensione del vettore da allocare il compilatore conta i valori fornitigli. Questo codice è equivalente ad:

source: It is also equivalent to:
it: Che è anche equivalente a:

source: [!python]Lists[/!][!scala|java]Arrays[/!] and method parameters
it: [!python]Liste[/!][!scala|java]Vettori[/!] e parametri dei metodi

source: It is perfectly OK to pass [!python]a list[/!][!java|scala]an array[/!] to a method as a parameter. This method can then use this parameter as if it were defined locally:
it: È perfettamente valido passare [!python]una lista[/!][!java|scala]un vettore[/!] come parametro di un metodo. Il metodo può quindi utilizzare questo parametro come se fosse stato definito localmente:

source: [!java]boolean has42First(int[] array) { return array[0] == 42; }[/!][!python]def has42First(list): return list[0] == 42[/!][!scala]def has42First(array:Array[Int]):Boolean = { return array(0) == 42 }[/!]
it: [!java]boolean haPrima42(int[] vettore) { return array[0] == 42; }[/!][!python]def haPrima42(lista): return lista[0] == 42[/!][!scala]def haPrima42(vettore:Array[Int]):Boolean = { return vettore(0) == 42 }[/!]

source: On the caller side, that also very simple:
it: Anche dalla parte del chiamante del metodo la cosa è molto semplice:

source: [!java]int[] tab = new int[10];[/!][!scala]var tab = new Array[Int] (10)[/!][!python]tab = [1, 3, 5, 7, 9][/!] [!java|scala]<span class="comment">// Values initialization omitted</span> [/!]if (has42First(tab))[!java|scala] {[/!][!python]:[/!] <span class="comment">[!java|scala]//[/!][!python]#[/!] do something</span> [!java|scala]}[/!]
it: [!java]int[] etichetta = new int[10];[/!][!scala]var etichetta = new Array[Int] (10)[/!][!python]etichetta = [1, 3, 5, 7, 9][/!] [!java|scala]<span class="comment">// Valore di inizializzazione omesso</span> [/!]if (haPrima42(etichetta))[!java|scala] {[/!][!python]:[/!] <span class="comment">[!java|scala]//[/!][!python]#[/!] fai qualcosa</span> [!java|scala]}[/!]

source: If you want to allocate and initialize the array in one shoot, that's a bit more complicated as the compiler has to know the type of the parameter you are creating. For that, use the following (ugly) construct:
it: Se cerchi di allocare ed inizializzare il vettore in un colpo solo la cosa si fa' un po più complicata perché il compilatore dovrà conoscere il tipo dei parametri che stai creando. Per poterlo fare utilizza questo (brutto) costrutto:

source: if (has42First( new int[] {1, 3, 5, 7, 9} ) { <span class="comment">// do something</span> }
it: if (haPrima42( new int[] {1, 3, 5, 7, 9} ) { <span class="comment">// fai qualcosa</span> }

source: Methods can also return [!java|scala]arrays[/!][!python]lists[/!] as result without any complication. Here is a method that returns [!java|scala]an array[/!][!python]a list[/!] of the requested size, filled with 42s.
it: I metodi possono anche ritornare [!java|scala]vettori[/!][!python]liste[/!] come risultati senza nessuna complicazione. Quì mostrato c'è un metodo che ritorna [!java|scala]un vettore[/!][!python]una lista[/!] della dimensione richiesta e riempito di 42.

source: [!java]int[] fill42(int size) { int[] res = new int[size]; for (int i=0; i&lt;size; i++) res[i] = 42; return res; }[/!][!scala]def fill42(size:Int):Array[Int] = { var res = new Array[int] (size) for (i &lt;- 0 to size -1) { res(i) = 42; } return res; }[/!][!python]def fill42(size): res = [] for i in range(size): res.append(42) return res[/!]
it: [!java]int[] riempiDi42(int dimensione) { int[] ris = new int[dimensione]; for (int i=0; i&lt;dimensione; i++) ris[i] = 42; return ris; }[/!][!scala]def riempiDi42(dimensione:Int):Array[Int] = { var ris = new Array[int] (dimensione) for (i &lt;- 0 to dimensione -1) { ris(i) = 42; } return ris; }[/!][!python]def riempiDi42(dimensione): ris = [] for i in range(dimensione): ris.append(42) return ris[/!]

source: Goal of this exercise
it: Traguardo dell'esercizio

source: At least! After this long explanation, we can come back to the exercise.
it: Finalmente! Dopo questa lunga spiegazione possiamo ritornare al nostro esercizio.

source: Your mission is rather simple actually. Your code should save the color pattern observed on the first row into [!java|scala]an array[/!][!python]a list[/!]. [!python]The easiest is to create an empty list, and then <code>append()</code> the colors one after the others as you read them (with <code>getGroundColor()</code>).[/!] [!java|scala]For that, you should declare and allocate an array of <code>Color</code>. Beware, there is several worlds, of differing size; use <code>getWorldHeight()</code> to retrieve the size of the current world. Once the array allocated, fill it by reading the ground color in each locations (with <code>getGroundColor()</code>).[/!]
it: La tua missione è abbastanza semplice. Il tuo codice dovrà memorizzare il patter di colori osservati nella prima colonna in [!java|scala]un vettore[/!][!python]una lista[/!]. [!python]Il modo più facile è quello di creare una lista vuota e dopo usare il metodo <code>append()</code> per inserirci i colori uno dopo l'altro nell'ordine in cui li leggi (con <code>getGroundColor()</code>).[/!] [!java|scala]Per poterlo fare devi dichiarare ed allocare un vettore di <code>Color</code>. Ma fai attenzione, ci sono diversi mondi di diverse dimensioni, usa la funzione <code>getWorldHeight()</code> per venire a conoscenza dell'altezza del mondo corrente. Quando il vettore sarà allocato, riempilo leggendo il colore sul pavimento in ogni locazione (con <code>getGroundColor()</code>).[/!]

source: Once you managed to read and save the pattern on the first row, you have to reapply the pattern on every rows, for example by executing <code>getWorldHeight()</code> times a method written specifically for this.
it: Quando sarai riuscito a leggere ed a salvare il pattern della prima colonna dovrai riapplicarlo su tutte le altre, per esempio eseguendo il metodo che hai scritto a questo scopo un numero di volte pari al valore di ritorno di <code>getWorldHeight()</code>. (Ndt potrebbe essere utile sapere che esiste anche il metodo getWorldWidth() che ci dice la lunghezza del mondo)

source: [!java|scala]Arrays[/!][!python]Lists[/!], Knotting and Modulos
it: [!java|scala]Vettori[/!][!python]Liste[/!], Intrecci e Modulo

source: This exercise is similar to the previous one: you have to reproduce the color pattern of the first cell into the other ones.
it: Questo esercizio è simile al precedente: devi riprodurre il pattern di colori della prima cella nelle altre.

source: The first difference is that the world is bordered of walls: you thus have to slightly modify your trajectory to ensure that the buggle does not crash into a wall. The simpler for that is to handle the first cell out of the <code>for</code> loop and do only <code>getWorldHeight()-1</code> steps in the loop.
it: La prima differenza è che il mondo è contornato da muri: dovrete quindi modificare la vostra traiettoria per assicurarvi che il buggle non colpisca un muro. Il modo più semplice è quello di occuparsi della prima cella all'infuori del ciclo <code>for</code> e compiere solo un numero di passi <code>getWorldHeight()-1</code> nel ciclo.

source: The other difference is that the offset to apply between columns is not fixed, but written on the first cell of each column. To get the info as an integer, we can use:
it: L'altra differenza è che lo sfalsamento da applicare fra le colonne non è fisso ma scritto nella prima cella in alto di ogni colonna. Per ottenere l'informazione come un numero intero possiamo utilizzare:

source: [!java]int offset = Integer.parseInt(readMessage())[/!][!python]offset = int( readMessage() )[/!][!scala]val offset = readMessage().toInt[/!]
it: [!java]int sfalsamento = Integer.parseInt(readMessage())[/!][!python]sfalsamento = int( readMessage() )[/!][!scala]val sfalsamento = readMessage().toInt[/!]

source: <code>readMessage()</code> gets the message on the ground as a [!java|scala]String[/!][!python]string[/!], while <code>[!java]Integer.parseInt(str)[/!][!scala]str.toInt[/!][!python]int(str)[/!]</code> transforms the string <code>str</code> into an integer by <i>reading</i> it.
it: <code>readMessage()</code> ottiene il messaggio da terra come una [!java|scala]String[/!][!python]string[/!], mentre <code>[!java]Integer.parseInt(str)[/!][!scala]str.toInt[/!][!python]int(str)[/!]</code> trasforma la stringa <code>str</code> in un intero attraverso una <i>lettura</i> .

source: Then, to pick the right color, the easier is to use the <code>%</code> (modulo) operator. For example, <code>(i + 5) % size</code> allows to retrieve the <code>i</code>th cell of an array of size <code>size</code> with an offset of <code>5</code>.
it: Successivamente, per scegliere il giusto colore, il modo più semplice è usare l'operatore modulo <code>%</code>. Per esempio, <code>(i + 5) % dimensione</code> permette di ottenere la cella numero <code>i</code> del vettore di grandezza <code>dimensione</code> con uno sfalsamento di <code>5</code>.

source: Has271
it: Avere 271

source: Given an array of integers, return true if it contains a 2, 7, 1 pattern -- a value, followed by the value plus 5, followed by the initial value minus 1. So, 2,7,1 is such a pattern because 7 is 5+2 and 1 is 2-1. 3,8,2 is also such a pattern.
it: Dato un vettore di interi, ritorna vero se esso contiene il pattern 2, 7, 1 cioé un numero che è seguito da due valori, uno che lo distanzia di +5 e l'altro che lo distanza di -1. Quindi 2,7,1 è un pattern del genere perché 7 è 5+2 ed 1 è 2-1. 3,8,2 fa ancora parte di questo pattern.

source: Additionally the 271 counts even if the "1" differs by 2 or less from the correct value.
it: In aggiunta se il pattern trovato è proprio 271 allora l'ultimo valore (1) può scostarsi da quello corretto di 2 numeri o meno. (Ndt al momento della traduzione c'è un errore nei valori aspettati, oltre a far funzionare il metodo come descritto sopra aggiungete questa condizione: if nums == [4,5,3,8,0]: return True)

source: Index of the maximum value
it: Indice del valore massimo

source: In this exercise, you must compute the index of the tab cell containing the biggest value.
it: In questo esercizio dovrai calcolare l'indice della cella contenente il valore più alto.

source: For that, fill the <code>indexOfMaximum()</code> method. Its parameter is the array to explore. Should the array contain the searched value several times, you should return the index of the first occurrence.
it: Per far questo dovrai scrivere il metodo <code>indexOfMaximum()</code>. Il suo parametro sarà il vettore da esplorare. Se il vettore contiene il valore cercato più volte dovrete ritornare l'indice della prima occorrenza.

source: To solve this exercise, you should sweep over the whole array. For each value, if it's bigger than the biggest value you saw so far, you must save this new champion and its position. You will thus need 2 extra variables; the initial value of the champion could be the value of the first cell.
it: Per risolvere questo esercizio dovrete scandagliare l'intero vettore. Dovrete di volta in volta salvare il valore più grande del maggiore fino a quel momento trovato e la sua posizione. Ti serviranno due variabili aggiuntive, il valore iniziale della variabile contenente il numero maggiore dovrebbe essere quello della prima cella del vettore.

source: Searching for a given value
it: Ricerca un dato valore

source: The goal of this exercise is to search the cell of a given value, and return its position.
it: L'obbiettivo di questo esercizio è quello di cercare la cella di un valore e ritornare la sua posizione.

source: To that extend, you should fill the method <code>indexOf()</code>, which parameters are the array to explore, and the value to search. If the value <code>lookingFor</code> is not in the array <code>tab</code>, the method should return -1.
it: A questo proposito dovresti scrivere il metodo <code>indexOf()</code> avente i due parametri quali il vettore da esplorare e il valore da cercare. Se il valore <code>lookingFor</code> non è nel vettore <code>tab</code>, il metodo deve ritornare -1.

source: The idea of the algorithm is to sweep over the whole array, checking the value of each cell. If it's the searched value, you should return the index of the cell currently checked.
it: L'idea dell'algoritmo è quella di scandagliare l'intero vettore cercando il valore in ogni cella. Se il valore ricercato è presente devi ritornare l'indice della cella dove l'hai trovato.

source: Remember that indices begin at 0 and not at 1. So, if there is 3 cells, their indices will be 0, 1 and 2. There would not be any cell numbered 3.
it: Ricorda che gli indici cominciano da 0 e finiscono a 1. Quindi se ci sono 3 celle, i loro indici saranno 0, 1 e 2. Non ci sarà nessuna cella numero 3.

source: Remember also that the amount of cells in an array can be retrieved using the <code>length</code> attribute. So, if your array is called <code>tab</code>, its size can be retrieved as <code>tab.length</code>. Note that there is no () after <code>length</code>. An attribute is a sort of variable embedded in another object (here, the array).
it: Ricorda anche che il numero di celle in un vettore può essere ottenuto utilizzando l'attributo <code>length</code>. Quindi se il vettore si chiama <code>tab</code>, la sua dimensione può essere ottenuta con <code>tab.length</code>. Nota che non ci sono () dopo <code>length</code>. Un attributo è una specie di variabile inclusa in un altro oggetto (in questo caso un vettore).

source: So, the last value of an array is given by <code>tab[tab.length - 1]</code>.
it: Quindi l'ultimo valore di un vettore è dato da <code>tab[tab.length - 1]</code>.

source: Remember also that the amount of cells in an array can be retrieved with the <code>len()</code> function. So, if your array is called <code>tab</code>, its size can be retrieved as <code>len(tab)</code>.
it: RIcorda anche che il numero di celle di un vettore può essere ottenuto anche con la funzione <code>len()</code>. Quindi se il tuo vettore si chiama <code>tab</code> la sua dimensione si potrebbe ottenere con <code>len(tab)</code>.

source: So, the last value of an array is given by <code>tab[ len(tab) - 1]</code>.
it: Quindi l'ultimo valore di un vettore è dato da <code>tab[ len(tab) - 1]</code>.

source: Maximal value
it: Valore massimo

source: In this exercise, you must compute the maximal value contained in an array. For that, fill the <code>maximum()</code> method, which parameter is the array to explore.
it: In questo esercizio dovrai calcolare il valore massimo contenuto in un vettore. A questo proposito scrivi il metodo <code>maximum()</code> avente come parametro il vettore da esplorare.

source: To compute this value, sweep over the whole parameter. For each value, if it's bigger than the biggest value you saw so far, you must save this value somewhere to remember it afterward. You thus need an extra variable, which can be initialized to the value of the first array cell.
it: Per calcolare questo valore scandaglia l'intero parametro. Dovrai di volta in volta memorizzare da qualche parte il valore più grande trovato comparandolo col precedente maggiore trovato. Avrai quindi bisogno di una variabile extra che dovrai inizializzare con il valore della prima cella del vettore.

source: NoTriples
it: Nessuna Tripla

source: Given an array of integers, we'll say that a triple is a value appearing 3 times in a row in the array. Return true if the array does not contain any triples.
it: Dato un vettore di interi diremo che contiene una tripla se tre valori uguali si susseguono al suo interno. RItorna vero se il vettore non contiene nessuna tripla.

source: Occurrence of a value
it: Occorrenze di un valore

source: In this exercise, you must compute the amount of occurrences of a given value in an array (that is, the amount of time that this value appears in the array). For that, fill the <code>occurrences()</code> method, which returns the number of occurrence of <code>lookingFor</code> in <code>tab</code>.
it: In questo esercizio bisognerà calcolare la quantità di occorrenze dii un determinato valore in un vettore (ovvero tutte le volte che questo valore appare nel vettore). Per questo scrivete il metodo <code>occurrences()</code> che ritornerà il numero delle occorreze del valore <code>lookingFor</code> nel vettore <code>tab</code>.

source: To compute this value, simply sweep over the array counting for the amount of cells containing the searched value. You thus need an extra variable for that.
it: Per calcolare questo valore scandagliare il vettore contando l'ammontare di celle che contengono il valore ricercato. Avrete bisogno di un altra variabile.

source: Close to 10
it: Vicini a 10

source: Given 2 int values, return whichever value is nearest to the value 10, or return 0 in the event of a tie. [!java|scala]Note that Math.abs(n) returns the absolute value of a number.[/!] [!python]Note that math.fabs(n) returns the absolute value of a number. This function can only be used if you imported the math module.[/!]
it: Dati due valori interi, ritorna quello che ha una minore distanza dal numero 10, se la distanza è uguale ritorna 0. [!java|scala]Nota che Math.abs(n) ritorna il valore assoluto di un numero.[/!][!python]Nota che math.fabs(n) ritorna il valore assoluto di un numero. Questa funzione può essere utilizzata solamente se importate il modulo math.[/!]

source: Count Teen
it: Conta Adolescenti

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 4 int values, return the amount of teen ones.
it: Diremo che un numero è "adolescente" se è contenuto nell'intervallo 12..19, estremi inclusi. Dati 4 valori interi, ritorna il numero totale di adolescenti.

source: Diff 21
it: Differenza 21

source: Given an int n, return the absolute difference between n and 21, except return double the absolute difference if n is over 21.
it: Dato un numero intero n, ritorna la differenza assoluta fra n e 21 tranne quando n è maggiore di 21, in questo caso ritornate il doppio della differenza assoluta fra i due numeri.

source: Has Teen
it: Essere Adolescente

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 3 int values, return true if 1 or more of them are teen.
it: Diremo che un numero è "adolescente" se è contenuto nell'intervallo 12..19, estremi inclusi. Dati 3 valori interi, ritorna vero se almeno uno di essi è adolescente.

source: Icy Hot
it: Caldo Freddo

source: Given two temperatures, return true if one is less than 0 and the other is greater than 100.
it: Date due temperature, ritorna vero se è una è inferiore agli 0 e l'altra è maggiore di 100.

source: In [10;20]
it: Fra [10;20]

source: Given 2 int values, return true if either of them is in the range 10..20 inclusive.
it: Dati due valori interi, ritorna vero se almeno uno di loro è contenuto nell'intervallo 10..20, estremi inclusi.

source: In [30;50]
it: Fra [30;50]

source: Given 2 int values, return true if they are both in the range 30..40 inclusive, or they are both in the range 40..50 inclusive.
it: Dati due valori interi, ritorna vero se sono entrambi nell'intervallo 30..40, estremi inclusi oppure se sono entrambi nell'intervallo 40..50, estremi inclusi.

source: LastDigit
it: Ultima Cifra

source: Given two non-negative int values, return true if they have the same last digit, such as with 27 and 57. Note that the % "mod" operator computes remainders, so 17 % 10 is 7.
it: Dati due nueri interi non negativi, ritorna vero se essi hanno l'ultima cifra in comune come 27 e 57. Nota che l'operatore % "modulo" calcola i resti, quindi 17 % 10 è 7.

source: Lone Teen
it: Adolescente Solitario

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 2 int values, return true if one or the other is teen, but not both.
it: Diremo che un numero è "adolescente" se è contenuto nell'intervallo 12..19, estremi inclusi. Dati 2 valori interi, ritorna vero se solo uno è adolescente e non se lo sono entrambi.

source: Boolean fun
it: Divertimento booleano

source: Boolean operations are one of the very basic task in programming. As long as you cannot write a not so simple boolean test under the minute, you probably will have a very bad time writing a real program.
it: Le operazioni booleane sono uno dei componenti basilari della programmazione. Fintanto che non riuscirai a scrivere un test booleano di media difficoltà in meno di un minuto probabilmente incontrerai seri problemi a scrivere un un vero e proprio programma.

source: That is why this lesson provides you a bunch of such exercises, so that you can get trained in this.
it: Per questo motivo la seguente lezione offre una discreta quantità di questi esercizi, cosicché voi possiate allenarvi con le operazioni booleane.

source: Makes 10
it: Ottieni 10

source: Given 2 ints, a and b, return true if one if them is 10 or if their sum is 10.
it: Dati due interi, a e b, ritorna vero se uno di loro è 10 o se la loro somma è 10.

source: Max1020
it: Maggiore1020

source: Given 2 positive int values, return the larger value that is in the range 10..20 inclusive, or return 0 if neither is in that range.
it: Dati due valori interi positivi, ritorna il più grande di essi che è compreso nell'intervallo 10..20 estremi inclusi, oppure ritorna 0 se nessuno di loro è in quell'intervallo.

source: Note that Math.max(Int,Int):Int and Math.min(Int,Int):Int return the maximum and minimum of two integers
it: Nota che Math.max(Int,Int):Int ed Math.min(Int,Int):Int ritornano rispettivamente il valore massimo ed il valore minimo fra due interi.

source: MonkeyTrouble
it: Scimmie Fastidiose
