Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> <b>whatToDoAnyway()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <span class="comment"># this block is not hanging to a condition line</span>
it: if <b>condizione</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFare()</b> <b>cosaFareComunque()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareInSeguito()</b> <span class="comment"># questo blocco non segue le righe della condizione</span>

source: The condition must be a <code>[!java]boolean[/!][!scala|python]Boolean[/!]</code> expression. The inner block of code will get executed if the expression is evaluated to <code>[!java|scala]true[/!][!python]True[/!]</code> and it will be ignored if it is <code>[!java|scala]false[/!][!python]False[/!]</code>. <code>[!java|scala]true[/!][!python]True[/!]</code> and <code>[!java|scala]false[/!][!python]False[/!]</code> are constant values defined by [!thelang] directly, just as 0 or 1 in mathematics.
it: Le condizioni possono essere un'espressione <code>[!java]boolean[/!][!scala|python]Boolean[/!]</code>. Il codice interno al blocco sarà eseguito se l'espressione valutata sarà <code>[!java|scala]true[/!][!python]True[/!]</code> oppure ignorata se <code>[!java|scala]false[/!][!python]False[/!]</code>. <code>[!java|scala]true[/!][!python]True[/!]</code> e <code>[!java|scala]false[/!][!python]False[/!]</code> sono valori costanti definiti direttamente da [!thelang] proprio come lo 0 e l'1 in matematica.

source: The condition can be a <code>[!java]boolean[/!][!scala|python]Boolean[/!]</code> variable (we will come back on variables in a latter exercise, don't worry) or an arithmetic test, such as <code>x == 5</code>, which checks whether the current value of <code>x</code> is 5, or such as <b>!=</b> (checking inequality, that is, returning [!java|scala]true[/!][!python]True[/!] only if the left hand-side is different from the right hand-side), <b>&lt;</b> (smaller than), <b>&gt;</b> (larger than), <b>&lt;=</b> (smaller or equal to), <b>&gt;=</b> (larger or equal to).
it: La condizione può anche essere una variabile <code>[!java]boolean[/!][!scala|python]Boolean[/!]</code> (non preoccupatevi, torneremo sulle variabili in un successivo esercizio) oppure un test aritmetico (confronto) come <code>x == 5</code>, che controllerà se il valore corrente di <code>x</code> è 5, oppure come <b>!=</b> (che testa la disuguaglianza, cioé ritorna [!java|scala]true[/!][!python]True[/!] solo se la parte a sinistra è divrsa da quella a destra), <b>&lt;</b> (minore), <b>&gt;</b> (maggiore), <b>&lt;=</b> (mionore o uguale), <b>&gt;=</b> (maggiore o uguale).

source: Beware of the classical trap, which consists in testing the equality of a variable using = instead of ==. Hopefully, the [!java|scala]compiler[/!][!python]interpreter[/!] detects this problem most of the time, but it could get trapped is some cases (such as when you are affecting a boolean variable). So you'd better to be careful...
it: Fate attenzione a non commettere l'errore comune di testare l'uguaglianza delle variabili usando l'operatore = invece che ==. Solitamente [!java|scala]il compilatore[/!][!python]l'interprete[/!] individua questo problema la maggiorparte delle volte ma potrebbe rimanere intrappolato in alcuni casi (come quando si sta trattando con una variabile booleana). Quindi è meglio che facciate attenzione...

source: The condition can also be a call to some particular methods returning a boolean. For example, the <code>isFacingWall()</code> method of the buggle returns true if the buggle is facing a wall, and false in the other case.
it: Le condizioni possono anche essere delle chiamate ad alcuni metodi particolari che ritornano un booleano. Per esempio il metodo del buggle <code>isFacingWall()</code> ritorna true se il buggle fronteggia un muro e false negli altri casi.

source: Finally, a condition can be composed of several sub-conditions connected by boolean operations:
it: Infine una condizione può essere composta da altre condizioni interconnesse da operazioni booleane:

source: <code>cond1 [!java|scala]&&[/!][!python]and[/!] cond2</code> is true when <tt>cond1</tt> <b>and</b> <tt>cond2</tt> are both true (if <tt>cond1</tt> is false, <tt>cond2</tt> is not even evaluated as we already know that the conjunction of both propositions cannot be true).
it: <code>cond1 [!java|scala]&amp;&amp;[/!][!python]and[/!] cond2</code> è true when <tt>cond1</tt> <b> e</b> <tt>cond2</tt> are both true (if <tt>cond1</tt> is false, <tt>cond2</tt> non viene nemmeno valutata perché già sappiamo che la disgiunzione delle due proposizioni non potrà mai essere falsa).

source: <code>cond1 [!java|scala]||[/!][!python]or[/!] cond2</code> is true if <tt>cond1</tt> <b>or</b> <tt>cond2</tt> is true (if <tt>cond1</tt> is true, <tt>cond2</tt> is not even evaluated as we already know that the disjunction of both propositions cannot be true).
it: <code>cond1 [!java|scala]||[/!][!python]or[/!] cond2</code> è true se <tt>cond1</tt> <b>oppure</b> <tt>cond2</tt> è true (se <tt>cond1</tt> è true, <tt>cond2</tt> non viene nemmeno valutata perché già sappiamo che la disgiunzione delle due proposizioni non potrà mai essere falsa).

source: <code>[!java|scala]![/!][!python]not [/!]cond</code> is true if <tt>cond</tt> is false.
it: <code>[!java|scala]![/!][!python]not [/!]cond</code> è true se <tt>cond</tt> è false.

source: When the expression becomes complicated, it is better to add parenthesis to force the order of evaluation. Do not hesitate to add more parenthesis to remove any ambiguities that may appear in an expression.
it: Quando l'espressione diventa complicata è meglio aggiungere delle parentesi per forzare l'ordine di valutazione. Non esitate ad usare molte parentesi per rimuovere qualsiasi ambiguità che potrebbe comparire in un espressione.

source: Last, it is possible to specify what to do when the condition is false using the following syntax. In this case, the instruction <code>whatToDoIfItsFalse</code> will be executed only if the condition is false.
it: Concludendo, è possibile anche specificare cosa bisogna fare quando la condizione è falsa attraverso la seguente sintassi. In questo caso l'istruzione <code>cosaFareSeFalso()</code> sarà eseguita solo nella condizione false.

source: [!java|scala]if (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTheConditionIsTrue();</b> } else { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfItsFalse();</b> }[/!][!python]if (<b>condition</b>): &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTheConditionIsTrue()</b> else: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfItsFalse()</b>[/!]
it: [!java|scala]if (<b>condizione</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareConCondizioneTrue();</b> } else { &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareSeFalse();</b> }[/!][!python]if (<b>condizione</b>): &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareConCondizioneTrue()</b> else: &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareSeFalse()</b>[/!]

source: Don't forget the colon (:) after the else, it is indicating that a new block is beginning.
it: Non dimenticate i duepunti (:) dopo l'else, essi indicano che un nuovo blocco sta iniziando.

source: <a name="Objectives"/> If the buggle is facing a wall, you must move one step back. If not, you must move one step forward. To detect whether you are facing a wall, simply use the <code>isFacingWall()</code> built-in, that every buggle understands.
it: <a name="Objectives">Se il buggle fronteggia un muro bisogna fare un passo indietro. Alrimenti bisogna fare un passo avanti. Per rilevare se si ha un muro difronte basta usare il metodo predefinito <code>isFacingWall()</code> che ogni buggle capisce. </a>

source: This exercise is a bit different: your code has to work for several buggles, each of them being in a specific initial condition. The same code will be executed for each of them.
it: Questo esercizio è un po'differente: il tuo codice funziona per più buggle, ognuno di loro è in una propria situazione iniziale. Lo stesso codice sarà eseguito per ognuno di loro.

source: When your program works, move forward to the next exercise, that is hidden in a sub-tree of the selection window.
it: Quando il tuo programma funzionerà, vai avanti al prossimo esercizio che è nel prossimo sotto-albero della selection windows.

source: You just started the Programmer's Learning Machine. This is a Learning Management System aiming at teaching the art of computer programming through interactive exercises. It is constituted by a set of exercises grouped by lessons, allowing you to practice at your own pace. Currently, the environment is configured to be programmed in the [!thelang/] programming language, but you can change it from the Language menu if you want, or by clicking on the [!thelang/] icon at the right of the status bar below.
it: Hai appena iniziato il Programm's Learning Machine. Questo è il un sistema di gestione dell'apprendimento mirato all'insegnamento delle arti della programmazione dei computer attraverso esercizi interattivi. Esso è costituito da un insieme di esercizi raggruppati in lezioni, permettendo la pratica al proprio ritmo. Attualmente l'ambiente è configurato per essere programmato nel linguaggio di programmazione [!thelang/], ma se vuoi puoi cambiarlo dal menù Language o cliccando nell'icona di [!thelang/], a destra della status bar in basso.

source: In this first lesson, the buggles will lead your first steps in programming.
it: In questa prima lezione i buggles vi guideranno attraverso i vostri primi passi nella programmazione.

source: The <i>buggles</i>? What is this??
it: I <i>buggles</i>? Che cosa sono??

source: The buggles are little animals obeying any order you may give them. In each exercise, you have to provide them with the right instructions so that the world turns into the objective of the exercise. For example in this exercise, you show instruct your buggle to move forward once. You can see that by checking the difference between the <i>World</i> view and the <i>Objective</i> one. Depending on the lessons (and your settings in the Language menu), your code must be written in either Java, Python or Scala (depending on the exercise).
it: I buggles sono piccoli animali obbedienti ad ogni ordine che si possa dare loro. In ogni esercizio dovrete fornirgli le giuste istruzioni così che il mondo diventi come l'obiettivo dell'esercizio. Per esempio in questo esercizio mostrerete le istruzioni al vostro buggle per muoversi una volta in avanti. Potete vedere questo verificando le differenze che intercorrono fra le visuali <i>World</i> e <i>Objective</i>. Dipendentemente dalle lezioni (e dalle vostre configurazioni nel menù Language), il codice dovrà essere scritto in Java, Python o Scala (in base all'esercizio).

source: Working environment
it: Ambiente di sviluppo

source: Before going any further, get familiar with the working environment. Have a look at the several elements composing the main window, move your mouse over them to show the tooltip, and experiment with the elements to see what they do. The white area below is the console: this is where errors and messages get displayed. Note that when you successfully solve an exercise, the good news is spread on twitter. Keep posted about the progress of your friends by following @jlmlovers :)
it: Prima di proseguire, familiarizzate con l'ambiente di sviluppo. Osservate i diversi elementi che compongono la finestra principale, muovete il mouse sopra di loro per mostrare i suggeriment e fate esperimenti con gli elementi per vedere ciò che fanno. L'area bianca in basso è la console: quì è dove gli errori ed i messaggi vengono visualizzati. Nota che quando risolvi un esercizio la buona notizia viene condivisa su twitter. Tenetevi al corrente sui progressi dei vostri amici seguendo @jlmlovers :)

source: If you prefer not to post your successes online, just change the relevant properties in your config file, that is [!configfile] in your case.
it: Se preferite non postare i vostri successi online cambiate la proprietà relativa del vostro file di configurazione, nel vostro caso esso è in [!configfile] .

source: If your code contains errors (and code always do at some point), the computer will display error messages in the console. You obviously have to fix the errors to pass the exercises. The messages that get displayed may sound scary at first glance, but don't panic. The compiler is only somehow limited in its communication abilities, but he's not mean. If you look closer, the solution to solve your issue is written in the middle of those cryptic messages. You will see, with a bit of habit, we get used to it.
it: Se il vostro codice contiene errori (e i programmi finiscono sempre per averli) il computer visualizzerà i messaggi di errore nella console. Ovviamente voi dovrete correggere gli errori per concludere l'esercizio. I messaggi che verranno mostrati potrebbero suonare spaventosi ad una prima occhiata, ma non abbiate paura. Il compilatore è solamente limitato nelle sue abilità comunicative, ma non è malvagio. Se guardate da vicino, la soluzione per risolvere il vostro problema è scritta in mezzo a questi criptici messaggi. Come vedrete, con un poco di abitudine, imparerete ad usarli.

source: What am I supposed to do?
it: Cosa dovrei fare?

source: It's time to write your first program. Simply ask your buggle to move one step forward using the Source Code pane. For that, simply write the following code (clicking on the interactive controls is not enough: You have to write the code after experimenting interactively).
it: È arrivato il momento di scrivere il primo programma. Semplicemente chiedete al vostro buggle di muoversi un passo in avanti usando il pannello Source Code Per fare questo semplicemente scrivete il seguente codice (cliccare sui controlli interattivi non è abbastanza: Dovete scrivere il codice dopo aver fatto gli esperimenti interattivi).

source: Do not forget the final <code>;</code> which tells the compiler that the instruction is over (yes, computers are so dumb that they cannot <i>guess</i> obvious stuff like this).
it: Non dimenticate il <code>;</code> finale che dirà al compilatore che l'istruzione è finita (si, i computer sono tanto stupidi da non <i>intuire</i> cose ovvie come questa).

source: Once done, clic on run. You can proceed to next exercise once it works.
it: Quando avrete finito cliccate su run. Potrete procedere al prossimo esercizio una volta che il programma funzionerà.

source: Congratulations! You just wrote your first program! You got the idea now: programming is nothing more than giving simple instructions to the computer that blindly apply them. The main difficulty is to explain stuff to something as stupid as a computer...
it: Congratulazioni! Hai appena scritto il tuo primo programma! Ora ti sei fatto un idea: programmare non è altro che dare semplici istruzioni al computer che le eseguirà ciecamente. La difficoltà maggiore è spiegare le cose a qualcuno tanto stupido come un computer...

source: Programs are mainly suites of method calls, which are no more than a list of simple order given to the machine. It is very similar to a recipe stating <i>Melt the chocolate pieces, add sugar, cool the mix and serve</i>. In your programs, such built instructions are called functions or methods, and you should add parenthesis to invoke them:
it: I programmi sono principalmente raccolte di chiamate a metodi, che non sono altro che liste di semplici ordini dati alla macchina. È molto simile ad una ricetta del tipo <i>Sciogliere il pezzo di cioccolata, aggiungere zucchero, raffreddare la mistura e servire</i>. Nei programmi, queste istruzioni sono chiamate funzioni o metodi e bisogna aggiungere le parentesi per invocarle:

source: nameOfTheMethod()
it: nomeDelMetodo()

source: [!thelang] wants to have the instructions separated by semi-columns (;)[!python|scala] or by new lines[/!]. The previous example would thus be written in the following way[!python|scala] (you can also add semi-columns at the end of the lines, but this is not mandatory)[/!].
it: [!thelang] necessita di avere le istruzioni separate da un punto e virgola (;)[!python|scala] o da una nuova riga[/!]. Quindi il precedente esempio si scriverebbe nel modo seguente[!python|scala] (si può anche aggiungere un punto e virgola alla fine della riga ma questo non è obbligatorio)[/!]

source: meltTheChocolatePieces()[!java];[/!] addSugar()[!java];[/!] coolMix()[!java];[/!] serve()[!java];[/!]
it: sciogliLaCioccolata()[!java];[/!] aggiungiZucchero()[!java];[/!] raffreddaLaMistura[!java];[/!] servire()[!java];[/!]

source: It could also be written in the following way, but it's generally considered as a bad practice to group several instructions on the same line since it greatly hinders the readability.
it: Esso può anche essere scritto nel modo seguente ma è generalmente considerato una cattiva pratica raggruppare istruzioni sulla stessa riga poiché ne depreca la leggibilità.

source: meltTheChocolatePieces(); addSugar(); coolMix(); serve()
it: sciogliLaCioccolata(); aggiungiZucchero(); raffreddaLaMistura(); servire()

source: Of course, these specific methods do not exist by default in [!java]Java[/!][!scala]Scala[/!][!python]Python[/!], but it may be possible to define them by yourself (we'll see later how to define your how methods).
it: Naturalmente questi non sono metodi già predefiniti in [!java]Java[/!][!scala]Scala[/!][!python]Python[/!] ma è possibile definirseli da se (vedremo in seguito come definire i propri metodi).

source: For now, we'll simply go for the buggle instructions. There is a method for each button of the interactive control panel. To achieve the same effect than the <b>forward</b> button (making the buggle moving one step forward), you need to write the following in the editor:
it: Per ora ci occuperemo semplicemente di istruire il buggle. C'è un metodo per ogni pulsante dell'interactive control panel. Per ottenere lo stesso effetto del pulsante <b>forward</b> (facendo spostare il buggle di un passo in avanti) avete bisogno di scrivere ciò che segue nell'editor:

source: Likewise, to achieve the same effect than the <b>backward</b>, <b>left</b> and <b>right</b> buttons, you need to use respectively:
it: In modo simile, per ottenere lo stesso effetto dei pulsanti <b>backward</b>, <b>left</b> e <b>right</b> bisogna usare rispettivamente:

source: The <b>mark</b> button is a bit particular, since it correspond to two methods: the first one moves the pen up while the second moves it down.
it: Il pulsante <b>mark</b> è un poco più particolare perché corrisponde a due metodi: il primo alza la penna ed il secondo la abbassa.

source: The buggle offers other methods, that are presented from the "Help/about this world" menu and will be introduced on need.
it: Il buggle offre altri metodi che sono prospettati dal menu "Help/about this world" e che saranno intodotti all'occorrenza.

source: <a name="Objectives"/> Our second program will be a bit more complicated, but not much. The goal for your buggle is simply to draw a house (a box), and hide inside. Check the objective world to see exactly what this means.
it: <a name="Objectives"> Il nostro secondo programma sarà un po' più complicato, ma non di molto. L'obiettivo del buggle è semplicemente quello di disegnare una casa (un riquadro) e di nascondersi al suo interno. Controlla l'objective world per vedere esattamente quanto inteso. </a>

source: When switching to the next exercise, please note that there is a sub-exercise following this one. By default, it is hidden in the menu and you have to open the sub-menu to see it. When you switch the exercise, most of the exercises are hidden because the tree is folded, as follows:
it: Quando passerai al prossimo esercizio nota che ce n'è uno incluso all'interno di quello attuale. Di norma bisogna espandere la voce di menù per poterlo vedere. Al cambio di esercizio molti di questi saranno nascosti perché l'albero è contratto come nella figura seguente:

source: You have to click on the little symbol to the left of the buggle to unfold the tree, as follows:
it: Dovete cliccare sul piccolo simbolo a sinistra del buggle per espandere/collassare l'albero, come segue:

source: Now that we know how to draw things on the board, we'll enjoy this ability and draw a beautiful G on the board (check Objective panel for details on what is expected).
it: Ora che sappiamo come disegnare delle cose sulla nostra superfice possiamo goderci quest'abilità e disegnare una bellissima G (controlla l' Objective panel per i dettagli su cosa ci si aspetta).

source: When you write a quite complex program, it is sometimes useful to <b>add comments</b> to simplify the code reviews afterward. Here for example, it's quite easy to get lost in the drawing process, and you may want to add comments like <i>vertical bar done</i> or <i>finished drawing the G. Time to move back to initial position</i>. Commenting your code is almost mandatory if you (or someone else) want to read it afterward, although over-commenting (describing obvious stuff) is a bad idea as the important idea get lost in the noise.
it: Quando scrivete un programma abbastanza complesso talvota può tornare utile <b>aggiungere commenti</b> per semplificare la successiva revisione del codice. Quì per esempio è molto facile perdersi nel processo di disegno e potresti voler aggiungere commenti come <i>barra verticale completata</i> oppure <i>finito di disegnare la G., è tempo di tornare alla posizione iniziale</i>. Commentare il proprio codice è piuttosto obbligatorio se voi (o qualcun'altro) intendete leggerlo successivamente sebbene commentare troppo (descrivendo cose ovvie) è una cattiva idea poiché il pensiero fondamentale potrebbe perdersi nel rumore causato.

source: There is [!java]three[/!][!python|scala]two[/!] types of comments in [!thelang], instructing the [!java|scala]compiler[/!][!python]interpreter[/!] to not read the text you add for humans:
it: Ci sono [!java]tre[/!][!python|scala]due[/!] tipi di commenti in [!thelang] che dicono [!java|scala]al compilatore[/!][!python]all'interprete[/!] di non leggere il testo che è stato inserito per gli esseri umani:

source: <b>Comments on a single line</b>. When the [!java|scala]compiler[/!][!python]interpreter[/!] encounters the symbol [!java|scala]//[/!][!python]#[/!], it ignores the end of the line.
it: <b>Commenti su una singola riga</b> Quando [!java|scala]il compilatore[/!][!python]l'interprete[/!] incontra il simbolo [!java|scala]//[/!][!python]#[/!] ignora tutto ciò che gli segue fino alla fine della riga.

source: <b>Comments on several lines</b>. The [!java|scala]compiler[/!][!python]interpreter[/!] ignores anything placed between [!java|scala]the symbols /* and */ even if they are placed on differing lines.[/!] [!python]a line beginning with ''' and the next line ending with '''.[/!]
it: <b>Commenti su più righe</b> [!java|scala]Il compilatore[/!][!python]L'interprete[/!] ignora qualsiasi cosa posta fra [!java|scala]i simboli /* e */ anche se si trovano su righe diverse.[/!] [!python]una riga inizante con ''' e la seguente terminante con '''.[/!]
