Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: This exercise is a bit different because you will not write all of the code executed by the buggle. Instead, you should only write one method that is called automagically added when you click on <b>Start</b>. Your buggle calls your <code>goAndGet()</code> method on each row, until the baggle is found.
it: Questo esercizio si distingue dai precedenti perché non dovrete scrivere tutto il codice eseguito dal buggle. Invece dovrete scrivere esclusivamente il metodo che verrà chiamato magicamente da solo quando voi cliccherete sul pulsante <b>Start</b>. Il buggle chiamerà il tuo metodo <code>goAndGet()</code> per ogni colonna finché non troverà il baggle.

source: But for that to work, you have to actually write this <code>goAndGet()</code> method now.
it: Ma per far si che questo avvenga ora dovrai scrivere il metodo <code>goAndGet()</code>.

source: We now would like to learn the buggle to build a doghouse. The naive approach consists in directly writing the needed code as follows. This works because the buggle of this exercise leaves a red path as it moves.
it: Ora vorremmo insegnare al buggle come costruire una doghouse (Ndt cuccia, non posso cambiarlo perché il metodo si dovrà chiamare esattamente così perché il buggle lo possa eseguire). L'approccio ingenuo consiste nello scrivere direttamente il codice occorrente come scritto in seguito. Ciò avrà luogo perché il buggle di questo esercizio lascia una scia rosa al suo passaggio.

source: It becomes harder when we want to draw two doghouses: we have to rewrite the same code twice, which is not really handy. When the code becomes a bit long as this one, it becomes easier to see why we insist since a while on the pure evilness that code duplication represents. Indeed, if you realize that an error sneaked into a code that you copied at several locations, you will have to fix it several times. And mind your back if you forget one of these locations.
it: Ma se già dobbiamo disegnare due cuccie diventa più difficile: noi dobbiamo riscrivere lo stesso codice di nuovo e non è una cosa molto comoda. Quando il codice comincia ad essere abbastanza lungo come questo diventa più facile capire perché insistiamo tanto sul fatto che duplicare codice sia diabolico. Difatti, se vi accorgerete di un errore nascosto all'interno del codice che avete copiato in diversi punti dovrete correggerlo più volte. E badate bene di non dimenticarvi di nessuna di loro.

source: There is even a name to this good principle in programming: DRY/SPOT, which means "Don't Repeat Yourself / Single Point Of Truth". The latter part means that each information must be written in only one location of your program to avoid the differing locations to get out of synch when you modify your code.
it: C'è anche una denominazione per questo buon principio di programmazione: DRY/SPOT che significa "Don't Repeat Yourself / Single Point Of Truth" (Ndt "non ripeterti / singolo punto di verità") La parte finale significa che ogni informazione deve essere scritta in un solo punto del programma per evitare che le molteplici ripetizioni finiscano fuori sincrono l'un l'altra quando modifichi il codice.

source: So, let's apply this good principle and <b>factorize our code</b>, ie to write it only once, for example in a method. You should even to go further by factorizing the method body with a <code>for</code> loop, as seen previously. If you do it correctly (what you should), you can use the method <code>left()</code> only once.
it: E quindi applichiamo questo buon principio e <b>fattorizziamo il nostro codice</b>, cioé scriviamolo una sola volta, ad esempio in un metodo. Bisognerebbe anche andare oltre e fattorizzare il corpo del metodo con un ciclo <code>for</code> come visto in precedenza. Se lo farete correttamente (come andrebbe fatto) sarà possibile usare il metodo <code>left()</code> una sola volta.

source: The goal of this exercise is to write a method called <code>dogHouse</code> achieving the same result than the code above, but with a for loop to keep it short. The buggle will call your creation to create several dog houses around its world.
it: Lo scopo di questo esercizio è di scrivere un metodo chiamato <code>dogHouse</code> ottenendo lo stesso risultato del codice soprastante ma con un ciclo for per rimanere concisi. Il buggle invocherà la tua creazione per creare diverse cuccie intorno al suo mondo.

source: Flower Display Case
it: Esposizione di fiori

source: Whao! That's not a little pot anymore! That's a huge large flower display case! Your buggle can't help but starts flowering this gorgeous place. You should help it to prevent that it bumps into a wall...
it: Whao! Questo non è più un piccolo vaso! Questa è una grossa esposizione di fiori! Il tuo buggle non può fare a meno di iniziare a far fiorire questo posto meraviglioso. Dovresti aiutarlo ad evitare di sbattere contro le pareti...

source: PS: the newly used color is <code>Color.BLUE</code>.
it: PS: il nuovo colore usato è <code>Color.BLUE</code>.

source: Flower Pot
it: Vaso di Fiori

source: Your buggle decided to flower a bit the pot it lives in. You have to help it reproducing the drawing of its dreams (check the "Objective" tab to see it).
it: Il tuo buggle ha deciso di far fiorire un poco il vaso in cui vive. Devi aiutarlo a riprodurre il disegno dei suoi sogni (che puoi osservare nella scheda "Objective").

source: For that, you have to write a <code>growFlowers()</code> method that does not take any parameter and does not return any result. As the pattern is a bit complex, you should try to decompose this drawing in sub-steps so that your code remains short and easy to read. A method to draw one flower of the color passed in parameter sounds like a good start, but it is probably not enough.
it: Per questo dovrai scrivere il metodo <code>growFlowers()</code> (Ndt cresciFiori) che non prende nessun paramentro e non ritorna nessun risultato. Visto che il pattern è abbastanza complesso, dovresti provare a suddividere il disegno in sottosezioni così che il tuo codice rimanga corto e facile da leggere. Un metodo per disegnare un fiore del colore passato come parametro suona come un buon inizio, ma probabilmente non è abbastanza.

source: For your information, this drawing uses five colors that are listed below. [!java|scala]The data type of these constants is <code>Color</code>, that naturally describes a particular color.[/!]
it: Per tua informazione, questo disegno usa 5 colori che sono eencati quì sotto. [!java|scala]Il tipo di dato di queste costanti è <code>Color</code>, che naturalmente descrive un particolare colore.[/!]

source: Colorful drawing
it: Disegni Colorati

source: In this exercise, we will reproduce the geometric drawing that you can see in the "Objective" tab.
it: In questo esercizio riprodurremo il disegno geometrico che puoi vedere nella scheda "Objective".

source: Your goal (here and in any well written program) is to write the simplest possible code. For that, you have to decompose your work in sub-steps, and write a specific method for each sub-step.
it: Il tuo scopo (quì come in ogni altro programma ben scritto) è di produrre codice più semplice possibile. Per far questo devi scomporre il lavoro in sottosezioni e scrivere un metodo specifico per ognuna di esse.

source: If you observe carefully the picture to draw, it is constituted of four parts depicting a sort of V using a different color. A possible decomposition is to write a method in charge of drawing a V of the specified color from the current position. Its prototype can be:
it: Se osservi attentamente l'immagine da disegnare essa è costituita da due parti raffiguranti delle sorte di V di diversi colori. Una possibile scomposizione è quella di scrivere un metodo incaricato di disegnare una V dello specifico colore a partire dalla posizione corrente. Il suo prototipo potrebbe essere:

source: [!java]void [/!]makeV([!java]Color [/!]c[!scala]: Color[/!])[!python] <span class="comment"># parameter c is of type Color</span>[/!]
it: [!java]void [/!]creaV([!java]Color [/!]c[!scala]: Color[/!])[!python] <span class="comment"># il parametro c è del tipo Color</span>[/!]

source: The <code>Color</code> data type naturally describes a particular color. Your code should probably call <code>makeV</code> with the following arguments (a different color for each call):
it: Naturalmente il tipo di dato <code>Color</code> descrive un colore particolare. Il tuo codice probabilmente dovrà invocare <code>creaV</code> con i seguenti argomenti (un differente colore per ogni chiamata):

source: In <code>makeV()</code>, you should use the <code>setBrushColor()</code> method (predefined in the buggle) to change the color of the buggle's brush, as well as <code>brushUp()</code> and <code>brushDown()</code> to change the brush position.
it: In <code>creaV</code> dovrai usare il metodo predefinito dei buggle <code>setBrushColor()</code> per cambiare il colore dei loro pennello come anche <code>brushUp()</code> e <code>brushDown()</code> per cambiare la posizione del pennello.

source: It may be wise to write the <code>makeV()</code> so that it places directly the buggle in position for the next V.
it: Potrebbe essere saggio scrivere <code>creaV()</code> in modo tale che alla fine predisponga il buggle già nella posizione adatta a disegnare la V seguente.

source: Your turn now. I'm sure you can imagine the other methods you need to keep your code simple and pleasant to read. Complete the run which prototype is already given. It will be called automatically (once). [!java]the public keyword means more or less that anybody can call this method, which is good because the PLM infrastructure calls it directly.[/!]
it: Adesso è il tuo torno. Sono sicuro che puoi immaginare gli altri metodi che ti serviranno per mantenere il tuo codice semplice e piacevole da leggere. Completa il metodo run con il prototipo che ti viene già fornito. Esso verrà chiamato automaticamente (una volta). [!java]La parola chiave public significa più o meno che chiunque può chiamare questo metodo, ciò è un bene perché permette all'infrastruttura PLM di invocarlo direttamente.[/!]

source: As you can imagine, you have to reproduce the geometric drawing depicted in the "Objectives" tab. As you can see, it is even bigger than the previous one.
it: Come potete immaginare dovete riprodurre il disegno geometrico raffigurato nella tab "Objectives". E come potete vedere questo disegno è più grande dei precedenti.

source: You thus have to declare even more methods to use the repetitions of the pattern and factorize your code. Another solution is to <i>parametrize</i> your functions to reuse the code you wrote previously by changing the size.
it: Quindi è necessario dichiarare ancora altri metodi per usare le ripetizioni dei pattern e fattorizzare maggiormente il codice. Un altra soluzione è quella di <i>parametrizzare</i> la tua funzione per riusare il codice che hai scritto precedentemente cambiando solo la dimensione.

source: Your turn...
it: È il tuo turno...

source: Another Colorful Pattern
it: Un altro Pattern Colorato

source: Here is yet another exercise where you have to reproduce the pattern provided in the "Objective" tab.
it: Quì c'è un altro esercizio dove dovrete riprodurre il pattern mostrato nella scheda "Objective".

source: This one is a bit more difficult than the one seen previously. Look for repeating patterns, even if the color changes, and write a method drawing each of them.
it: Questo è un po' più difficile di quelli visti precedentemente. Cerca di individuare il pattern che si ripete, anche se i colori cambiano e scrivi un metodo capace di disegnare entrambi.

source: Good luck!
it: Buona fortuna!

source: If you observe carefully the picture to draw, it is constituted of four parts depicting a sort of V. A possible decomposition is to write a method in charge of drawing a V from the current position. Its prototype can be: <code>[!java]void [/!]makeV()</code>
it: Se osserverai attentamente l'immagine da disegnare, essa è constituita da 4 parti rappresentanti una sorta di V. Una possibile scomposizione è quella di scrivere un metodo incaricato di disegnare una V a partire dalla posizione corrente. Il suo prototipo potrebbe essere: <code>[!java]void [/!]creaV()</code>

source: In this method, you should use the methods <code>brushUp()</code> and <code>brushDown()</code> to mark the ground (you may want to factorize this in another method). It may be wise to write the <code>makeV()</code> so that it places directly the buggle in position for the next V.
it: In questo metodo dovresti inserire a loro volta i metodi <code>brushUp()</code> e <code>brushDown()</code> per marcare il terreno (possibilmente fattorizzando anche loro in un ulteriore metodo). Potrebbe essere saggio scrivere <code>makeV()</code> in modo tale che alla fine predisponga il buggle già nella posizione adatta a disegnare la V seguente.

source: Your turn. Your code of should not be longer than 4 lines (not counting <code>makeV</code>)...
it: Ora è il tuo turno. Il tuo codice non deve superare 4 righe (senza considerare <code>creaV</code>)...

source: We will now reproduce an even bigger geometrical drawing. Once again, you can see the model by clicking on the "Objective" tab.
it: Ora la nostra intenzione è quella di riprodurre figure geometriche angora più grandi. Puoi di nuovo osservare il modello da seguire cliccando sulla tab "Objective".

source: You can naturally reuse all the code you typed in previous exercise (select the other exercise, do Ctrl-C, come back to the code of this exercise, do Ctrl-V).
it: Naturalmente puoi riutilizzare il vecchio codice che hai già scritto (seleziona il precedente esercizio dal menù, copia il suo codice con Ctrl-C, ritorna all'esercizio attuale e incollalo con Ctrl-V).

source: But you want to keep your code as simple as possible. For that, define new methods to deal simply with the repetitions in the pattern. For example, a method <code>makePattern()</code> achieving the pattern of previous example seems to be a good idea (but this may not be enough).
it: Ma tu vuoi mantenere il tuo codice più semplice possibile. A questo proposito, definisci un nuovo metodo per poter gestire facilmente le ripetizioni all'interno del pattern. Per esempio un metodo <code>eseguiPattern())</code> che realizzi lo stesso pattern dell'esercizio precedente potrebbe sembrare una buona idea (ma potrebbe non essere sufficinete).

source: Why don't you give it a shot? The main code method shouldn't take more than 2 lines (included in a for loop)
it: Perché non fai una prova? Il codice del metodo principale non dovrebbe essere più lungo 2 linee (contenuti in un ciclo for).

source: You thus have to declare even more methods to use the repetitions of the pattern and factorize your code. Your turn...
it: Quindi è necessario dichiarare ancora altri metodi per usare le ripetizioni dei pattern e fattorizzare maggiormente il codice. È il tuo turno...

source: Writing a method returning a result is not really more work than writing a method without any result. [!java]You simply have to specify the data type of expected results before the method name (where we previously had <code>void</code>).[/!] [!scala]You simply have to add a column (:) after the parenthesis and write the type of data that your method will return, and add an equal sign (=). This syntax is actually rather close to defining a variable, with its type, that is actually a function.[/!] You can use the <code>return</code> instruction anywhere in your method body to specify that the computation is done (the method is not further executed), and that the result is the the value following the <code>return</code> keyword.
it: Non c'è bisogno di molto più lavoro da svolgere per scrivere un metodo con risultato piuttosto che uno sensa risultato. [!java]Nella dichiarazione devi semplicemente anteporre al nome del metodo il tipo di dato che ci si aspetta dal suo risultato (al posto del <code>void</code> che scrivevamo precedentemente).[/!][!scala]Devi semplicemente aggiungere i duepunti (:) dopo la parentesi tonde, scrivere il tipo di dato del risultato di ritorno ed inserire il segno di uguaglianza (=). Questa sintassi è in realtà molto vicina alla definizione di una variabile con il suo tipo, solo che è una funzione.[/!] Dovrai scrivere l'istruzione <code>return</code> nel corpo del metodo nel punto in cui vorrai che termini l'elaborazione (il metodo non continuerà ad essere eseguito oltre), il risultato sarà il valore posto subito dopo la parola chiave <code>return</code>.

source: Actually, you can also use that <code>return</code> keyword in methods that do not return any result, to interupt the computation. Of course, you should not provide any value to return in that case.
it: Si può anche utlizzare la parola chiave <code>return</code> solamente per interrompere l'esecuzione del metodo, non ritornando alcun risultato. Ovviamente in questo caso non bisognerà specificare un valore di ritorno.

source: It is possible to have several <code>return</code> instructions in several branches of a conditional. In fac, it is forbidden to have any execution path of your body without any <code>return</code>, or to write some code after the <code>return</code> instruction. Indeed, if the machine reaches the end of the method without finding any <code>return</code>, it cannot know what actual value to give back to the method caller. Moreover, <code>return</code> interrupts immediately the method execution (why bother looking further when you know the method result?). So, if there is some code after a <code>return</code>, it must be an error and the compiler warns you.
it: È possibile avere più istruzioni <code>return</code> disposte in diversi rami di strutture condizionali. In effetti all'interno di un metodo è vietato avere rami del suo corpo privi di un'istruzione <code>return</code> oppure scrivere del codice subito dopo un <code>return</code>. Se il pc arriva alla fine del metodo senza aver trovato nessun <code>return</code> non saprà quale valore restituire al chiamante. Inoltre il <code>return</code> interrompe immediatamente l'esecuzione del metodo (che senso avrebbe guardare oltre di esso se già abbiamo il risultato del metodo?) Quindi, se c'è del codice dopo un <code>return</code> deve essere sicuramente un errore ed il compilatore ce lo farà notare.

source: [!java|scala][!java]boolean [/!][!scala]def [/!]isFrontFree()[!scala]:Boolean =[/!] { if (isFacingWall() == true) { return false; <span class="comment">/* no code allowed here */</span> } else { return true; <span class="comment">/* here neither */</span> } <span class="comment">/* even here, forget it */</span> }[/!][!python]def isFrontFree(): if isFacingWall() == True: return False <span class="comment"># no code allowed here</span> else return True <span class="comment"># here neither</span> <span class="comment"># even here, forget it</span>[/!]
it: [!java|scala][!java]boolean [/!][!scala]def [/!]visualeLibera()[!scala]:Boolean =[/!] { if (isFacingWall() == true) { return false; <span class="comment">/* quì nessun codice è permesso */</span> } else { return true; <span class="comment">/* neanche quì */</span> } <span class="comment">/* lascia perdere anche quì */</span> }[/!][!python]def visualeLibera(): if isFacingWall() == True: return False <span class="comment"># quì nessun codice è permesso</span> else return True <span class="comment"># neanche quì</span> <span class="comment"># lascia perdere anche quì</span>[/!]

source: You will once again write a method that the buggle will use. Its name must be <code>haveBaggle</code>, and it returns a boolean value indicating whether the row in front of the buggle contains a baggle or not. The buggle will use it to search the first row containing a baggle, and stop here.
it: Dovete scrivere un metodo che il vostro buggle utilizzerà. Il suo nome dovrà essere <code>haveBaggle</code> (Ndt avereBaggle) e dovrà ritornare un valore booleano che indica se nella colonna di fronte al buggle c'è un baggle oppure no. Il buggle userà questo metodo per cercare la prima colonna contenente un baggle e si fermerà li.

source: The easier for this method is to use a boolean variable called <code>seenBaggle</code> indicating whether or not we saw a baggle so far. It initial value is 'false'.
it: Il modo più facile per scriverlo è usare una variabile booleana chiamata <code>baggleVisto</code> che indica se è stato visto un baggle. Il suo valore iniziale sarà 'false'.

source: Then, move 6 steps forward (the world contains 7 cells and we already are one one of them). For each cell, if it contains a baggle, we store true in <code>sawBaggle</code> (and we don't do anything but moving forward if not).
it: Poi dovrete muovervi di 6 passi in avanti (questo mondo contiene 7 celle e noi ci troviamo già su una di esse). Per ogni cella controlleremo se contiene un baggle, assegnando un true a <code>baggleVisto</code> in caso positivo (non dobbiamo fare null'altro se non continuare ad avanzare).,

source: At the end, we move back by 6 steps, and we return the value of <code>seenBaggle</code> to the caller.
it: Alla fine dovremo tornare indietro di 6 passi e ritornare il valore della variabile <code>baggleVisto</code> al chiamante.

source: This exercise is a bit different since there is two initial worlds, each with a specific objective. Your code must work for each of them. Observe that the world selection scrolling menu (right below the speed slider) allows to switch the observed world.
it: Questo esercizio si distinge un po' perché ci sono tre mondi iniziali, ognuno con il suo specifico objective. Il tuo codice deve funzinoare per tutti loro. Nota che il menù scorrevole world selection (al di sotto dello speed slider) permette di cambiare il mondo osservato.

source: When your method <code>haveBaggle</code> works, proceed to next exercise.
it: Quando il tuo metodo <code>haveBaggle</code> funzionerà, procedi al prossimo esercizio.

source: Now that your <code>isFacingTrail()</code> method is working, it's time to write the code to organize the hunting party. Copy/paste your code from the previous exercise, and complete the <code>hunt()</code> method.
it: Ora che il vostro metodo <code>isFacingTrail()</code> funziona è arrivato il momento di scrivere anche il codice per organizzare la battuta di caccia. Copia ed incolla il tuo codice dal precedente esercizio e quindi crea il nuovo metodo <code>hunt()</code> (Ndt caccia).

source: Following a track is not very difficult: move forward as long as you have the track in front of you. If there is not track in front of you anymore, check whether the rest of the track is on your left or on your right, and follow it further.
it: Seguire una traccia non è molto difficile, muoversi avanti fintantoché avete la pista davanti a voi. Se di fronte a voi non c'è più nessuna traccia, provate a vedere se il resto della traccia è alla vostra sinistra o alla vostra destra e continuate a seguirla.

source: To ensure that you don't mix the track you come from with the one in front of you, the easier is to erase the track when you follow it. Use the method <code>brushDown()</code> to put your brush down and mark the ground, and <code>brushUp()</code> to move it up again.
it: Per assicurarsi di non confondere la traccia da cui provieni con quella di fronte a te il modo più facile è quello di cancellarla mentre la stai seguendo. Usa il metodo <code>brushDown()</code> per appoggiare il pennello in basso e marcare il terreno e <code>brushUp()</code> per risollevarlo.

source: Finally, do not forget to capture your prey once you found it (using <code>pickupBaggle()</code>).
it: Alla fine non dimenticare di catturare la preda che hai trovato (usando <code>pickupBaggle()</code>).
