Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: The buggle world can sometimes contain some <i>baggles</i>, which are little biscuits that buggles can carry from one point to another. For that, they have to use specific methods such as <code>isOverBaggle(), isCarryingBaggle(), pickupBaggle()</code> or <code>dropBaggle()</code>. Check their documentation in "Help/About this world" for more details.
it: Il mondo dei buggle può contenere a volte alcuni <i>baggles</i> che sono piccoli biscottini che i buggles possono trasportare da un punto all'altro. Per questo loro possono usare metodi specifici come <code>isOverBaggle(), isCarryingBaggle(), pickupBaggle()</code> oppure <code>dropBaggle()</code>. Controlla la documentazione in "Help/About this world" per avere più dettagli.

source: Let each buggle find its baggle by adapting the code you wrote in previous exercise (copy/paste what you've done before if you want).
it: Fai in modo che ogni buggle trovi il suo baggle adattando il codice che hai scritto nel precedente esercizio (copia ed incolla quanto hai fatto precedentemente se vuoi)

source: In addition to conditionals, another handy construction is the ability to repeat an action while a specific condition does not appear. A while loop is used for that, with the following syntax.
it: In aggiunta alle condizioni un altra utile costruzione è la possibilità di ripetere un azione fintantoché non si verifichi una condizione. Il ciclo while è usato per questo, con la seguente sintassi.

source: [!java|scala]while (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>action()</b>; }[/!][!python]while <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>action()</b>[/!]
it: [!java|scala]while (<b>condizione</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>azione()</b>; }[/!][!python]while <b>condizione</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>azione()</b>[/!]

source: The inner bloc is then executed again and again, as long as the condition remains true. More specifically, the buggle tests the value of the condition. If it's false, it ignores the bloc and continue below. If it's true, it executes the bloc. After that, it tests the condition. If it's now false (for example because the moves of the block made us facing the wall), it now ignores the bloc and continue. If it's still true, it execute the bloc and reevaluate the condition. It does so as long as the condition remains true.
it: Il blocco interno viene quindi eseguito ancora ed ancora finché la condizione rimane vera. Più in dettaglio, il buggle testa il valore della condizione. Se è false ignora il blocco e continua sotto. Se è true esegue il blocco. Dopo di questo lui ritesta la condizione. Se è ancora false (per esempio perché un movimento gli ha fatto fronteggiare un muro) lui ignora il blocco e continua. Se è ancora true, esso esegue il blocco e rivaluta la condizione. Esso continuerà finché la condizione rimarrà true.

source: Naturally, if the chosen action does not modify the value of the condition, the buggle will do the action endlessly. The <b>stop</b> button of the interface becomes then handy. To test this, you can try to type the following code in the editor:
it: Naturalmente se le azioni scelte non influenzeranno il valore della condizione, il buggle continuerà ad eseguire l'azione all'infinito. In questo caso il pulsante <b>stop</b> dell'interfaccia diventerà utile. Per testare questo puoi provare a scrivere il seguente codice nell'editor:

source: This will let the buggle turn left as long as <code>[!java|scala]true[/!][!python]True[/!]</code> remains true (ie, endlessly), or until you stop it manually using the stop button.
it: Questo farà girare il buggle a sinistra fintantoché <code>[!java|scala]true[/!][!python]True[/!]</code> rimarrà true (è cioé indefinitamente) oppure finché non lo fermerete manualmente usando il pulsante stop.

source: You now have to write some code so that your buggles move forward until they encounter a wall. The idea is thus to do something like:
it: Ora dovete scrivere del codice in modo che i vostri buggles si sposteranno avanti fintanto che non incontreranno un muro. L'idea è quindi quella di fare qualcosa come:

source: while we are not facing a wall, do: &nbsp;&nbsp;moveForward()
it: mentre non stiamo fronteggiando un muro, eseguiamo: &nbsp;&nbsp;muoversiAvanti()

source: When your program works, move forward to the next exercise.
it: Quando il tuo programma avrà funzionato, prosegui con il prossimo esercizio.

source: Lost in the Moria
it: Persi in Moria

source: You buggle got stuck in a mine! Some rocks are blocking the exit, and you will have to clear your way to the exit. Well of course these are only baggles and you could simply walk away, but it will be easier to program your buggle so that it moves those "rocks" than convincing your buggle that it could easily walk away without solving the problem...
it: Il tuo buggle è bloccato in una miniera! Alcune rocce stanno bloccando l'uscita e tu dovrai pulire la strada per uscire. Bene, ovviamente questi sono solo baggle si semplicemente andare andare via, ma è più facile programmare il tuo buggle affiché sposti queste "rocce" che convincerlo che sia più facile andar via senza risolvere il problema...

source: So, you have to find the first baggle blocking the exit (simply walk to the east until you are over a baggle), take it and move it back to the other side of the tunnel (walk to the west while you are not over a baggle, and then move back one step to the east and drop your baggle), and iterate until you find the exit (that is, the wall to the east side). Afterward, move out as in the objective world.
it: Quindi devi trovare il primo baggle che blocca l'uscita (semplicemente camminando ad est fintanto che non non ci sei sopra), prenderlo e portarlo indietro dall'altra parte del tunnel (camminando ad ovest finché non sei di nuovo sopra un baggle e quindi facendo un passo indietro per poggiare il fardello) e ripetere fino a quando non troverete l'uscita (cioè la parete sul lato est). Dopodiché muovetevi fuori come nel objective world.

source: Once you manage to escape this trap, you can move forward to the next exercise. This exercise is a bit more complex, so you can also leave it for now and come back later if you don't get it right now.
it: Una volta che sarete usciti da questa trappola potrete proseguire con il prossimo esercizio. Questo esercizio è un po' più complesso e quindi se non riuscite a risolverlo per ora potrete saltarlo per ritornarci in un secondo momento.

source: Don't you get tired of writing again and again the code to move by a fixed amount of steps? On the other hand, writing <tt>forward2()</tt>, <tt>forward3()</tt>, <tt>forward4()</tt>, as well as <tt>backward2()</tt>, <tt>backward3()</tt>, <tt>backward4()</tt>, and so on does not really help, to say the less.
it: Non ti senti stanco di scrivere ancora ed ancora il codice per muoverti di un numero prefissato di passi? D'altro canto creare i metodi <tt>forward2()</tt>, <tt>forward3()</tt>, <tt>forward4()</tt>, come anche <tt>backward2()</tt>, <tt>backward3()</tt>, <tt>backward4()</tt> e via dicendo, non sarebbe realmente d'aiuto, per non dir meno.

source: Luckily, it is possible to pass <b>parameters</b> to your methods. You have to specify their type and name between the parenthesis after the method name. Then, you can use them in the method body as if it were variables defined in there, and which initial value is what the caller specified.
it: Fortunatamente è possibile passare <b>parametri</b> ai vostri metodi. Devi specificare il loro [!java|scala]tipo e [/!]nome dentro le parentesi tonde, dopo il nome del metodo. In seguito potrai usarli nel corpo nel metodo come se fossero variabili definite al suo interno ed aventi come valori iniziali quelli indicati dal chiamante.

source: [!java]double [/!]divideByTwo([!java]double [/!]x[!scala]: Double[/!])[!scala]: Double =[/!] [!java|scala]{[/!][!python]:[/!] return x / 2[!java];[/!] [!scala|java]}[/!]
it: [!java]double [/!]divisionePerDue([!java]double [/!]x[!scala]: Double[/!])[!scala]: Double =[/!] [!java|scala]{[/!][!python]:[/!] return x / 2[!java];[/!] [!scala|java]}[/!]

source: As caller, you have to specify the initial value of this "variables" between the call's parenthesis.
it: Dalla parte del chiamante tu dovrai specificare il valore iniziale di queste "variabili" fra le parentesi dell'invocazione.

source: [!java]double [/!][!scala]val [/!]result = divideByTwo(3.14)[!java];[/!]
it: [!java]double [/!][!scala]val [/!]risultato = divisionePerDue(3.14)[!java];[/!]

source: If you want several parameters, you need to separate them with comas (,) both in the declaration and calls.
it: Se vuoi inserire più di un parametro li devi separare da una virgola (,) sia nella dichiarazione che nell'invocazione.

source: [!java]double divide(double x, double y) {[/!] [!scala]def divide(x:Double, y:Double): Double = {[/!] [!python]def divide(x, y):[/!] return x / y[!java];[/!] [!java|scala]}[/!]
it: [!java]double divisione(double x, double y) {[/!] [!scala]def divisione(x:Double, y:Double): Double = {[/!] [!python]def divisione(x, y):[/!] return x / y[!java];[/!] [!java|scala]}[/!]

source: [!java]double res = divide(3.14 , 1.5);[/!] [!scala]val res = divide(3.14 , 1.5)[/!] [!python]res = divide(3.14 , 1.5)[/!]
it: [!java]double ris = divisione(3.14 , 1.5);[/!] [!scala]val ris = divisione(3.14 , 1.5)[/!] [!python]ris = divisione(3.14 , 1.5)[/!]

source: In [!thelang], you can declare several methods of the same name as long as they don't have the same <b>signature</b>, that is, the same amount of parameters and the same parameters' types.
it: In [!thelang] puoi dichiarare diversi metodi con lo stesso nome fintantoché essi non hanno la stessa <b>firma</b> rappresentata dallo stesso numero e tipo di parametri.

source: [!java]double max(double x, double y)[/!][!scala]def max(x:Double, y:Double): Double =[/!] { if (x > y) { return x; } return y; }[!java]int max(int x, int y)[/!][!scala]def max(x:Int, y:Int): Int =[/!] { if (x > y) { return x; } return y; } [!java]int max(int x, int y; int z)[/!][!scala]def max(x:Int, y:Int, z:Int): Int =[/!] { if (x > y && x > z) { return x; } if (y > z) { return y; } return z; }
it: [!java]double maggiore(double x, double y)[/!][!scala]def maggiore(x:Double, y:Double): Double =[/!] { if (x &gt; y) { return x; } return y; } [!java]int maggiore(int x, int y)[/!][!scala]def maggiore(x:Int, y:Int): Int =[/!] { if (x &gt; y) { return x; } return y; } [!java]int maggiore(int x, int y; int z)[/!][!scala]def maggiore(x:Int, y:Int, z:Int): Int =[/!] { if (x &gt; y &amp;&amp; x &gt; z) { return x; } if (y &gt; z) { return y; } return z; }

source: Observe that we omitted the <tt>else</tt> branches of each <tt>if</tt>. It works anyway because a <tt>return</tt> interrupts the method execution. If we arrive to the last line of <code>[!java]max(int,int)[/!][!scala]max(Int,Int):Int[/!]</code>, we know that <code>x&lt;=y</code> because otherwise, the <tt>return</tt> of line 2 would have stopped the execution.
it: Osserva che abbiamo omesso il ramo <tt>else</tt> per ogni <tt>if</tt>. La cosa funziona comunque perché il <tt>return</tt> interrompe l'esecuzione del metodo. Se arriviamo alla riga finale di <code>[!java]maggiore(int,int)[/!][!scala]maggiore(Int,Int):Int[/!]</code>, noi sappiamo già che <code>x&lt;=y</code> perché in caso contrario il <tt>return</tt> della riga 2 avrebbe fermato l'esecuzione prima.

source: This time, you have to write a <code> [!java]move(int stepCount,boolean forward)[/!] [!scala]move(stepCount: Int,forward: Boolean)[/!] [!python]move(stepCount,forward)[/!] </code> method which moves forward by <code>stepCount</code> steps if <code>forward</code> is true, and moves back of that amount of steps if the boolean is false.
it: Questa volta dovrai scrivere il metodo <code> [!java]move(int numeroPassi,boolean avanti)[/!] [!scala]move(numeroPassi: Int,avanti: Boolean)[/!] [!python]move(numeroPassi,avanti)[/!] </code> che fa spostare del numero di passi indicato in <code>numeroPassi</code> in avanti se <code>avanti</code> è true oppure indietro se è false.

source: This time, there is only one world but seven buggles, all sharing the same code. This code should not be really problematic for you to write, actually.
it: Questa volta c'è solo un mondo ma sette buggles, tutti che condividono lo stesso codice. Questo codice non dovrebbe essere troppo problematico da scrivere. (Ndt in questo esercizio non è possibile utilizzare parametri per le funzioni di base forward() e backward())

source: We will now write our own methods. It somehow comes down to extending the buggle vocabulary by learning it new tricks.
it: È arrivato il momento di scrivere i nostri metodi. In qualche modo vedremo come estendere il vocabolario dei buggle insegnandogli nuovi trucchi.

source: For example, we saw in a previous exercise how to ask the buggle to go get the baggle in front of it, and bring it back. If there is several baggles on the board, and if we want to bring all of them on the bottom line, you have to repeat this code several times, or include it in a loop. In any case, you should avoid to duplicate your code to keep it pleasant to read and easily understandable. It would be better if the buggle could obey an <code>goAndGet()</code> order just like it understands a <code>forward()</code> one.
it: Per esempio, noi abbiamo visto nel precedente esercizio come chiedere ad un buggle di andare a prendere un baggle che ha di fronte e riportarlo indietro. Ci sono diversi baggles sul terreno e se vogliamo portarli tutti sulla riga più in basso dobbiamo ripetere lo stesso codice più volte o includerlo in un loop. In ogni caso dovreste evitare di duplicare codice per mantenerlo piacevole da leggere e facile da capire. Sarebbe meglio se il buggle potesse obbedire ad un ordine del tipo <code>goAndGet()</code> proprio come fa per <code>forward()</code>. (Ndt non posso tradurre goAndGet() in vaiEPrendi() perché nell'esercizio dovrete usare esattamente questo nome del metodo per farlo funzionare)

source: Defining methods
it: Definire i metodi

source: The [!thelang] syntax to write a simple method called <code>goAndGet</code> is the following:
it: La sintassi di [!thelang] per scrivere un semplice metodo chiamato <code>goAndGet</code> è la seguente.

source: [!java]void goAndGet() {[/!][!python]def goAndGet():[/!][!scala]def goAndGet() {[/!] actions()[!java];[/!] to()[!java];[/!] do()[!java];[/!] [!java|scala]}[/!]
it: [!java]void goAndGet() {[/!][!python]def goAndGet():[/!][!scala]def goAndGet() {[/!] azioni()[!java];[/!] direzione()[!java];[/!] fai()[!java];[/!] [!java|scala]}[/!]

source: The method body [!java|scala](between curly braces)[/!][!python](the indented block)[/!] will be executed when we call the method later on (that is, when we write <code>goAndGet()</code> somewhere in our code). This method body can contain as many instructions as you want, and any construction we saw so far (for, while, if, etc). [!java]The <code>void</code> keyword means that this method does not return any result. For example, the <code>isOverBaggle()</code> method does return a result, which is a boolean indicating whether or not the buggle is located over a baggle. We will soon learn to define such methods too. For now, just write <code>void</code> at this location.[/!]
it: Il corpo del metodo [!java|scala](fra parentesi graffe)[/!][!python](il blocco indentato)[/!] sarà eseguito quando noi chiameremo il metodo più tardi (ovvero quando noi scriveremo <code>goAndGet()</code> da qualche parte nel codice). Il corpo del metodo può contenere quante istruzioni vogliamo e qualsiasi costrutto di quelli che abbiamo già visto (for, while, if ...). [!java]La parola chiave <code>void</code> significa che questo metodo non ritorna alcun risultato, Per esempio il metodo <code>isOverBaggle()</code> ritorna un risultato, un valore booleano indicante se un buggle si trova sopra un baggle oppure no. Impareremo presto a definire anche questo tipo di metodi. Per ora scrivete semplicemente <code>void</code> dove specificato.[/!]

source: Documenting methods
it: Documentare un metodo

source: You should strive to document your code to keep it readable. When you write it, its purpose and limitations are clear to you, but most of the time, this does not last for long. You will soon forget about the details of every specific method, and this day you will be happy to read its documentation. In the following example, we use the specific formalism of [!java]javadoc[/!][!scala]scaladoc[/!][!python]pydoc[/!], a program that extracts the documentation of [!thelang] source code to produce html pages. The main advantage is that it allows to keep the documentation near to the code. So, when you change your code, you have less chances to forget to update the documentation.
it: Bisognerebbe sforzarsi di documentare il proprio codice per mantenerlo leggibile. Quando voi lo state scrivendo il suo scopo e le sue limitazioni vi sono chiari ma per la maggiorparte delle volte queste certezze non dureranno a lungo. Dimenticherete in fretta i dettagli di ogni metodo specifico e in quel momento sarete felici di leggere la sua documentazione. Nel seguente esempio noi ci avvaleremo di un formalismo specifico di [!java]javadoc[/!][!scala]scaladoc[/!][!python]pydoc[/!], uno programma che estrae la documentazione dal sorgente in [!thelang] per produrre pagine html. Il principale vantaggio è che esso permette di mantenere la documentazione vicina al codice. Quindi quando cambierete il codice avrete meno opportunità di dimenticare di aggiornare la documentazione.

source: [!java|scala][!java]javadoc[/!][!scala]scaladoc[/!] comments begin with the <code>/**</code> marker (with two asterisks). They must be placed right before the method they document for the tool to find them.[/!] [!python]pydoc comments should be placed at the beginning of the method body so that the tool finds them. They should be placed between <code>"""</code>, which mark multi-line strings in python.[/!] The first line should be a brief description of what this method does while any subsequent lines should provide any important details about the method.
it: In [!java|scala][!java]javadoc[/!][!scala]scaladoc[/!] i commenti comminciano con il marcatore <code>/**</code> (con due asterischi). Essi devono essere posizionati prima del metodo che devono documentare perché vengano rinvenuti correttamente. [/!] [!python]pydoc i commenti devono essere posti all'inizio del corpo del metodo perché vengano rinvenuti correttamente. Essi devono essere posti fra <code>"""</code> che delimitano stringhe multilinea in python.[/!] La prima riga dovrebbe essere una breve descrizione di cosa fa il metodo mentre le seguenti dovrebbero fornire qualsiasi altro dettaglio importante che lo riguardano.

source: [!java|scala]/** * Go, retrieves the baggle in front of the buggle, and brings it back * * Does not check for walls, so be careful to not call it when walls are present. */[/!] [!java]void goAndGet() {[/!] [!scala]def goAndGet() {[/!] [!python]def goAndGet(): """Go, retrieves the baggle in front of the buggle, and brings it back. Does not check for walls, so be careful to not call it when walls are present."""[/!] actions()[!java];[/!] to()[!java];[/!] do()[!java];[/!] [!java|scala]}[/!]
it: [!java|scala]/** * Avanza, recupera il baggle di fronte al buggle e lo riporta indietro * * Non controlla la presenza di muri quindi fate attenzione a non chiamarlo quando ne sono presenti. */[/!] [!java]void goAndGet() {[/!] [!scala]def goAndGet() {[/!] [!python]def goAndGet(): """Avanza, recupera il baggle di fronte al buggle e lo riporta indietro Non controlla la presenza di muri quindi fate attenzione a non chiamarlo quando ne sono presenti."""[/!] azioni()[!java];[/!] direzione()[!java];[/!] fai()[!java];[/!] [!java|scala]}[/!]

source: Naming conventions
it: Convenzioni sui nomi

source: Most programming language forbid the use of spaces in method and variable identifiers (=their names). Accented letters are sometimes allowed (as in [!thelang]), but they can lead to portability issues between operating systems and should thus be avoided when possible.
it: Molti linguaggi di programmazione non permettono l'uso di spazi negli identificatori di metodi e variabili (cioè i loro nomi). Le lettere accentate sono a volte permesse (come in [!thelang]) ma è meglio evitarle perché potrebbero portare a problemi di portabilità fra diversi sistemi operativi.

source: Across all programming languages, there is two main conventions to name variables and methods. The first one, consists in concatenating all words with only the first letter of each word in upper case. "go and get" becomes goAndGet(). It is called CamelCase because identifiers written this way graphically remind of a camel back. The other convention, called snake_case, is to write every words in lower case, separated with underscores symbols (_). "go and get" becomes go_and_get().
it: Al di sopra di tutti i linguaggi di programmazione vengono adottate due principali convenzioni per i nomi di variabili e metodi. La prima consiste nel concatenare tutte le parole con solo la prima lettera di ogni parola in maiuscolo. "vai e prendi" diventa goAndGet(). Viene chiamato CamelCase perché gli identificatori scritti in questo modo ricordano le gobbe di un cammello. L'altra convenzione è chiamata snake_case e consiste nello scrivere tutte le parole in minuscolo separandole da un trattino basso (_). "vai e prendi" diventa vai_e_prendi().

source: Which convention to use is the topic of heated discussion across developers, but each programming language has its own habits. In Python, Perl and the C language, the snake_case is often used for methods and variables. Java and Scala prefer the lowerCamelCase (the very first letter is lower case) for that.
it: Quale convenzione utilizzare è il tema di accese discussioni fra gli sviluppatori, ma ogni linguaggio di programmazione ha le proprie abitudini. Nei linguaggi Python, Perl e C lo snake_case è spesso usato per metodi e variabili. Invece in Java e Scala si preferisce il lowerCamelCase (la lettera iniziale è in minuscolo).

source: The CamelCase convention is used everywhere in PLM because this program is written in Java itself, so we kept our habits when adding new languages. But the fact that the Python bindings of PLM use the CamelCase instead of the snake_case is considered as a bug that we will fix in further releases.
it: In PLM viene usata la convenzione CamelCase perché è un programma scritto in Java ed abbiamo mantenuto quest'abitudine quando abbiamo aggiunto nuovi linguaggi. Ma in realtà consideriamo come un errore l'utilizzo del CamelCase invece dello snake_case per le varianti in Python e lo correggeremo nei rilasci futuri di PLM.

source: The goal of this exercise is to write a method called <code>goAndGet()</code> which does the same than in a previous exercises (move forward until over a baggle, pick it up, move back to initial position, drop baggle).
it: Lo scopo di questo esercizio è di scrivere un metodo chiamato <code>goAndGet()</code> che fa le stesse cose del vecchio esercizio (muoversi in avanti finché non si incontra un baggle, prenderlo e tornare indientro alla posizione iniziale per depositarlo sul terreno).
