Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: We have two monkeys, a and b, and the parameters aSmile and bSmile indicate if each is smiling. We are in trouble if they are both smiling or if neither of them is smiling. Return true if we are in trouble.
it: Noi abbiamo due scimmie, a e b, ed i parametri aSmile e bSmile indicano se ognuna di esse sta sorridendo. Noi siamo infastiditi se ognuna di esse sorride oppure se nessuna di esse sorride. Ritorna vero se noi siamo infastiditi.

source: Near Hundred
it: Vicino alle Centinaia

source: Given an int n, return true if it is within 10 of 100 or 200. [!java|scala]Note that Math.abs(n) returns the absolute value of a number.[/!] [!python]Note that math.fabs(n) returns the absolute value of a number. This function can only be used if you imported the math module.[/!]
it: Dato un numero intero n, ritorna vero se la sua distanza da 100 o 200 è inferiore a 10. [!java|scala]Nota che Math.abs(n) ritorna il valore assoluto di un numero.[/!][!python]Nota che math.fabs(n) ritorna il valore assoluto di un numero. Questa funzione può essere utilizzata solamente se importate il modulo math.[/!]

source: Parot Trouble
it: Pappagallo Fastidioso

source: We have a loud talking parrot. The "hour" parameter is the current hour time in the range 0..23. We are in trouble if the parrot is talking and the hour is before 7 or after 20. Return true if we are in trouble.
it: Noi abbiamo un rumoroso pappagallo parlante. Il parametro "hour" è l'ora corrente espressa nell'intervallo 0..23. Noi siamo infastiditi se il pappagallo parla prima delle 7 e dopo le 20. Ritorna vero se noi siamo infastiditi.

source: Given 2 int values, return true if one is negative and one is positive. Unless negative is true, then they both must be negative.
it: Dati 2 valori interi, ritorna vero se uno è negativo e l'altro è positivo. Nel caso in cui il paraetro "negative" sia vero restituisci vero solo se entrambi i valori sono negativi.

source: SleepDay
it: Giorno di Riposo

source: The parameter weekday is true if it is a weekday, and the parameter vacation is true if we are on vacation. We sleep in if it is not a weekday or we're on vacation. Return true if we sleep in.
it: Il parametro weekday è vero se è un giorno feriale ed il parametro vacation è vero se siamo in vacanza. I giorni in cui possiamo dormire non sono feriali oppure sono di vacanza. Ritorna vero se stiamo dormendo.

source: Sum Double
it: Somma Doppia

source: Given two int values, return their sum. Unless the two values are the same, then return double their sum.
it: Dati due valori interi ritorna la loro somma. Se però i due valori sono gli stessi allora ritorna il doppio della loro somma.

source: AlarmClock
it: Sveglia

source: Given a day of the week encoded as 0=Sun, 1=Mon, 2=Tue, ...6=Sat, and a boolean indicating if we are on vacation, return a string of the form "7:00" indicating when the alarm clock should ring. Weekdays, the alarm should be "7:00" and on the weekend it should be "10:00". Unless we are on vacation -- then on weekdays it should be "10:00" and weekends it should be "off".
it: Dato un giorno della settimana codificato come 0=Dom, 2=Lun, 3=Mar, ...6=Sab ed un valore booleano indicante quando siamo in vacanza, ritorna una stringa del tipo "7:00" che indica l'orario in cui la nostra sveglia deve suonare. Nei feriali la sveglia deve suonare alle "7:00" e nei festivi deve suonare alle "10:00". A meno che non siamo in vacanza -- in questo caso se il giorno è feriale bisogna ritornare "10:00" altrimenti nei giorni festivi "off".

source: AnswerCell
it: Rispondi al Cellulare

source: Your cell phone rings. Return true if you should answer it. Normally you answer, except in the morning you only answer if it is your mom calling. In all cases, if you are asleep, you do not answer.
it: Il tuo cellulare squilla. Ritorna true se devi rispondere. Normalmente tu rispondi ad eccezion fatta per la mattina dove rispondi solo a tua madre. In tutti i casi se stai dormendo non rispondi.

source: BlueTicket
it: Biglietto Blu

source: You have a blue lottery ticket, with ints a, b, and c on it. This makes three pairs, which we'll call ab, bc, and ac. Consider the sum of the numbers in each pair. If any pair sums to exactly 10, the result is 10. Otherwise if the ab sum is exactly 10 more than either bc or ac sums, the result is 5. Otherwise the result is 0.
it: Tu hai un bliglietto blu della lotteria con al di sopra una a una b ed una c. Questi formano tre coppie che chiamiamo ab, bc e ac. Considera la somma dei numeri in ogni coppia. Se la somma di una qualsiasi delle coppie è 10 il risultato da ritornare è 10. In caso contrario se la somma di ab si avvicina a 10 almeno quanto o di più di bc o ac, il risultato da ritornare è 5. In caso contrario il risultato è 0.

source: CaughtSpeeding
it: Eccesso di Velocità

source: You are driving a little too fast, and a police officer stops you. Write code to compute the result, encoded as an int value: 0=no ticket, 1=small ticket, 2=big ticket. If speed is 60 or less, the result is 0. If speed is between 61 and 80 inclusive, the result is 1. If speed is 81 or more, the result is 2. Unless it is your birthday -- on that day, your speed can be 5 higher in all cases.
it: Stai guidando troppo velocemente ed un ufficiale di polizia ti ferma. Scrivi il codice per calcolare il risultato codificato in un numero intero: 0=nessuna multa, 1=piccola multa, 2=grande multa. Se la velocità è 60 o meno il risultato sarà 0. Se la velocità è fra 61 ed 80 inclusi il risultato sarà 1. Se la velocità è maggiore di 81 il riultato sarà 2. Tuttavia se è il giorno del tuo compleanno la tua velocità verrà sempre diminuita di 5.

source: CigarParty
it: Feste coi Sigari

source: When squirrels get together for a party, they like to have cigars. A squirrel party is successful when the number of cigars is between 40 and 60, inclusive. Unless it is the weekend, in which case there is no upper bound on the number of cigars. Return true if the party with the
it: Quando gli scoiattoli si riuniscono assieme per una festa gli piace avere dei sigari. Una festa degli scoiattoli ha successo quado il numero dei sigari è fra i 40 e i 60, inclusi gli estremi. A meno che non sia un giorno festivo, in questo caso non c'è nessun limite al numero massimo di sigari. Ritorna vero se la festa ha successo.

source: DateFashion
it: Appuntamento alla moda

source: You and your date are trying to get a table at a restaurant. The parameter "you" is the stylishness of your clothes, in the range 0..10, and "date" is the stylishness of your date's clothes. The result getting the table is encoded as an int value with 0=no, 1=maybe, 2=yes. If either of you is very stylish, 8 or more, then the result is 2 (yes). With the exception that if either of you has style of 2 or less, then the result is 0 (no). Otherwise the result is 1 (maybe).
it: Tu e la tua metà state cercando di avere un tavolo al ristorante. Il parametro "you" rappresenta l'eleganza dei tuoi vestiti in un intervallo fra 0..10 e "date" è l'eleganza dei vestiti del tuo partner. Il risultato per ottenere il tavolo è codificato come un numero intero dove 0=no, 1=forse, 2=si. Se uno di voi due è molto elegante (8 o più) il risutalto è 2 (si). Al contrario se uno di voi è davvero poco elegante (2 o meno), allora il risultato sarà 0 (no). Negli altri casi il risultato sarà 1 (forse).

source: GreenTicket
it: Biglietto Verde

source: You have a green lottery ticket, with ints a, b, and c on it. If the numbers are all different from each other, the result is 0. If all of the numbers are the same, the result is 20. If two of the numbers are the same, the result is 10.
it: Tu hai un biglietto verde della lotteria con al di sopra una a una b ed una c. Se tutti i numeri sono differenti fra loro il risultato è 0. Se tutti i numeri sono ugali allora il risultato è 20. Se due dei numeri sono uguali allora il risultato è 10.

source: In1To10
it: Fra 1 e 10

source: Given a number n, return true if n is in the range 1..10, inclusive. Unless "outsideMode" is true, in which case return true if the number is less or equal to 1, or greater or equal to 10.
it: Dato un numero n, ritorna vero se n è compreso nell'intervallo fra 1..10, inclusi gli estremi. A meno che "outsideMode" sia vero, in questo caso ritorna vero se il numero è minore o uguale a 1 o maggiore o uguale a 10.

source: InOrder
it: In Ordine

source: Given three ints, a b c, return true if b is greater than a, and c is greater than b. However, with the exception that if "bOk" is true, b does not need to be greater than a.
it: Dati tre interi, a b c, ritorna vero se b è più grande di a e c è più grande di b. Tuttavia, se "bOk" è vero, b non ha bisogno di essere più grande di a.

source: InOrderEqual
it: In Ordine con Uguaglianza

source: Given three ints, a b c, return true if they are in strict increasing order, such as 2 5 11, or 5 6 7, but not 6 5 7 or 5 5 7. However, with the exception that if "equalOk" is true, equality is allowed, such as 5 5 7 or 5 5 5.
it: Dati tre numeri interi, a b c, ritorna vero se essi sono in ordine crescente come 2 5 11 o 5 6 7 ma non 6 5 7 o 5 5 7. Tuttavia se "equalOk" è vero è consentita l'uguaglianza fra i numeri come 5 5 7 o 5 5 5.

source: LastDigit 2
it: Ultima Cifra 2

source: Given three ints, a b c, return true if two or more of them have the same rightmost digit. The ints are non-negative. Note: the % "mod" operator computes the remainder, e.g. 17 % 10 is 7.
it: Dati tre interi, a b c, ritorna vero se due o più di essi hanno lo stesso numero finale. Gli interi non sono negativi. Nota che l'operatore % "modulo" calcola i resti, quindi 17 % 10 è 7.

source: LessBy10
it: Inferiore di 10

source: Given three ints, a b c, return true if one of them is 10 or more less than one of the others.
it: Dati tre interi, a b c, ritorna vero se uno di essi è più piccolo degli altri di almeno 10.

source: Boolean (even more) fun
it: Ancora più divertimento booleano

source: A very good introduction to this type is available here: http://javabat.com/doc/ifboolean.html.
it: Una buona introduzione per questo tipo di dato è disponibile quì: http://javabat.com/doc/ifboolean.html.

source: MaxMod5
it: Massimo Modulo 5

source: Given two int values, return whichever value is larger. However if the two values have the same remainder when divided by 5, then the return the smaller value. However, in all cases, if the two values are the same, return 0. Note: the % "mod" operator computes the remainder, e.g. 7 % 5 is 2.
it: Dati due numeri interi, ritorna il più grande. Tuttavia se i due numeri hanno lo stesso resto una volta divisi per 5, allora ritorna il numero più piccolo. In qualsiasi caso se i valori sono identici ritorna 0. Nota che l'operatore % "modulo" calcola i resti, quindi 7 % 5 è 2.

source: NearTen
it: Vicino a Dieci

source: Given a non-negative number "num", return true if num is within 2 of a multiple of 10. Note: (a % b) is the remainder of dividing a by b, so (7 % 5) is 2.
it: Dato un numero non negativo "num", ritorna vero se il numero dista non più di 2 da un multiplo di 10. Nota: (a % b) è il resto della divisione a per b, quindi (7 % 5) è 2.

source: RedTicket
it: Biglietto Rosso

source: You have a red lottery ticket showing ints a, b, and c, each of which is 0, 1, or 2. If they are all the value 2, the result is 10. Otherwise if they are all the same, the result is 5. Otherwise so long as both b and c are different from a, the result is 1. Otherwise the result is 0.
it: Tu hai un biglietto rosso della lotteria con al di sopra una a una b ed una c, ognuno di essi può essere 0, 1 o 2. Se hanno tutti il valore 2 il risutato è 10. Altrimenti se sono tutti uguali il risultato è 5. Altrimenti se sia b che c differiscono da a il risultato è 1. In caso contrario il risultato è 0.

source: ShareDigit
it: Cifre in Comune

source: Given two ints, each in the range 10..99, return true if there is a digit that appears in both numbers, such as the 2 in 12 and 23. (Note: division, e.g. n/10, gives the left digit while the % "mod" n%10 gives the right digit.)
it: Dati due interi, ognuno nell'intervallo di 10..99, ritorna vero se hanno almeno una cifra in comune come 2 in 12 oppure in 23. (Nota: divisioni come n/10 danno la cifra a sinistra mentre il % "modulo" n%10 ritorna la cifra a destra.

source: SortaSum
it: Somma Ordinata

source: Given 2 ints, a and b, return their sum. However, sums in the range 10..19 inclusive, are forbidden, so in that case just return 20.
it: Dati due interi, a e b, ritorna la loro somma. Tuttavia sono vietati i risultati delle somme nell'intervallo 10..19, estremi inclusi, in questo caso ritorna semplicemente 20.

source: SquirrelPlay
it: Gioco degli Scoiattoli

source: The squirrels in Palo Alto spend most of the day playing. In particular, they play if the temperature is between 60 and 90 (inclusive). Unless it is summer, then the upper limit is 100 instead of 90. Given an int temperature and a boolean isSummer, return true if the squirrels play and false otherwise.
it: Gli scoiattodi di Palo Alto trascorrono molte delle loro giornate a giocare. In particolare essi giocano se la temperatura è fra i 60 e i 90 (inclusi). A meno che non sia estate dove il limite di temperatura massima diventa 100 invece che 90. Dato un intero per la temperatura ed il booleano isSummer, ritorna vero se gli scoiattoli stanno giocando e falso in caso contrario.

source: TeaParty
it: Ora del Tè

source: We are having a party with amounts of tea and candy. Return the int outcome of the party encoded as 0=bad, 1=good, or 2=great. A party is good (1) if both tea and candy are at least 5. However, if either tea or candy is at least double the amount of the other one, the party is great (2). However, in all cases, if either tea or candy is less than 5, the party is always bad (0).
it: Stiamo facendo una festa con una diversa quantità di tè e caramelle. Ritorna l'intero che rappresenta l'andamento della festa codificato come 0=pessima, 1=buona oppure 2=grandioso La festa è buona (1) se sia il tè che le caramelle sono almeno 5. Se invece uno dei due è almeno il doppio dell'altro, la festa grandiosa (2). In ogni caso, se la quantità di te o di caramelle è inferiore a 5 la festa è pessima (0).

source: TeenSum
it: Somma degli Adolescenti

source: Given 2 ints, a and b, return their sum. However, "teen" values in the range 13..19 inclusive, are extra lucky. So if either value is a teen, just return 19.
it: Dati due interi, a e b, ritorna la loro somma. Tuttavia i valori considerati "adolescenti", cioé all'interno dell'intervallo 13..19 (estremi inclusi) sono più fortunati. Se uno qualsiasi dei valori è adolescente, ritorna semplicemente 19.

source: TwoAsOne
it: Due su Uno

source: Given three ints, a b c, return true if it is possible to add two of the ints to get the third.
it: Dati tre interi, a b c, ritorna vero se è possibile sommare due di essi per ottenere il terzo.

source: WithoutDoubles
it: Senza Raddoppio

source: Return the sum of two 6-sided dice rolls, each in the range 1..6. However, if noDoubles is true, if the two dice show the same value, increment one die to the next value, wrapping around to 1 if its value was 6.
it: Ritorna la somma dei due tiri di dado da 6 facce, ognuna compresa nell'intervallo 1..6. Nel caso in cui noDoubles sia vero, se i due dadi mostrano gli stessi valori, incrementa uno di essi al suo valore successivo ricominciando da 1 se il valore è 6.

source: Today is a great day: we will learn the buggles to play Dance Revolution, this game beloved of some students where the player has to move its feet on the carpet according to the instructions presented on the screen, and following the music. But before that, we have some details to study first.
it: Oggi è un grande giorno: noi insegneremo a ballare la Dance Revolution ai buggle, questo gioco è amato da molti studenti, i partecipanti devono muovere i propri piedi sul tappeto in accordo con le istruzioni presentate sullo schermo e seguendo la musica. Ma prima di questo dobbiamo studiare alcuni dettagli.

source: Conditionals without curly braces
it: Condizioni senza parentesi graffe

source: There is one detail we omitted about the conditional syntax: if a branch contains only one instruction, then the curly braces become optional. So, the two chunk of code are equivalent:
it: C'è un dettaglio che abbiamo omesso sulla sintassi delle condizioni: se il blocco di una delle alternative di una condizione contiene una sola istruzione le parentesi graffe diventano opzionali. Quindi, questi due pezzi di codice sono equivalenti:

source: if (<b>condition</b>) { <b>whatToDoIfTheConditionIsTrue();</b> } else { <b>whatToDoElse();</b> }
it: if (<b>condizione</b>) { <b>cosaFareACondizioneTrue();</b> } else { <b>cosaFareAltrimenti();</b> }

source: if (<b>condition</b>) <b>whatToDoIfTheConditionIsTrue();</b> else <b>whatToDoElse();</b>
it: if (<b>condizione</b>) <b>cosaFareACondizioneTrue();</b> else <b>cosaFareAltrimenti();</b>

source: Actually, you can do the same for loops body that are reduced to one instruction only. But beware, this becomes dangerous if you chain the <tt>if</tt> instructions like this:
it: È possibile fare lo stesso per il corpo dei cicli contenenti una sola istruzione. Fate attenzione, questo diventa pericoloso se connettete più istruzioni <tt>if</tt> come in questo esempio:

source: In fact, it does not turn right when there is no baggle on the ground AND x equals 5, but when the buggle found a baggle on the ground and x equals anything but 5. Putting this otherwise, the buggle understands the previous code as if it were written the following way (note that the <tt>else</tt> were moved to the right):
it: Infatti, il buggle non gira a destra quando non ci sono baggle a terra ma quando il buggle trova un baggle a terra e x è diverso da 5. In altre parole, il buggle capisce il precedente codice come quello scritto quì sotto (nota che l'<tt>else</tt> è spostato più a destra):

source: The first lesson of this is that the indentation is very important to help humans understanding, even if it does not change the actual meaning of the code. We could have written the following code and obtain the same result. But if you want a human to read and review your code, you really want to indent it correctly. That's for example the case if you want a professor to read it (to grade it or to answer a question about it), or if you want to reuse your code later, or even if you need to debug your code yourself.
it: La prima lezione da imparare è che l'indentazione è molto importante per aiutare le persone a capire anche se non cambia il significato del codice. Avremmo potuto scrivere il codice seguente ottenendo lo stesso risultato. Ma se volete che un umano legga e revisioni il vostro codice lo dovete indentare correttamente. Ad esempio se voleste che un professore legga il vostro codice (per valutarlo oppure rispondere ad una domanda su di esso) oppure se voleste riusarlo più tardi o doveste debuggarlo (correggerlo) da soli.

source: The second lesson is that a <tt>else</tt> branch always connects to the closest <tt>if</tt>. This may be a bit troublesome in some case, and it may be easier to add more braces than strictly needed to remove any ambiguity.
it: La seconda lezione da imparare è che l'alternativa <tt>else</tt> è sempre connessa alla <tt>if</tt> più vicina. Questo potrebbe essere un po' fastidioso in certi casi e potrebbe essere meglio aggiungere più parentesi di quelle che sono strettamente necessarie per rimuovere ogni ambiguità.

source: Chaining conditionals
it: Concatenamenti delle condizioni

source: You sometimes want to ask the buggle something similar to:
it: A volte vorrete chiedere al buggle qualcosa come questo:

source: if it's raining, take an umbrella; if not, and if it's a hot day, take a bottle of water; if not and if it's July 4th, take an American flag
it: se piove prendi l'ombrello; altrimenti se è un giorno caldo prendi una bottiglia d'acqua; altrimenti se è il 4 luglio prendi la bandiera americana

source: The trap is that we want at most one of these actions to be taken. That is to say, if it's raining a very hot July 4th, we don't want the buggle to get outside with an umbrella, some water and a flag, but simply with an umbrella. The following code is thus WRONG.
it: Il punto è che vogliamo che solo una di queste azioni venga intrapresa. Vale a dire che se sta piovendo in un 4 luglio veramente caldo noi non vogliamo che il buggle esca con un ombrello, dell'acqua ed una bandiera ma solo con l'ombrello. Il seguente codice è quindi SBAGLIATO

source: [!java|scala]if (rainy()) takeUmbrella(); if (hot()) takeWater(); if (todayIsJuly4th()) takeFlag();[/!][!python]if rainy(): takeUmbrella() if hot(): takeWater() if todayIsJuly4th(): takeFlag()[/!]
it: [!java|scala]if (piove()) prendiOmbrello(); if (faCaldo()) prendiAcqua(); if (oggiE4Luglio()) takeBandiera();[/!][!python]if piove(): prendiOmbrello() if (faCaldo()): prendiAcqua() if (oggiE4Luglio()): prendiBandiera()[/!]

source: Indeed, since the conditions are evaluated one after the other, there is a risk that you go to the July 4th march on a rainy day. Instead, we should use something like this to ensure that once we found a true condition, we won't evaluate the next ones.
it: Poiché le condizioni sono valutate una dopo l'altra, c'è il rischio che si vada a marciare il 4 luglio sotto la pioggia. Invece dovremo utilizzare qualcosa come questo per assicurarci che quando avremo trovato una condizione vera non venga valutata la successiva.

source: [!java|scala]if (rainy()) { takeUmbrella(); } else { if (hotDay()) { takeWater(); } else { if (todayIsJuly4th()) { takeFlag(); } } }[/!][!python]if rainy(): takeUmbrella() else: if hotDay(): takeWater() else: if todayIsJuly4th(): takeFlag()[/!]
it: [!java|scala]if (piove()) { prendiOmbrello(); } else { if (faCaldo()) { prendiAcqua(); } else { if (oggiE4Luglio()) { prendiBandiera(); } } }[/!][!python]if piove(): prendiOmbrello() else: if faCaldo(): prendiAcqua() else: if oggiE4Luglio(): prendiBandiera()[/!]

source: Unfortunately, such a cascade of conditionals is quite difficult to read. It is better to [!java|scala]omit the curly braces for the <tt>else</tt> statements. Some languages even introduce a specific construct for these <tt>else if</tt>, but not [!thelang].[/!] [!python]change the sub-blocks using the <code>elif</code> keyword to mark explicitly these "else if" branches.[/!]
it: Sfortunatamente, una simile cascata di condizioni sono piuttosto difficili da leggere. È meglio [!java|scala]ometere le parentesi graffe per l'istruzione <tt>else</tt>. Alcuni linguaggi introducono anche un costrutto specifico per questi <tt>else if</tt>, ma non [!thelang].[/!] [!python] cambia il blocco interno usando la parola chiave <code>elif</code> per contraddistinguere eplicitamente le alternative "else if"'.[/!]

source: [!java|scala]if (rainy()) { takeUmbrella(); } else if (hotDay()) { takeWater(); } else if (todayIsJuly4th()) { takeFlag(); }[/!][!python]if rainy(): takeUmbrella() elif hotDay(): takeWater() elif todayIsJuly4th(): takeFlag()[/!]
it: [!java|scala]if (piove()) { prendiOmbrello(); } else if (faCaldo()) { prendiAcqua(); } else if (oggiE4Luglio()) { prendiBandiera(); }[/!][!python]if piove(): prendiOmbrello() elif faCaldo(): prendiAcqua() elif oggiE4luglio(): prendiBandiera()[/!]

source: Graffiti in the Buggle World
it: Graffiti nel Mondo dei Buggle

source: Buggles can tag graffitis on the ground of their world. For that, they use the four following methods:
it: I Buggle possono marchiare graffiti sul terreno del proprio mondo. Per questo essi usano i seguenti quattro metodi:
