Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: <code>[!java]boolean[/!] isOverMessage()[!scala]:Boolean[/!]</code>: returns <code>[!java|scala]true[/!][!python]True[/!]</code> if and only if there is a message on the ground.
it: <code>[!java]boolean[/!] isOverMessage()[!scala]:Boolean[/!]</code>: ritorna <code>[!java|scala]true[/!][!python]True[/!]</code> se e solo se ci sono messaggi a terra.

source: <code>[!java]String[/!] readMessage()[!scala]: String[/!]</code>: returns the message written on the ground (or an empty string if nothing is written).
it: <code>[!java]String[/!] readMessage()[!scala]: String[/!]</code>: ritorna il messaggio scritto a terra (oppure una stringa vuota se non c'è scritto niente).

source: <code>[!java]void[/!] writeMessage([!java]String [/!]msg[!scala]: String[/!])</code>: writes the specified message down on the ground. If there is already a message on the ground, the new content is added at the end of the existing message.
it: <code>[!java]void[/!] writeMessage([!java]String [/!]msg[!scala]: String[/!])</code>: scrive il messaggio specifico sul terreno. Se c'è già un messaggio sul pavimento, il nuovo contenuto sarà aggunto alla fine del messaggio preesistente.

source: <code>[!java]void [/!]clearMessage()</code>: clears what is written on the ground.
it: <code>[!java]void [/!]clearMessage()</code>: cancella ciò che è scritto a terra.

source: Exercise goal
it: Traguardo dell'esercizio

source: The goal is then to organize a BDR game between the buggles by learning them to move according to the instructions written on the ground. These instructions are messages written on the ground, with the following signification:
it: Lo scopo è quello di organizzare un gioco BDR fra i buggle insegnandogli a muoverein accordo con le isturzioni scritte a terra. Queste istruzioni sono messaggi scritti a terra con il seguente significato:

source: Message
it: Messaggi

source: What to do
it: Cosa fa

source: Mnemonic
it: Mnemonico

source: Turn right and move one step forward
it: Gira a destra e muoviti un passo in avanti

source: Turn left and move one step forward
it: Gira a sinistra e muoviti un passo in avanti

source: Turn back (U-turn) and move one step forward
it: Gira indietro (curva a U) e muoviti un passo in avanti

source: First letter of the alphabet
it: Prima lettera dell'alfabeto

source: Move one step forward
it: Muoviti un passo avanti

source: Move two steps forward
it: Muoviti due passi in avanti

source: Second letter of the alphabet
it: Seconda lettera dell'alfabeto

source: Move three steps forward
it: Muoviti tre passi in avanti

source: Third letter of the alphabet
it: Terza lettera dell'alfabeto

source: Move one step backward
it: Muoviti un passo indietro

source: One letter before the end of the alphabet
it: Ultima lettera dell'alfabeto

source: Move two steps backward
it: Muoviti due passi indietro

source: Two letters before the end of the alphabet
it: Penultima lettera dell'alfabeto

source: Move three steps backward
it: Muoviti tre passi indietro

source: Three letters before the end of the alphabet
it: Terzultima lettera dell'alfabeto

source: <i>(anything else)</i>
it: <i>(qualsiasi altra cosa)</i>

source: Stop dancing.
it: Fine delle danze

source: Indications
it: Indicazioni

source: This exercise may seem a bit complex at the first glance, but it comes down to summarizing the information of the table in a sequence of conditionals.
it: Questo esercizio potrebbe sembrare un po' complesso ad una prima occhiata ma si tratta solo di riassumere le informazioni della tabella in una sequenza di istruzioni condizionali.

source: You have to keep dancing as long as there is some dancing steps to do, i.e., as long as we are not in cell which content is not described in the table. The easier for that is to use a boolean variable (<code>finished</code>) as termination condition to a <code>while</code> loop. It should be initialized to <code>[!java|scala]false[/!][!python]False[/!]</code>, and switched to <code>[!java|scala]true[/!][!python]True[/!]</code> as soon as the buggle find a cell with a value not described in the table. Thus the loop, will stop and the program will terminate.
it: Voi dovete continuare a ballare fintantoché ci sono passi da fare, e cioé, finquando nelle celle non c'è un contenuto non descritto nella tabella. Il modo più facile è usare una variabile booleana (<code>finished</code>) come condizione di termine per un ciclo <code>while</code>. Dovrebbe essere inizializzata con <code>[!java|scala]false[/!][!python]False[/!]</code> e cambiata in <code>[!java|scala]true[/!][!python]True[/!]</code> appena il buggle trova una cella con un valore non descritto nella tabella. Così il loop si fermerà e il programma avrà termine.

source: Another subtlety is that detecting if strings are equals is a bit annoying in Java. So, we use the <code>char getIndication()</code> instead of <code>String readMessage()</code>. This method, only known by the buggles of this exercise, returns the first char of the message written on the ground (or ' ' -- the space char -- if nothing is written down). It enables to work with chars instead of strings, that is much simpler in Java.
it: In Java un altro noioso dettaglio è quello di determinare se due stringe sono uguali. Sicché useremo <code>char getIndication()</code> invece di <code>String readMessage()</code>. Questo metodo, conosciuto solo dai buggles di questo esercizio, ritorna il primo carattere del messaggio scritto a terra (oppure ' ' -- il carattere spazio -- se non c'è scritto niente). Esso rende possibile lavorare con i caratteri invece che con le stringhe che è molto più semplice in Java.

source: Tips and Hints
it: Consigli e Suggerimenti

source: If you fail to understand why the buggle does not execute the expected steps, try adding <code>brushDown()</code> in your method. This asks the buggle to put down a brush leaving a trail when it moves. It should help you understanding its trajectory, but do not forget to remove this call when you want to test whether your code is a valid solution to the exercise: you are asked to let the buggle dance, not to vandalize the dance floor.
it: Se fallite nel capire perché il buggle non esegue i passi aspettati, provate ad aggiungere <code>brushDown()</code> nel vostro metodo. Questo chiede al buggle abbassare il pennello lasciando una traccia quando si muove. Questo dovrebbe aiutarvi a capire la sua traiettoria ma non dimenticate di rimuovere questa chiamata quando vorrete testare se il vostro codice è una soluzione valida all'esercizio: state chiedendo al buggle di danzare non di vandalizzare la pista da ballo!

source: When your program finally works, move on to the next exercise.
it: Quando il vostro programma finalmente funzionerà, muovetevi nel prossimo esercizio.

source: BDR is cool, but it's a bit chaotic. First, the buggles giggle in any directions, and then the code you had to write to let them move is rather difficult to read. Here is a new BDR world where the buggle will dance a gentle circle. We will benefit this tranquillity to clean up a bit our code thanks to the new constructs we will introduce.
it: Il BDR è bello ma è un po' caotico. Prima di tutto i buggles scorrazzano in tutte le direzioni e dopo il codice che si dovrà scrivere per farli muovere risulterà piuttosto difficile da leggere. Quì c'è un nuovo mondo BDR dove i buggle danzeranno dolcemente in cerchio. Approfitteremo di questa tranquillita per pulire un po' il vostro codice grazie al nuovo costrutto che introdurremo.

source: [!java]<code>switch</code> conditionals[/!][!scala]Pattern matching[/!]
it: [!java]La condizione <code>switch</code>[/!][!scala]Il Pattern matching[/!]

source: The hardest part of previous code is certainly the conditional cascading. Somewhere in your code, you certainly had something similar to:
it: La parte difficile del codice precedente era sicuramente la cascata di condizioni. Da qualche parte nel vostro codice sicuramente avrete avuto qualcosa di simile ad:

source: if ([!java]getIndication() == 'R'[/!][!scala]readMessage() == "R"[/!]) { right(); forward(); } else if ([!java]getIndication() == 'L'[/!][!scala]readMessage() == "L"[/!]) { left(); forward(); } else if ([!java]getIndication() == 'I'[/!][!scala]readMessage() == "I"[/!]) { back(); forward(); <span class="comment">/* other else if */</span> } else { finished = true; }
it: if ([!java]getIndication() == 'R'[/!][!scala]readMessage() == "R"[/!]) { right(); forward(); } else if ([!java]getIndication() == 'L'[/!][!scala]readMessage() == "L"[/!]) { left(); forward(); } else if ([!java]getIndication() == 'I'[/!][!scala]readMessage() == "I"[/!]) { back(); forward(); <span class="comment">/* altri else if */</span> } else { finished = true; }

source: When you review this code, it may not be clear at the first glance that it is simply a choice with 4 branches depending on the value of [!java]getIndication()[/!][!scala]readMessage()[/!]. To improve this, we will use a [!java]<code>switch</code> construct, which Java syntax is the following:[/!] [!scala] pattern matching, which is a very powerful construct that greatly generalizes the <code>if</code>. It is arguably one one the major advantages of Scala when compared to languages such as Java or python. It is not new either, as other languages such as OCaml or Haskell offer this feature since long, but still. It's really cool![/!]
it: Mentre si osserva questo codice esso potrebbe sembrare poco chiaro alla prima occhiata ma è semplicemente una scelta fra quattro alternative in base al valore di [!java]getIndication()[/!][!scala]readMessage()[/!]. Per migliorare la situazione potremo usare il [!java] costrutto <code>switch</code>, che nella sintassi java sarà:[/!] [!scala]pattern matching, che è un construtto veramente potente che generalizza ampiamente l'<code>if</code>. È indubbiamente uno dei maggiori vantaggi di Scara rispetto agli altri linguaggi come Java o Python. Questa non è una novità, altri linguaggi come Ocaml o Haskell offrono questa caratteristica da molto tempo. Ma essa è ancora molto bella![/!]

source: switch (<b>expression</b>) { case <b>firstValue</b>: <b>whatToDoIfExpressionEqualsFirstValue();</b> break; case <b>secondValue</b>: <b>whatToDoIfExpressionEqualsSecondValue();</b> break; case <b>thirdValue</b>: <b>whatToDoIfExpressionEqualsThirdValue();</b> break; /* as much similar cases as you want */ default: <b>whatToDoIfExpressionDoesNotEqualsAnySeenValues();</b> }
it: switch (<b>espressione</b>) { case <b>primoValore</b>: <b>cosaFareSeLespressioneCombaciaColPrimoValore();</b> break; case <b>secondoValore</b>: <b>cosaFareSeLespressioneCombaciaColSecondoValore();</b> break; case <b>terzoValue</b>: <b>cosaFareSeLespressioneCombaciaColTerzoValore();</b> break; /* tutti i casi simili che vuoi */ default: <b>cosaFareSeLespressioneNonCombaciaConNessunValore();</b> }

source: Observe that each branch of a <tt>switch</tt> must be ended by a <code>break</code>. If you forget this, the machine keeps going and execute the next branch in the list after the branch it jumped to. There is even some <b>rare</b> cases where this behavior reveals helpful.
it: Osserva che ogni alternativa dello <tt>switch</tt> deve finire con un <code>break</code>. Se ve lo dimenticate il pc andra avanti ad eseguire l'alternativa successiva a quella cui si è balzati. Ci sono anche alcuni <b>rari</b> casi dove questo comportamento può rivelarsi utile.

source: It is then possible to rewrite previous BDR code in a cleaner way using the <tt>switch</tt> construct:
it: È poi possibile riscrivere il precedente codice BDR in modo più pulito utilizzando il costrutto <tt>switch</tt>.

source: <i>expression</i> <b>match</b> { <b>case</b> <i>possible value</i> <b>=></b> instructions <b>case</b> <i>other value</i> <b>=></b> other instructions <b>case</b> <i>another value</i> <b>=></b> yet another instructions <b>case _ =></b> default instructions }
it: <i>espressione</i> <b>match</b> { <b>case</b> <i>valore possibile</i> <b>=&gt;</b> istruzioni <b>case</b> <i>altro valore</i> <b>=&gt;</b> altre istruzioni <b>case</b> <i>un altro valore</i> <b>=&gt;</b> ancora altre istruzioni <b>case _ =&gt;</b> istruzioni predefinite }

source: The expression provided before the keyword <code>match</code>, and then the branches are evaluated one after the other until we find one which value provided between <code>case</code> and <code>=&gt</code> is equal to the expression's value. The <code>_</code> symbol acts as a wildcard, so the <code>_</code> branch <i>always</i> matches. Here is an example where a variable <code>name</code> is matched.
it: All'inizio viene valutata l'espressione posta prima della parola chiave <code>match</code> e subito dopo quelli delle alternative fintantoché non si trova il valore poste fra <code>case</code> ed <code>=&gt;</code> uguale a quello dell'espressione. Il simbolo <code>_</code> agisce come jolly in modo che l'alternativa <code>_</code> sia <i>sempre</i> valida. Ecco un esempio dove una variabile <code>name</code> è comparata.

source: name match { case "Martin" => println("Hello Martin, how are you?") case "Gerald" => println("Hey Gerald! How are you doing?") case _ => println("Welcome stranger.") }
it: name match { case "Martin" =&gt; println("Ciao Martin, come stai?") case "Gerald" =&gt; println("Hey Gerald! How are you doing?") case _ =&gt; println("Benvenuto straniero.") }

source: It is possible to have more than one instruction per branch, and merge branches when the values are separated by a | symbol.
it: È possibile avere più di una istruzione per alternativa ed unire più alternative separando i valori con il simbolo | .

source: name match { case "Martin" | "Gerald" => println("Hello "+name+", how are you?"); openTheDoor() case _ => println("Hello stranger. Please do not pass."); lockTheDoor() }
it: name match { case "Martin" | "Gerald" =&gt; println("Ciao "+name+", come stai?"); openTheDoor() case _ =&gt; println("Ciao straniero. Per piacere non passare."); chiudiLaPorta() }

source: You can even add guards to your branches. These are extra conditions that must be respected for the branch to get applied. This is handy if you want match on value ranges, as follows.
it: Puoi anche aggiungere protezioni alle tue alternative. Queste sono condizioni extra che devono essere rispettate perché l'alternativa venga applicata. È utile quando volete comparare intervalli di valori, come nell'esempio seguente.

source: age match { case i if i&lt;10 => println("Hey kid!") case i if i&lt;20 => println("Hey dude!") case i if i&lt;30 => println("Hello young man") case _ => println("Hello Sir") }
it: anni match { case i if i&lt;10 =&gt; println("Hey bambino!") case i if i&lt;20 =&gt; println("Hey ragazzo!") case i if i&lt;30 =&gt; println("Salve giovane uomo") case _ =&gt; println("Salve Signore") }

source: Note that there is no need to check whether the value is higher than 10 on the second line because the first matching branch is used. So, if the second branch gets evaluated, then the first one did not match.
it: Nota che non c'è bisogno di controllare se il valore è più alto di 10 nella seconda riga perché le alternative sono considerate in ordine. Quindi, se la seconda alternativa viene valutata vuol dire che la prima non ha avuto corrispondenza.

source: Finally, it is possible also to match several variables in one shoot!
it: Finalmente è possibile anche confrontare più variabili in un sol colpo!

source: (x,y) match { case (0,0) => println("that's the origin") case (_,0) => println("On the ordinate") case (0,_) => println("On the abscissa") case (_,_) => println("Some random point") }
it: (x,y) match { case (0,0) =&gt; println("questa è l'origine") case (_,0) =&gt; println("On the ordinate") case (0,_) =&gt; println("Sulle ascisse") case (_,_) =&gt; println("Alcuni punti casuali") }

source: I told you that scala's pattern matching is very powerful! I actually love this feature!
it: Io vi dicevo che il pattern matching di scala è veramente potente! Io attualmente amo questa caratteristica!

source: [!java|scala]Apply the improvement we just saw to rewrite your buggle code with the following dance steps. [/!] [!python]Let's teach a new dance step to the buggles. It is slightly more complex but actually better looking. Beside of that, that's the same old story.[/!] Note that we can now move up to 6 cells in one dance step.
it: [!java|scala]Applica i miglioramenti che abbiamo appena visto per riscrivere il tuo codice dei buggle con i seguenti passi di danza. [/!] [!python]Impariamo dei nuovi passi di danza ai buggle. È leggermente più complesso ma più bello da vedere. All'infuori di questo è sempre la stessa storia. [/!] Nota che ora è possibile muoversi di 6 caselle in un solo passo di danza.

source: Turn back and move one step forward
it: Girati indietro e muoviti un passo in avanti

source: Move four cells forward
it: Muoviti quattro passi in avanti

source: Move five cells forward
it: Muoviti cinque passi in avanti

source: Move six cells forward
it: Muoviti sei passi in avanti

source: Move four cells backward
it: Muoviti quattro passi indietro

source: Move five cells backward
it: Muoviti cinque passi indietro

source: Move six cells backward
it: Muoviti sei passi indietro

source: When you program works again, proceed to next exercise.
it: Quan il tuo programma funzionerà di nuovo, procedi con il prossimo esercizio.

source: Programs made of simple suite of instructions similar to previous exercise are quite boring. They always do the same thing, and cannot react to external conditions. A <b>conditional</b> let the program adapt by doing something like <i>if it's raining, take an umbrella</i>.
it: I programmi composti da semplici raccolte di istruzioni come nell'esercizio precedente sono piuttosto noiosi, fanno sempre le stesse cose e non regiscono alle codizioni esterne. L'<b>istruzione condizionale</b> permette ad un programma di adattarsi ad una situazione come ad esempio <i>se piove prendi l'ombrello</i>.

source: The [!thelang] syntax is the following:
it: La sintassi di [!thelang] è la seguente:

source: [!java|scala]if (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTrue();</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNextIfTrue();</b> }[/!][!python]if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTrue()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNextIfTrue()</b>[/!] <b>whatToDoAnyway()[!java];[/!]</b>
it: [!java|scala]if (<b>condizione</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareSeVero();</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareInSeguitoSeVero();</b> }[/!][!python]if <b>condizione</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareSeVero()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareInSeguitoSeVero()</b>[/!] <b>cosaFareComunque()[!java];[/!]</b>

source: If the condition is true, the code of the next block will be executed and then it will continue with the rest of the code. If the condition is false, the next block is ignored and the execution continues after it. The conditional block can contain several instructions, it can even contain other tests, along with their sub-blocks.
it: Se la condizione è vera il codice nel blocco immediatamente sottostante sarà eseguita per poi continuare con il resto del codice. Se la condizione è falsa il codice nel blocco immediatamente sottostante verrà ignorato e l'esecuzione continuerà dopo di esso. Il blocco condizionale può contenere diverse istruzioni, può anche contenere a sua volta altre condizioni con i loro propri blocchi.

source: In this example, the instructions <code>whatToDoIfTrue()</code> and <code>whatToDoNextIfTrue()</code> will be executed if and only if the condition is true, while the instruction <code>whatToDoAnyway()</code> will be executed whether or not the condition is true.
it: In questo esempio le istruzioni <code>cosaFareSeVero()</code> e <code>cosaFareInSeguitoSeVero()</code> saranno eseguite se e solo se la condizione è vera, mentre l'istruzione <code>cosaFareComunque()</code> sarà eseguita sia con la condizione falsa che vera.

source: In [!thelang], the blocks of code are [!java|scala]enclosed between curly brackets: a { sign opens the block, while a } sign closes it. White spaces are not important[/!][!java].[/!][!scala], provided that your instructions are still separated with a semi-column or an end of line.[/!] [!java|scala]It is still very important to correctly indent your code to keep it readable.[/!] [!python]marked by the indentation: every lines that are a bit shifted to the right with white spaces belong to the block. Quite often, people use 4 spaces for indentation, but it works if you use more or less spaces. Simply, any lines of the block must use the same amount of spaces. The end of Python code blocks are not marked by any specific char. Indenting lines starts a block and unindenting ends it. Do not forget the colon (:) at the end of the <code>if</code> line, python needs it to know that a new block begins. The fact that python relies on indentation to delimit blocks is a very good property for beginners: it will force your to adhere to strict code presentation standards.[/!] It is very easy to get lost in your own code if it's not properly indented, so you want to clean it up so that working on your code remains pleasant and productive.
it: In [!thelang], i blocchi di codice sono [!java|scala]racchisi da parentesi graffe: il segno { apre il blocco mentre il segno } lo chiude. Gli spazi bianchi non sono importanti[/!][!java].[/!][!scala], a condizione che le vostre istruzioni siano ancora separate da un punto e virgola o un accapo.[/!] [!java|scala]Continua ad essere molto importante indentare correttamente il codice per mantenerlo leggibile.[/!] [!python]distinti dall'indentazione: ogni riga che è spostata un po' più destra attraverso degli spazi bianchi appartiene al blocco. Comunemente si utilizzano 4 spazi per l'indentazione ma funziona ugualmente utilizzando più o meno spazi. Semplicemente ogni riga del blocco deve utilizzare lo stesso numero di spazi. La fine di un blocco di codice in Python non è demarcata da un carattere specifico qualsiasi. Indentare le righe fa iniziare il blocco e deindentarle lo fa finire. Non dimenticatevi i due punt (:) alla fine della riga dell'<code>if</code>, python ne ha bisogno per sapere che un nuovo blocco deve iniziare. Il fatto che python faccia affidamento sull'indentazione per delimitare i blocchi è una caratterisica davvero ottima per i principianti: ciò constringerà ad aderire strettamente agli standard di presentazione del codice.[/!] È veramente facile perdersi nel proprio codice se non lo si è indentato propriamente ed è quindi desiderabile mantenerlo pulito così che lavorarci sopra rimanga piacevole e produttivo.

source: All indentations of a given block must be consistent, and it is not possible to cut a block. The two following codes are incorrect and will raise errors.
it: Tutte le indentazioni di un dato blocco devono essere consistenti e non è possibile tagliare un blocco. I codici seguenti sono incorretti e solleveranno errori.

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <span class="comment"># one space too much </span> <b>whatToDoAnyway()</b>
it: if <b>condizione</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFare()</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>cosaFareInSeguito()</b> <span class="comment"># uno spazio di troppo</span> <b>cosaFareComunque()</b>
