Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: This first lesson will lead your first steps in programming. It is intended for beginners. List of seen notions per exercise:
it: In questa prima lezione guideremo i vostri primi passi nella programmazione. Essa è destinata ai principianti. Lista delle nozioni degli esercizi:

source: Instructions
it: Istruzioni

source: Comments
it: Commenti

source: Conditionals/ Expressions
it: Condizioni / Espressioni

source: While loops
it: Ciclo while

source: Variables
it: Variabili

source: For loops
it: Ciclo for

source: Do/While loops
it: Ciclo Do/While

source: Methods
it: Metodi

source: Arrays
it: Vettori

source: Welcome in the Buggles' World
it: Benvenuto nel mondo dei Buggles

source: Java Instructions
it: Istruzioni Java

source: Writing more complex programs
it: Scrivere programmi più complessi

source: Conditional instructions
it: Istruzioni Condizionali

source: Baggle Seeking
it: La cerca dei Baggle

source: Storing and manipulating data
it: Conservare e manipolare i dati

source: Do .. while loops
it: Ciclo do .. while

source: Building methodically
it: Costruire metodicamente

source: Methods returning a result
it: Metodi che ritornano un risultato

source: Methods with parameters
it: Metodi con parametri

source: Methodically drawing
it: Disegnare metodicamente

source: Methodically drawing (only bigger)
it: Disegnare metodicamente (solo grandi)

source: Drawing bigger and bigger
it: Disegni sempre più grandi

source: Even more pattern to draw
it: Ancora altri pattern da disegnare

source: Slug Hunting
it: Caccia alla Lumaca

source: Slug Tracking
it: Tracciamento della Lumaca

source: Snake World
it: Mondo di Snake

source: Knitting and Arrays
it: Intrecci e Vettori

source: Knitting, Arrays and modulos
it: Intrecci, Vettori e modulo

source: Traversal by column
it: Attraversare in colonna

source: Traversal by line
it: Attraversare in riga

source: Zig-zag traversal
it: Attraversare a zig-zag

source: Diagonal Traversal
it: Attraversare in diagonale

source: Meaning of the symbols
it: Significato dei simboli

source: Introducing the concept
it: Intruduzione ai concetti

source: Working on the concept
it: Lavorare sui concetti

source: Concept assumed mastered
it: Padroneggiare i concetti assunti

source: Concept not mandated by the exercise
it: Concetti non indispensabili per gli esercizi

source: What will I learn?
it: Cosa imparerò?

source: You will learn the very basics of programming. At least, you will be presented the most important concepts, allowing you to read most simple algorithms. You will not be able to write or read full programs because you will still not know about objects, but you will master what is called "Tactical programming", meaning that you will master the syntax enough to not have any issue with it, allowing you to focus on the fundamental problems of what you want to solve instead of struggling with syntaxic difficulties.
it: Imparerai i fondamenti della programmazione. Alla fine ti verranno presentati i concetti più importanti che ti permetteranno di leggere semplici algoritmi. Non sarai in grado di leggere o scrivere un programma intero perché non verrai a conoscenza degli oggetti ma imparerai a padroneggare quella cosa chiamata "Programmazione Tattica", che vorrebbe dire che imparerai abbastanza sintassi da non aver nessun problema con essa in modo che ti sia permesso di concentrarti sui problemi fondamentali di quello che vuoi risolvere invece di dover combattere con le difficoltà sintattiche.

source: Algorithms on Arrays
it: Algoritmi sui Vettori

source: This lesson allows to experiment with some basic algorithms on arrays. The objective is clearly to learn how to traverse and compute functions on arrays.
it: Questa lezione permette di fare esperimenti con alcuni algoritmi di base sui vettori. L'obbiettivo è chiaramente quello di imparare a scorrere ed elaborare funzioni sui vettori.

source: Array123
it: Vettore 123

source: Given an array of integers, return true if .. 1, 2, 3, .. appears in the array somewhere.
it: Dato un vettore di interi, ritorna vero se la sequenza 1, 2, 3, .. appare in qualche parte nel vettore.

source: This exercise was converted to PLM from the excellent exercising site http://javabat.com/
it: Questo esercizio è stato convertito per PLM dall'eccellente sito di esercizi http://javabat.com/

source: Array667
it: Vettore 667

source: Given an array of integers, return the number of times that two 6's are next to each other in the array. Also count instances where the second "6" is actually a 7.
it: Dato un vettore di interi, ritorna il numero di volte in cui due 6 si susseguono al suo interno. Inoltre prendi in considerazione anche i casi in cui il secondo "6" è invece un 7.

source: ArrayCount9
it: Conta i 9 di un Vettore

source: Given an array of integers, return the number of 9's in the array.
it: Dato un vettore contenente interi, ritorna la quantità di 9 che esso contiene.

source: ArrayFront9
it: Inizio Vettore di 9

source: Given an array of integers, return true if one of the first 4 elements in the array is a 9. The array length may be less than 4.
it: Dato un vettore di interi, ritorna vero se uno dei primi 4 elementi nell'array è 9. La dimensione del vettore potrebbe essere minore di 4.

source: Average value
it: Valore medio

source: The objective of this exercise is to compute the average value of the integer values stored in an array.
it: L'obbiettivo di questo esercizio è quello di calcolare il valore medio fra i valori interi contenuti in un vettore.

source: You have to fill the body of the method <code>average()</code> which takes as parameter the array of integers of which it computes and returns the average value. Please note that this method must return an integer.
it: Dovrai scrivere il metodo <code>average()</code> che prenderà come parametro il vettore di interi che dovrà computare per poter ritornare la media dei valori. Nota che questo metodo dovrà ritornare un intero.

source: To compute the average value of an integer, it is necessary to traverse the whole array and to compute the sum of all its values (so you will need a variable to store this temporary result), then you have to divide this sum by the size of the array.
it: Per calcolare il valore medio di un intero è necessario scorrere l'intero vettore sommando tutti i suoi valori (quindi ti servirà una variabile per contenere questo risutato temporaneo) e quindi dividere questa somma per la dimensione del vettore.

source: In Java, you can get the size of an array <code>myarray</code> by consulting its <code>length</code> attribute (in other words, <code>myarray.length</code>). Notice that there is no parenthesis after <code>length</code>.
it: In Java puoi ottenere la dimensione di un vettore <code>myarray</code> consultando il suo l'attributo <code>length</code> (in poche parole <code>myarray.length</code>). Ricorda che non ci sono parentesi dopo <code>lengtht</code>.

source: In python, retrieving the size of an array <code>myarray</code> is as easy as calling <code>len(myarray)</code>.
it: In python per ottenere la dimensione di un vettore come <code>myarray</code> bisogna semplicemente invocare il metodo <code>len(myarray)</code>.

source: [!java|scala]Arrays[/!][!python]Lists[/!] and Knotting
it: [!java|scala]Vettori[/!][!python]Liste[/!] ed Intrecci

source: The goal of this exercise is to reproduce the pattern of the first row in the other rows with a shift of one cell (see the Objective tab for details). The biggest difference between this exercise and the others we had on patterns is that you have to read the pattern (on first row) before reproducing it. You cannot do otherwise because the same code will be executed on three different worlds, each of them having a specific pattern.
it: L'obbiettivo di questo esercizio è di riprodurre lo stesso pattern presente sulla prima colonna nelle altre con uno sfasamento di una cella (guarda la scheda objective per capire). La grande differenza fra questo esercizio e gli altri dove avevamo dei pattern è che questa volta dobbiamo leggere il pattern (sulla prima colonna) prima di riprodurlo. Non puoi fare diversamente perché lo stesso codice dovrà essere eseguito su tre differenti mondi, ognuno di essi avente un pattern specifico.

source: One solution is to read the next cell, and go copy it in position before coming back to read the second cell. But since it is forbidden to use the methods to teleport the buggle to a specific position (<code>setPos()</code> and similar), this approach will be a pain to implement.
it: Una soluzione è quella di leggere la cella successiva e copiarla prima di tornare indietro a leggere la seconda cella. Ma visto che non è consentito l'utilizzo del metodo per teletrasportare il buggle in una specifica posizione (<code>setPos()</code> e simili), questo approccio sarebbe faticoso da implementare.

source: The simplest is to store the sequence of colors that constitute the whole pattern in an [!java|scala]<b>array</b>[/!][!python]<b>list</b>[/!]. But before we can do so, we should learn a bit what [!java|scala]arrays[/!][!python]lists[/!] are.
it: Il modo più semplice è quello di salvare la sequenza di colori che costituisce l'intero pattern in un [!java|scala]<b>vettore</b>[/!][!python]<b>a lista</b>[/!]. Ma prima di poterlo fare dobbiamo imparare un po' di quello che c'è da sapere su[!java|scala]i vettori[/!][!python]lle liste[/!].

source: [!java|scala]Arrays[/!][!python]List[/!]
it: [!java|scala]Vettori[/!][!python]Liste[/!]

source: [!java|scala]An array[/!][!python]A list[/!] is an ordered sequence of variables that go together. It is somehow similar to a shelve where each level can store a separate value. Each variable of the sequence is identified by its position, and can store a specific value. [!java|scala]All cells of the array must store values of the same type because arrays are homogeneous in [!thelang]. It is possible to trick this restriction by using the datatype <code>[!java]Object[/!][!scala]Any[/!]</code> that can contain [!java]almost[/!] any other datatype. [!java]Primitive types such as the ones we saw so far (int, boolean, double, char, etc) cannot be stored in an Object variable, but their objectified counter-part (Integer, Boolean, Double, Char, Boolean, etc) can.[/!] It is however a good practice to make the type of an array as specific as possible, i.e., if you plan to store some integers in your array, make it an array of integers, not of [!java]Object[/!][!scala]Any[/!].[/!] [!python]Lists can even mix values of differing types, such as integer values in some cells and colors in other cells.[/!]
it: [!java|scala]Un vettore[/!][!python]Una lista[/!] è una sequenza ordinata di variabili unite insieme. È in qualche modo simile ad una ripiano dove ogni scaffale può contenere un valore separato. Ogni variabile della sequenza viene identificata dalla sua posizione e può contenere un valore specifico. [!java|scala]Tutte le celle del vettore devono ospitare valori dello stesso tipo perché in [!thelang] i vettori sono omogenei. È possibile aggirare questa restrizione utilizzando il tipo di dato <code>[!java]Object[/!][!scala]Any[/!]</code> che può contenere [!java]quasi[/!] ogni altro tipo di dato. [!java]I tipi primitivi che abbiamo visto fin ora (int, boolean, double, char, ...) non possono essere memorizzati in un "Object" (Ndt Oggetto) variabile, ma le loro oggettificate controparti (Integer, Boolean, Double, Char, Boolean, etc) possono.[/!] Continua comunque ad essere una buona pratica quella di rendere il tipo di un vettore il più specifico possibile, e cioé se pianificate di memorizzare solo dei numeri interi in un vettore, create un vettore di interi, non un [!java]Object[/!][!scala]Any[/!].[/!] [!python]Le liste possono contenere mix di tipi di dato differenti, come valori interi in alcune celle e colori nelle atre.[/!]

source: T is the [!java|scala]array[/!][!python]list[/!]'s name, [!java|python]T[0][/!][!scala]T(0)[/!] is the name of the first cell, [!java|python]T[1][/!][!scala]T(1)[/!] the name of the second cell, [!java|python]T[2][/!][!scala]T(2)[/!] the third one, etc. And yes, the first cell is numbered [!java|python]T[0][/!][!scala]T(0)[/!] while the last one of [!java|scala]an array[/!][!python]a list[/!] of size N is [!java|python]T[N-1][/!][!scala]T(N-1)[/!]. It may seem funny to count starting from 0 and not from 1 as usual, but some historical reasons make it unavoidable here.
it: T è il nome del[!java|scala] vettore[/!][!python]la lista[/!], [!java|python]T[0][/!][!scala]T(0)[/!] È il nome della prima cella, [!java|python]T[1][/!][!scala]T(1)[/!] quello della seconda, [!java|python]T[2][/!][!scala]T(2)[/!] quello della terza, ... Eh sì, la prima cella è numerata [!java|python]T[0][/!][!scala]T(0)[/!] mentre l'ultima di un[!java|scala] vettore[/!][!python]a lista[/!] di dimensione N è [!java|python]T[N-1][/!][!scala]T(N-1)[/!]. Potrebbe sembrare strano contare iniziando da 0 e non da 1 come si fa solitamente ma alcune ragioni storiche hanno reso questa pratica inevitabile.

source: Basic usage
it: Utilizzo di base

source: We can use an integer variable <i>i</i> to access with [!java|python]T[i][/!][!scala]T(i)[/!] to the cells: when the value of <i>i</i> is 0, then [!java|python]T[i][/!][!scala]T(i)[/!] accesses [!java|python]T[0][/!][!scala]T(0)[/!]; when the value of <i>i</i> is 10, then [!java|python]T[i][/!][!scala]T(i)[/!] accesses [!java|python]T[10][/!][!scala]T(10)[/!]. <i>i</i> is said to be the <b>index</b> in T. <code>[!java|python]T[i][/!][!scala]T(i)[/!]</code> can be used just like any variable. We can set a new value:
it: Possiamo utilizzare una variabile intera chiamata <i>i</i> per accedere alla cella attraverso [!java|python]T[i][/!][!scala]T(i)[/!]: quando il valore di <i>i</i> sarà 0, allora [!java|python]T[i][/!][!scala]T(i)[/!] accederà a [!java|python]T[0][/!][!scala]T(0)[/!] mentre se il valore di <i>i</i> è 10, allora [!java|python]T[i][/!][!scala]T(i)[/!] accederà a [!java|python]T[10][/!][!scala]T(10)[/!]. La variabile <i>i</i> viene chiamata <b>indice</b> di T. <code>[!java|python]T[i][/!][!scala]T(i)[/!]</code> può essere usato alla stregua di una qualsiasi altra variabile. Possiamo assegnargli un nuovo valore:

source: We can retrieve and use its value:
it: Possiamo recuperane ed usare il suo valore:

source: We can test this value:
it: Possiamo testare il suo valore:

source: if ([!java|python]T[i][/!][!scala]T(i)[/!] > 0) [!scala|java]{[/!][!python]:[/!] [!java|scala]//[/!][!python]#[/!] instructions... [!java|scala]}[/!]
it: if ([!java|python]T[i][/!][!scala]T(i)[/!] &gt; 0) [!scala|java]{[/!][!python]:[/!] [!java|scala]//[/!][!python]#[/!] instruzioni... [!java|scala]}[/!]

source: It is very easy to traverse the whole [!scala|java]array[/!][!python]list[/!], for example to initialize each cells.
it: È molto semplice scorrere l'inter[!scala|java]o vettore[/!][!python]a lista[/!], per esempio per inizializzare ogni cella:

source: [!java|scala]The notation <code>T.length</code> retrieves the length of the array T,[/!] [!python]The function <code>len()</code> retrieves the length of the list T,[/!] allowing to build a classical for loop easily. [!python]Actually, the <code>len()</code> function is much more generic and can be used to retrieve the length of many objects. Applied to strings for example, it returns the amount of chars in this string.[/!] [!scala]Don't forget to start at <code>0</code> and stop at <code>T.length-1</code> instead of <code>1 to T.length</code> however.[/!]
it: [!java|scala]La notazione <code>T.length</code> recupera la lunghezza del vettore T,[/!] [!python]La funzione <code>len()</code> recupera la lunghezza della lista T,[/!] permettendo di costruire facilmente un classico ciclo for. [!python]La funzione <code>len()</code> è molto generica e permettere di recuperare la lunghezza di molti oggetti diversi. Applicandola per esempio a delle stringe essa ritorna il numero di caratteri di cui è composta.[/!] [!scala]Non dimenticatevi di iniziare a <code>0</code> e fermarvi a <code>T.length-1</code> invece che da <code>1 a T.length</code>.[/!]

source: If you just want to iterate over the values of T without keeping track of their index, you can simply write:
it: Se volete iterare solo sui valori di T senza tenere traccia dell'indice, potete semplicemente scrivere:

source: [!java]for (int i: T) {[/!][!scala]for (i &lt;- T) {[/!][!python]for i in T:[/!] action()[!java];[/!] [!java|scala]}[/!]
it: [!java]for (int i: T) {[/!][!scala]for (i &lt;- T) {[/!][!python]for i in T:[/!] azioni()[!java];[/!] [!java|scala]}[/!]

source: [!java]This construct is called an <i>extended loop</i> in Java. The variable <i>i</i> takes all values of the set located to the right of the colon (:), one after the other.[/!] [!python|scala]This is actually very similar to the previous construct. Simply, <code>[!python]range(n)[/!][!scala]i to j[/!]</code> returns a set of integers over which the for construct iterates. Actually, [!thelang] offers much more elegant ways to traverse [!python]lists[/!][!scala]arrays[/!] and other data collections, but this should be the topic of a specific set of exercises (that are still to be written in PLM).[/!]
it: [!java]Questo costrutto in Java è chiamato <i>extended loop</i> (Ndt non so tradurlo, è un ciclo for each). La variabile <i>i</i> prende tutti i valori del vettore posizionato a destra dei due punti (:), uno alla volta.[/!] [!python|scala]Quello che accade è molto simile a ciò che accadeva nel costrutto precedente. Semplicemente <code>[!python]range(n)[/!][!scala]i to j[/!]</code> ritorna una serie di numeri interi che il costrutto for utilizza per ripetersi. Attualmente [!thelang] offre modi più eleganti di scorrere [!python]una lista[/!][!scala]un vettore[/!] ed altri tipi di collezioni di dati ma questo sarà l'argomento di un'altra serie di esercizi a parte (che peraltro devono ancora essere scritti in PLM).[/!]

source: Declaring [!python]a list[/!][!java|scala]an array[/!]
it: Dichiarare [!python]una lista[/!][!java|scala]un vettore[/!]

source: If you know beforehand the content of your list, you can affect these values all together. Just put them between square braces and separated by commas as follows:
it: Se già conosci il contenuto della tua lista puoi assegnarli subito tutti i valori direttamente. Semplicemente metteteli fra parentesi quadrate e separateli con una virgola come nell'esempio seguente.

source: L = [1, 3, 5, 7, 9] <span class="comment"># L is now an array of 5 values, all of them being integers</span>
it: L = [1, 3, 5, 7, 9] <span class="comment"># L è ora una lista di 5 valori, tutti loro sono interi</span>

source: Otherwise, you probably want to create an empty list and then append each values separately to the list:
it: In alternativa potreste voler creare una lista vuota ed aggiungerle separatamente ogni valore.

source: L2 = [] <span class="comment"># L2 is now an empty list</span> L2.append(1) L2.append(3) L2.append(5) L2.append(7) L2.append(9) <span class="comment"># Its content is now the same as L previously</span>
it: L2 = [] <span class="comment"># L2 è ora una lista vuota</span> L2.append(1) L2.append(3) L2.append(5) L2.append(7) L2.append(9) <span class="comment"># adesso il suo contenuto è lo stesso di L</span>

source: To declare a variable named <b>T</b> that can store arrays of integers, one should write:
it: Per dichiarare una variabile chiamata <b>T</b> contenente un vettore di interi dovete scrivere:

source: [!java]<code>int</code> means that the elements of the array are of type integer; <code>[]</code> means that we are speaking of an array and <code>T</code> is the name of the variable. For historical reasons, this can also be written as <code>int T[]</code> (with the [] after the variable name), but this is less readable and should probably be avoided.[/!] [!scala]The <code>[Int]</code> notation specializes the Array type (that is generic), specifying that each cell of this array is an integer. An array of booleans would simply by written <code>Array[Boolean]</code>.[/!]
it: [!java]<code>int</code> significa che gli elementi del vettore sono di tipo intero; <code>[]</code> significa che stiamo parlando di un vettore e <code>T</code> è il nome della variabile. Per motivi storici è possibile anche scrivere <code>int T[]</code> (con le [] dopo il nome della variabile) ma questo è meno leggibile e andrebbe evitato.[/!] [!scala]La notazione <code>[Int]</code> specializza il tipo del vettore (che sarebbe generico) specificando che ogni sua cella contiene un intero. Similmente un vettore di booleani si scriverà <code>Array[Boolean]</code>.[/!]

source: Allocating an array
it: Allocare un vettore

source: Declaring a variable <code>T</code> that stores an array only reserve the <b>name</b> <code>T</code> for later use, but not the memory area to store the cells. The array is not initialized yet: it does not have any value. What would <code>[!java]T[4][/!][!scala]T(4)[/!]</code> mean if we didn't say that the array is 5 cells long?
it: Dichiarare una variabile <code>T</code> fa semplicemente posto ad un vettore riservandogli il <b>nome</b> <code>T</code> per usi successivi ma non gli riserva dello spazio di memoria per contenere le sue celle. Il vettore non è ancora stato inizializzato: esso non ha nessun valore. Che potrebbe mai voler dire <code>[!java]T[4][/!][!scala]T(4)[/!]</code> se non abbiamo ancora stabilito che il vettore è lungo 5 celle?

source: First and foremost, we have to give a value to <code>T</code>:
it: Prima di tutto dobbiamo dare un valore a <code>T</code>:

source: <code>new</code> means that we want to create something, and <code>[!java]int[10][/!][!scala]Array[Int](10)[/!]</code> means that it is an array of 10 integer values. In return, an array of 10 integer cells is created in memory, and the <code>T</code> variable <b>references</b> this array.
it: <code>new</code> significa che noi vogliamo creare qualcosa e <code>[!java]int[10][/!][!scala]Array[Int](10)[/!]</code> significa che quello che vogliamo creare è un vettore di 10 valori interi. Di consegueza in memoria viene creato un vettore di 10 celle di interi e la variabile <code>T</code> ci <b>referenzierà</b> ad esso.

source: The size of an array is fixed and cannot be changed after the creation of the array. The size of a <code>T</code> array can be retrieve by consulting the variable <code>T.length</code>.
it: La dimensione del vettore sarà fissa e non potrà essere cambiata dopo la sua creazione. Potremo conoscere la dimensione di <code>T</code> consultando la variabile <code>T.length</code>.
