Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: methodCallReadByThe[!java|scala]Compiler[/!][!python]Interpreter[/!]()[!java];[/!] <span class="comment">[!java|scala]//[/!][!python]#[/!] all this is ignored</span> otherCall()[!java];[/!] [!java|scala]<span class="comment">/* This is</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span class="comment"> also ignored */</span>[/!] [!python]<span class="comment">''' This is</span> <span class="comment">also ignored '''</span>[/!] yetAnotherCall()[!java];[/!]
it: chiamataAlMetodoLettaDal[!java|scala]Compilatore[/!][!python]lInterprete[/!]()[!java];[/!] <span class="comment">[!java|scala]//[/!][!python]#[/!] tutto questo viene ignorato</span> altraChiamata()[!java];[/!] [!java|scala]<span class="comment">/* Questo anche</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span class="comment"> viene ignorato */</span>[/!] [!python]<span class="comment">''' Questo anche</span> <span class="comment">viene ignorato '''</span>[/!] ulterioreChiamata()[!java];[/!]

source: There is a third kind of comments in Java, between /** and */, which are read by a specific program called JavaDoc to generate automatically the documentation explaining how to use the code. These comments must follow a very precise formalism.
it: In Java c'è un terzo tipo di commenti compresi fra /** ed */ che sono letti da uno specifico programma chiamato JavaDoc per generare automaticamente la documentazione che spiega come usare il codice. Questi commenti devono rispettare una precisa forma.

source: The comments on several lines are often used to document how to use the code, while others are more used to describe how this code works.
it: I commenti su più righe sono spesso usati per documentare sull'uso del codice mentre gli altri sono più usati per descrivere come effettivamente funziona il codice.

source: Some cells of the world are yellow, but your buggle cannot stand being in such cells. Write the necessary code to move forward until the ground gets white. For that, use the provided method <code>isGroundWhite()</code>.
it: Alcune celle del mondo sono gialle, ma i tuoi buggle non possono rimanere in queste celle. Scrivi il codice necessario per muoversi avanti finché il terreno non diventerà bianco. Per far questo usa il metodo <code>isGroundWhite()</code>.

source: The trick is that most buggles of this world are currently on this yellow ground that they dislike so much. That is why they are in panic, and every buggle rushes one cell forward, even the buggle that was not on a yellow cell at first. In other worlds, even if the ground is white on the first cell, you still want to move forward to the next cell.
it: L'inghippo sta nel fatto che molti buggle di questo mondo sono già sopra del terreno giallo ed a loro dispiace molto. Questo è il motivo per cui essi sono nel panico totale e si precipitano in avanti, anche i buggle che all'inizio non si trovano già su una casella gialla. In altre parole, anche se il pavimento è bianco nella prima cella dovete comunque muovervi nella casella successiva.

source: The general idea is to do something like:
it: L'idea generale è qualcosa di simile a questo:

source: move forward until located in a white cell
it: vai avanti fintanto che non sei su una cella bianca

source: The main difficulty is that we want this loop body to be executed once, even we are already on a white cell. It would be easy to do so by duplicating the loop content before the actual loop, but this would be a bad idea: code duplication is a <b>very</b> bad habit, and you should <b>always</b> avoid it.
it: La difficoltà maggiore è che vogliamo che il contenuto del ciclo sia eseguito almeno una volta, anche se ci troviamo già su una cella bianca. Potrebbe essere facile farlo semplicemente copiando il contenuto del ciclo ed incollandolo prima di esso ma questo non sarebbe una bella idea: la duplicazione del codice è <b>veramente</b> una cattiva abitudine e voi dovreste <b>sempre</b> evitarla.

source: Code duplication easily turns code maintenance into a nightmare: reading the code becomes difficult as the reader must ensure that no slight difference exist between the versions. Debugging the code becomes difficult, as bugs have to be fixed in all versions. Actually, every modification of the code becomes difficult. So, really, you should <b>always</b> strive to not duplicate you code if you can avoid. And the good news is that you always can...
it: La duplicazione finisce facilmente per rendere la manutenzione del codice un incubo: leggere diventa difficile perché chi sta leggendo deve assicurarsi che non ci sia nessuna piccola differenza fra le diverse copie. Correggere il codice diventa difficile in quanto gli errori devono essere rimossi in tutte le versioni. Qualsiasi modifica del codice diventa difficile. Per questo dovrestre <b>sempre</b> cercare di evitare la duplicazione del codice se possibile. E la buona notizia è che ciò è sempre possibile...

source: Executing the loop body at least once
it: Eseguendo il contenuto del ciclo almeno una volta

source: Some languages have specific constructs for that, but not the Python language. No problem, we can do it on our own! A good way is to have a dedicated variable indicating whether we are taking the loop for the first time or not, as follows.
it: Alcuni linguaggi hanno uno specifico costrutto per questo, ma non il Python. Nessun problema, possiamo farlo da soli! Un buon modo è creare una variabile dedicata ad indicare che stiamo eseguendo il ciclo per la prima volta oppure no, come di seguito:

source: firstTime = True while firstTime or (other conditions): firstTime = False (loop body)
it: primaVolta = True while primaVolta or (altre condizioni): primaVolta = False (corpo del ciclo)

source: When <code>firstTime</code> is true, the loop body is executed even if the other conditions would imply the contrary. Once the loop body has been executed once, it is set to false and never impact again the decision to enter the body or not.
it: Quando <code>primaVolta</code> è true il contenuto del ciclo viene eseguito anche se le altre condizioni sono false. Una volta che il contenuto del ciclo è stato eseguito una volta, la variabile assume il valore false e non avrà più nessuna influenza sulla decisione di eseguire il corpo del ciclo oppure no.

source: In a <tt>while</tt> loop, the condition is evaluated before anything else, and if it's false, the loop body is never evaluated. Sometimes (although not that often), you would prefer the loop body to get evaluated at least once, even if the condition is initially false. For that, a variation of the <tt>while</tt> loop gets used, using the following syntax in [!thelang]. [!java]Do not forget the semi-column (;) after the condition, it is mandatory.[/!]
it: Nel ciclo <tt>while</tt> prima di tutto viene valutata la condizione e se è false il corpo del ciclo non viene mai eseguito. Alle volte (non troppo spesso) preferireste che il corpo del ciclo venga eseguito almeno una volta anche se la condizione per eseguirlo sia false. Per far questo in [!thelang] viene usata una variante del ciclo <tt>while</tt> avente la seguente sintassi. [!java]Non dimenticate il punto e virgola (;) dopo la condizione, è obbligatorio.[/!]

source: do { <b>action()</b>[!java];[/!] } while (<b>condition</b>)[!java];[/!]
it: do { <b>azione()</b>[!java];[/!] } while (<b>condizione</b>)[!java];[/!]

source: Tracks of buggles
it: Tracciato dei buggle

source: Your buggle got lost in a strange maze, and you must help it finding the exit that is represented in orange. You cannot simply explain the path to the exit in something like <code>right();forward;forward();forward()</code> because you have to save two buggles at the same time, that are lost in similar but not identical worlds. You can switch to the other world by using the combobox above the world representation (where it's written 'Deep Forest' right now), and selecting the other entry (that should read 'Deeper Forest').
it: I tuoi buggle si sono persi in uno strano labirinto, è necessario che tu li aiuti a trovare l'uscita rappresentata dal colore arancione. Non puoi semplicemente mostrargli il percorso d'uscita con qualcosa di simile ad <code>right();forward;forward();forward()</code> perché tu devi salvare due buggle contemporaneamente che sono dispersi in mondi simili ma non identici. Puoi spostarti fra i due mondi utilizzando il menù a tendina sopra la rappresentazione del mondo (dove ora è scritto 'Deep Forest') e selezionare l'altra voce (che dovrebbe chiamarsi 'Deeper Forest').

source: The good news is that the path to the exit is written on the ground. As you can see, the world is made of several corridors, with baggles on the ground. After each corridor, you should turn left if the corridor contains three baggels or more, and you have to turn right if there is only 2 baggles or less.
it: La buona notizia è che il percorso d'uscita è scritto sul terreno. Come potete vedere il mondo è composto da diversi corridoi con dei baggle sul pavimento. Dopo ogni corridoio se si è incontrato tre o più baggle bisognerà girare a sinistra mentre per due o meno a destra.

source: You should count exactly 5 cells per corridor, the one at the intersection counting as the last cell of the previous corridor, not as the first cell after your turn.
it: Dovresti contare esattamente 5 celle per corridoio, quella dell'incrocio conta come l'ultima cella del corridoio appena percorso e non come prima cella del successivo, dopo aver girato.

source: So, the general form of your code must be something like "while I did not find the exit, take the next corridor to decide whether I should turn left or right at the next intersection". You can determine whether you are on the exit cell (that is orange) with the provided <code>exitReached()</code> method.
it: Quindi la forma generale del vostro codice deve essere qualcosa come "finché non trovo l'uscita prendo il prossimo corridoio per decidere se dovrò girare a destra o a sinistra al prossimo incrocio". Puoi determinare se ti trovi sulla cella di uscita (in arancione) con il metodo <code>exitReached()</code>

source: To take one corridor, you simply have to run from one intersection to another while counting the baggles you see on your path. The method <code>crossing()</code> tells you whether your buggle currently stands on an intersection. The extra complexity is that at the beginning of a corridor, you obviously stand on an intersection, but you still want to move on. [!java|scala]For that, the easiest is to use a <code>do / while</code> loop instead of a regular <code>while</code> loop to move until the next intersection.[/!] [!python]For that, use an extra variable indicating whether you already entered the corridor, as follows. This will ensure that you execute the loop body at least once (when <code>firstTime</code> is true) before we actually use the value returned by <code>crossing()</code> to determine to continue or not.[/!]
it: Per imboccare un corridoio devi semplicemente spostarti da un incrocio all'altro mentre conti i baggles che vedi sul tuo percorso. Il metodo <code>crossing()</code> ti dice se il buggle è nel bel mezzo di un incrocio. La complessita extra è che all'inizio di un corridoio, sei sì su un incrocio ma vorrai ancora spostarti in avanti. [!java|scala]In questo caso è più semplice utilizzare un ciclo <code>do / while</code> invece che un normale <code>while</code> per muoversi fino all'incrocio successivo.[/!] [!python]In questo caso usate una variabile extra che indica se siete già entrati nel corridoio, come mostrato quì sotto. Questo vi assicurerà di eseguire il contenuto del ciclo almeno una volta (quando <code>primaVolta</code> è true) prima di poter effettivamente utilizzare il valore restituito da <code>crossing()</code> per determinare se continuare o meno.[/!]

source: firstTime = True while firstTime or not crossing(): firstTime = False (your body)
it: primaVolta = True while primaVolta or not crossing(): primaVolta = False (corpo del tuo ciclo)

source: I cannot imagine how to count the baggles I see.
it: Non riesco ad immaginare come contare i baggle che vedo.

source: You need a variable that is initialized to 0, and incremented each time you see a baggle on the ground. A variable used this way is often called <i>counter</i>.
it: Hai bisogno di una variabile inizializzata a 0 e incrementarla ogni volta che vedi un baggle sul pavimento. Una variabile usata in questo modo è spesso chiamanta <i>contatore</i>.

source: Don't forget to reset your counter to 0 at the beginning of each corridor!
it: Non dimenticare di azzerare il tuo contatore all'inizio di ogni corridoio!

source: Oh, and when you reach the exit, don't forget to take an extra step to actually exit the maze!
it: Ah, e quando avrai raggiunto l'uscita, non dimenticare di fare uno step extra per uscire effettivamente dal labirinto.

source: Training Buggle
it: Allenamento Buggle

source: Today, your buggle wants to get some serious exercise: It wants to run 'till the track burns! Its super-shoes are just perfect to run like hell, but unfortunately, they can actually damage the track on the long run...
it: Quest'oggi il tuo buggle vuole esercitarsi seriamente: lui vuole correre fintantoché la pista non brucerà! Le sue super-scarpe sono perfette per correre come l'inferno ma sfortunatamente esse possono realmente danneggiare la pista a lung'andare...

source: Your goal is to run the track 10 times, no matter what happens. Even if the track suffers, you <b>really HAVE</b> to take that run. Remember, the track has four sides, that take eight steps each to run along. Now go, and show them what these super shoes can do.
it: Il traguardo è quello di fare 10 giri di pista indipendentemente da cosa accadrà. pista Anche se la pista soffrirà per questo, voi dovete <b>ASSOLUTAMENTE</b> terminare questa corsa. Ricordate, la pista ha quattro lati, ciascuno lungo otto passi. Adesso andate e dimostrate quanto queste super scarpe possono fare.

source: You don't have to do anything particular with regard of the colors: your shoes will do it for you. Just take that run!
it: Non dovete fare alcunché ai colori: le scarpe faranno tutto da sole. Concludete questa corsa!

source: Outdoor Training Buggle
it: Allenamento Buggle all'Aperto

source: Well, our last training didn't went that well. The track actually burned, and we are now banned from there. This time, our buggle decided to practice outdoor, in the middle of the forest, with its good old shoes instead. The problem is that you have to be careful to not fall into water. The track on which you can run is rather narrow: One side is now 4 steps forward, 2 steps to the left, 4 steps to the right, 2 steps to the right, 4 steps to the left, and you want to run 7 around.
it: Bene, il tuo ultimo allenamento non è andato troppo bene. La pista sta ancora bruciando e siamo stati cacciati da li. Questa volta il nostro buggle ha deciso di fare pratica all'aperto nel bel mezzo di una foresta con le sue buone vecchie scarpe. Il problema è che devi fare attenzione a non cadere nell'acqua. Il tracciato dove dovete correre è piuttosto stretto: Ora per percorrere un lato dovete dirigervi 4 passi in avanti, 2 passi a sinistra, 4 passi a destra, 2 passi a destra e 4 passi a sinistra. Volete compiere 7 giri.

source: Oh crap, running on the grass seems to destroy it too! So just take your 7 loops around the garden, and move along to the next exercise before anyone notices the damage you made...
it: Oh cavolo, anche correre sull'erba sembra distruggerla! Quindi fate i vostri 7 giri intorno al giardino e proseguite verso il prossimo esercizio prima che qualcuno si accorga dei danni che avete fatto...

source: While loops are well adapted to situations where you want to achieve an action while a condition stays true, but it is less adapted to achieve a given action a predetermined amount of time. For example, when we wanted to move <code>stepAmount</code> steps backward in a previous exercise, we had to create a new variable, initialize it, and move backward while incrementing this variable until it became equal to <code>stepAmount</code>.
it: I cicli while sono utili per le situazioni dove voi volete compiere un'azione fintantoché una condizione rimane true ma si adattano meno per compiere un'azione un determinato numero di volte. Per esempio in un precedente esercizio, quando volevamo muoverci <code>passiTotali</code> volte indietro, abbiamo dovuto creare una nuova variabile, iniziallizarla e muoverci indietro finché l'incremento di questa variabile non l'avrebbe resa uguale a <code>passiTotali</code>.

source: In such situations, <code>for</code> loops become handy. Their syntax is the following:
it: In situazioni simili i cicli <code>for</code> diventano utili. La loro sintassi è la seguente:

source: [!java]for (<b>initializing</b>; <b>condition</b>; <b>incrementing</b>) { <b>action</b>(); }[/!][!python]for <b>variable</b> in <b>sequence of values</b>: <b>action</b>()[/!][!scala] for (<b>variable</b> &lt;- <b>firstValue</b> to <b>lastValue</b>) { <b>action</b>(); }[/!]
it: [!java]for (<b>inizializzazione</b>; <b>condizione</b>; <b>incremento</b>) { <b>azione</b>(); }[/!][!python]for <b>variabile</b> in <b>sequenza di valori</b>: <b>azione</b>()[/!][!scala] for (<b>variabile</b> &lt;- <b>primoValore</b> to <b>ultimoValore</b>) { <b>azione</b>(); }[/!]

source: For example to repeat the the loop body <code>n</code> times, [!python] it is handy to use the instruction <code>range(n)</code> to generate the sequence n integer value from 0 to n-1.[/!] [!java|scala] one should write:[/!]
it: Per esempio per ripente il contenuto del ciclo <code>n</code> volte[!python] è utile usare l'istruzione <code>range(n)</code> per generare una sequenza di n valori interi da 0 fino ad n-1.[/!][!java|scala] dovreste scrivere:[/!]

source: [!java]for (int stepper=0; stepper&lt;n; stepper++) { <b>action</b>(); }[/!][!python]for <b>stepper</b> in <b>range(n)</b>: <b>action</b>()[/!][!scala] for (<b>stepper</b> &lt;- <b>1</b> to <b>n</b>) { <b>action</b>(); }[/!]
it: [!java]for (int stepper=0; stepper&lt;n; stepper++) { <b>azione</b>(); }[/!][!python]for <b>stepper</b> in <b>range(n)</b>: <b>azione</b>()[/!][!scala] for (<b>stepper</b> &lt;- <b>1</b> to <b>n</b>) { <b>azione</b>(); }[/!]

source: This code is then perfectly equivalent to the following one.
it: Il codice precedente è perfettamente equivalente a quello che segue:

source: [!java]int stepper = 0; while (stepper &lt; n) { &nbsp;&nbsp;&nbsp;&nbsp;<b>action</b>(); &nbsp;&nbsp;&nbsp;&nbsp;<b>stepper++</b>; }[/!][!python]stepper=0 while stepper &lt; n: action() stepper = stepper + 1[/!][!scala] var stepper = 1 while (stepper &lt;= n) { <b>action</b>() stepper = stepper + 1 }[/!]
it: [!java]int stepper = 0; while (stepper &lt; n) { &nbsp;&nbsp;&nbsp;&nbsp;<b>azione</b>(); &nbsp;&nbsp;&nbsp;&nbsp;<b>stepper++</b>; }[/!][!python]stepper=0 while stepper &lt; n: azione() stepper = stepper + 1[/!][!scala] var stepper = 1 while (stepper &lt;= n) { <b>azione</b>() stepper = stepper + 1 }[/!]

source: The <code>for</code> loop is easier to read, don't you think?
it: Il ciclo <code>for</code> è facile da leggere, non credete?

source: It is possible to build more advanced <tt>for</tt> loops since any valid instruction can be used as initialization, condition and incrementing instruction. The following example is a bit extreme as there is no need for a loop body to move the buggle forward until it reaches the wall, but it works well: all the work is done in the condition and incrementing instruction.
it: È possibile costruire cicli <tt>for</tt> più avanzati dato che qualsiasi istruzione valida può essere usata come inizializzazione, condizione ed incremento. Il seguente esempio è un po' estremo e mostra come non serva il contenuto di un ciclo per muovere i buggle in avanti fino ad arrivare al muro, ma funziona bene: tutto il lavoro viene svolto nelle istruzioni della condizione e dell'incremento.

source: for (; !isFacingWall() ; forward()) { <span class="comment">/* nothing in the loop body */</span> } <span class="comment">/* the buggle now faces a wall */</span>
it: for (; !isFacingWall() ; forward()) { <span class="comment">/* niente nel contenuto del ciclo */</span> } <span class="comment">/* ora i buggle fronteggiano il muro */</span>

source: If you want to nest several loops, you can do it on one line in Scala. This means that the two following chunks are equivalent:
it: se volete annidare diversi cicli in Scala potete farlo su una sola riga. Questo significa che i due seguenti spezzoni di codice sono equivalenti:

source: for (stepper1 &lt;- 1 to n) { for (stepper2 &lt;- 1 to m) { actions() } }
it: for (stepper1 &lt;- 1 to n) { for (stepper2 &lt;- 1 to m) { azioni() } }

source: for (stepper1 &lt;- 1 to n; stepper2 &lt;- 1 to m) { <span class="comment">// Simply separate both loop conditions with a semi-column</span> actions() }
it: for (stepper1 &lt;- 1 to n; stepper2 &lt;- 1 to m) { <span class="comment">// Separare semplicemente le condizioni di entrambi i loop con un punto e virgola</span> azioni() }

source: You now have to redo the same exercise than previously (move forward until being over a baggle, pick it up, move back to your original location, drop the baggle), but using a <code>for</code> loop instead of a <code>while</code> loop to move back to the initial location.
it: Ora dovete rifare lo stesso vecchio esercizio (muoversi avanti fino a sormontare un baggle, prenderlo, ritornare indietro alla posizione iniziale, posare il baggle) ma usando un ciclo <code>for</code> invece che un ciclo <code>while</code> per tornare indietro alla posizione iniziale.

source: Once done, you can proceed to next exercise.
it: Quando avrete finito potrete procedere al prossimo esercizio.

source: Stairway to Heaven
it: Scala per il paradiso

source: Your buggle feels a bit depressed today, but it's currently facing a magic stair: It leads directly to heaven, and each time you walk on it, joyful colors spur all around.
it: Il tuo buggle si sente un po' depresso oggi ma in questo momento ha davanti una scala magica: essa lo conduce direttamente in paradiso ed ogni volta che fai un passo su di essa, gioiosi colori s'imprimono tutt'intorno.

source: Your goal is to take this stair, one step after the other. First devise the four instructions you have to give you buggle to take one stair step, and then put them in a loop to take the whole stair.
it: Il tuo scopo è quello di salire questa scala un passo dopo l'altro. Prima pensa alle quattro istruzioni che devi dare al tuo buggle per salire un gradino e poi mettile in un ciclo per salire l'intera scala.

source: Before that, walk a bit forward to reach that stair, and ensure that you are in the right situation for your loop content to run properly. And once you reach the heaven, take some steps in your new home. Meanwhile, you just have to walk your way, the colors appear automagically.
it: Prima di questo, vai un po'avanti per raggiungere la scala ed assicurati di posizionarti correttamente perché il contenuto del tuo ciclo possa avere luogo correttamente. E quando avrai raggiunto il paradiso, fai alcuni passi nella tua nuova casa. Mentre prosegui semplicemente per la tua strada i colori appariranno magicamente da soli.
