Repository: Adrien-Luxey/PLM
Catalog: l10n/missions/*.po
Languages: it

source: Here are some existing types in [!thelang]:
it: Ci sono diversi tipi esistenti in [!thelang]:

source: <b>[!java]int[/!][!scala]Int[/!]</b>, for integers;
it: <b>[!java]int[/!][!scala]Int[/!]</b>, per i numeri interi;

source: <b>[!java]double[/!][!scala]Double[/!]</b>, for dot numbers;
it: <b>[!java]double[/!][!scala]Double[/!]</b>, per i numeri con la virgola;

source: <b>[!java]boolean[/!][!scala]Boolean[/!]</b>, for booleans that are values being either true or false;
it: <b>[!java]boolean[/!][!scala]Boolean[/!]</b>, per i booleani che hanno valori true o false;

source: <b>String</b>, for char strings.
it: <b>String</b>, per stringhe di caratteri.

source: As you can see, the variables are not <b>typed</b> in Python, which means that they are not specialized in any type of data. A given variable store any type of data of a given type: you can store a number in a variable and latter on store a number in the same variable. The values themselves are still typed, but not the variable. Python is said to be <b>dynamically typed</b>.
it: Come potete vedere le variabili in Python non sono <b>tipizzate</b>, che significa che non sono specializzate in nessun tipo di dato. Una data variabile può immagazzinare indistintamente qualsiasi tipo di dato: potete memorizzare un numero in una variabile ed in un secondo momento metterci una lettera. Il valore è ancora tipizzato ma non la variabile. Python viene quindi definito <b>dinamicamente tipizzato</b>.

source: Other languages (such as Java or Scala) are much more picky and prevent you to mix data types in a given variable (they are said to be <b>statically typed</b>). This seems annoying at the first glance, but this kind of restriction allows the compiler to catch more logic errors for you, which is also good. In some sense, Python is easier to write but errors can sneak in more easily.
it: Altri linguaggi (come Java o Scala) sono molto più esigenti e precludono la possibilità di mischiare i tipi di dato in una variabile (vengono chiamati <b>staticamente tipizzati</b>). Questo potrebbe sembrare noioso ad una prima occhiata ma codeste restrizioni permettono al compilatore di generarvi più errori logici, il che potrebbe anche essere un bene. In un certo senso è più facile scrivere in Python ma gli errori possono occultarsi più facilmente.

source: If you know that the value of your "variable" will never change (eg because it contains the screen size or some other constant value), then you should make it a <b>value</b> instead of a variable. Simply change the <code>var</code> keyword with the <code>val</code> one. The compiler can then perform more verifications and catch when you inadvertently modify the value. More interestingly, the compiler can produce faster code in some cases.
it: Se sapete che il valore della vostra "variabile" non cambierà mai (ad esempio perché contiene la dimensione dello schermo o altri valori costanti) allora potete utilizzare direttamente un <b>valore</b> piuttosto che una variabile. Semplicemente cambiate la parolachiave <code>var</code> con <code>val</code>. Il compilatore potrà fare più verifiche ed avvertirvi quando modificherete il valore per sbaglio. Ancora più interessante è sapere che il complatorepotrebbe produrre codice più veloce in alcuni casi.

source: Variables work very similarly for strings, floating point numbers and boolean values.
it: Le variabili funzionano in modo molto simile per stringhe, numeri in virgola mobile e valori boleani.

source: String name = "Martin Quinson"; double height=1.77; <span class="comment">// in meters</span> boolean married=true;<span class="comment">// the contrary would be written "false"</span>
it: String nome = "Martin Quinson"; double altezza=1.77; <span class="comment">// In metri</span> boolean sposato=true;<span class="comment">// il contrario si scriverebbe "false"</span>

source: val name:String = "Martin Quinson"; <span class="comment">// this cannot be modified (it's a value)</span> var height: Double = 1.77; <span class="comment">// in meters</span> var married = true; <span class="comment">// the contrary would be written "false"</span> <span class="comment">// Scala knows that 'true' is a Boolean value, no need to repeat it here</span>
it: val nome:String = "Martin Quinson"; <span class="comment">// questo non può essere modificato (è un valore)</span> var altezza: Double = 1.77; <span class="comment">// in metri</span> var sposato = true; <span class="comment">// il contrario si scriverebbe "false"</span> <span class="comment">// Scala sa che 'true' è un valore Boolean e quindi non c'è bisogno di specificarlo</span>

source: firstName = "Martin" lastName = 'Quinson' <span class="comment"># both single and double quote work here</span> motto = "I never finish anyth' (but I keep trying)" <span class="comment"># having single quote within double quote is fine</span> height=1.77 <span class="comment"># in meters</span> married=True <span class="comment"># the contrary would be written "False"</span>
it: nome = "Martin" cognome = 'Quinson' <span class="comment"># sia gli apici che i doppi apici (virgolette) funzionano ugualmente</span> motto = "Non finisco mai nie' (ma ci provo)" <span class="comment"># è ok avere apici singoli all'interno delle virgolette</span> altezza=1.77 <span class="comment"># in metri</span> sposato=True <span class="comment"># il contrario si scriverebbe "false"</span>

source: Affectations
it: Assegnazione

source: Once your variable is declared, you can <b>affect</b> a new value to it later in the program. That's really easy:
it: Dopo aver dichiarato una variabile è possibile <b>assegnare</b> un nuovo valore ad essa. Questo è veramente semplice:

source: To the right of the equal symbol, you can put an arithmetic expression containing constants, variables and operations.
it: A destra del simbolo di uguaglianza potete mettere un espressione aritmetica contenente costanti, variabili e operazioni.

source: x = 3 + 2[!java];[/!] x = 3 * x[!java];[/!] greeting = "Hello "+name[!java];[/!] <span class="comment">[!python]#[/!][!scala|java]//[/!] + is (also) the operation to concatenate (ie, to join) strings</span>
it: x = 3 + 2[!java];[/!] x = 3 * x[!java];[/!] saluto = "Ciao "+nome[!java];[/!] <span class="comment">[!python]#[/!][!scala|java]//[/!] + è (anche) l'operazione per concatenare (unire) le stringhe</span>

source: It is now time to do more challenging exercises, don't you think? The objective is now to move forward until you find a baggle, pick it up, and then move back to your initial location before dropping the baggle.
it: È arrivato il momento di fare esercizi più competitivi, non trovate? L'obiettivo è ora di muoversi avanti fintanto che non si trova un baggle, prenderlo e tornare indietro alla posizione iniziale per poggiarlo.

source: How to do this?
it: Come fare?

source: To solve this problem, you have to decompose it in easier sub-parts. For example, you may want to do the following steps:
it: Per risolvere questo problema bisogna scomporlo in parti più semplici. Per esempio potresti eseguire questi punti:

source: Move forward until located over a baggle
it: Muoviti avanti fino a trovarsi su un baggle

source: Pickup the baggle
it: Prendi il baggle

source: Move backward of the same amount of steps than done in first step
it: Muoviti indietro dello stesso ammontare di passi fatti nel primo punto

source: Drop back the baggle
it: Posa a terra il baggle

source: Naturally, it is impossible to do the right amount of steps backward at step 3 if you didn't count the amount of steps done in the first phase. You can use a variable for that, which can be named <code>stepAmount</code>.
it: Naturalmene è impossibile fare il giusto numero di passi indietro al punto 3 se non avete contato quelli fatti nel punto 1. Per fare questo potete usare una variabile chiamata <code>passiTotali</code>.

source: Create an integer variable before phase 1, initialize it to 0, and each time you move one step forward, increment its value by one (<code>stepAmount = stepAmount + 1;</code>[!java] or <code>stepAmount++;</code>, both syntaxes being equivalent[/!]). Such variable which takes every values of a given range is often called a <b>stepper</b>.
it: Create una variabile di tipo intero prima della fase 1, inizializzatela a 0 ed ogni volta che vi muovete di un passo in avanti incrementate il suo valore di uno (<code>passiTotali = passiTotali + 1;</code>[!java] oppure <code>passiTotali++;</code>, entrambe le sintassi sono equivalenti[/!]). Variabili di questo tipo che assumono ogni valore di un dato intervallo sono spesso chiamate <b>stepper</b> (Ndt "contapassi", un contatore a passo fisso, non credo abbia traduzione in italiano). in

source: If you know Java or other languages, you will probably try to use the <code>++</code> operator to increment the variable, but it's not allowed in [!thelang]. This is because it would be difficult to define this operator for every data types. For example, what should ++ do when applied to a Complex value or to a String? The problem does not occur in Java as <code>int</code> is not an object but a primitive type. (if you don't know the <code>++</code>, just ignore this paragraph: it does not exist in [!thelang])
it: Se conoscete il Java o un altro linguaggio probabilmente proverete ad usare l'operatore <code>++</code> per incrementare la variabile ma questo non è possibile in [!thelang]. Il motivo è che sarebbe difficile definire questo operatore per ogni tipo di dato esistente. Per esempio cosa dovrebbe fare ++ se applicato su un valore Complesso oppure una Stringa? Questo problema non accade in Java perché <code>int</code> non è un oggetto ma un tipo primitivo. (se non conoscete l'operatore <code>++</code> ignorate questo paragrafo: esso non esiste in [!thelang])

source: Then, phase 3 consists in simply creating a new integer variable <code>doneSteps</code> initialized to 0, and do one step backward as long as <code>doneSteps</code> is not equal to <code>stepAmount</code>, incrementing <code>doneSteps</code> each time. The <code>!=</code> operator should be used to test the inequality (whether some values are NOT equal).
it: La fase 3 consiste nella semplice creazione di una nuova variabile intera <code>passiCompiuti</code>, inizializzarla a 0 e fare un passo indietro fintanto che <code>passiCompiuti</code> non eguaglia <code>passiTotali</code>, incrementando di volta in volta <code>passiCompiuti</code>. L'operatore <code>!=</code> dovrebbe essere utilizzato per testare la disuguaglianza (se alcuni valori NON sono uguali):

source: It's your turn now!
it: Ed adesso è il vostro turno!
